; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/gameseq.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/gameseq.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.player = type { [9 x i8], [4 x i8], i16, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i16, i16, i16, [10 x i16], [10 x i16], i16, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i32, i8, i8 }
%struct.obj_position = type { %struct.vms_vector, %struct.vms_matrix, i16 }
%struct.vms_vector = type { i32, i32, i32 }
%struct.vms_matrix = type { %struct.vms_vector, %struct.vms_vector, %struct.vms_vector }
%struct.object = type { i32, i8, i8, i16, i16, i8, i8, i8, i8, i16, i16, %struct.vms_vector, %struct.vms_matrix, i32, i32, %struct.vms_vector, i8, i8, i8, i8, i32, %union.anon, %union.anon.0, %union.anon.1 }
%union.anon = type { %struct.physics_info }
%struct.physics_info = type { %struct.vms_vector, %struct.vms_vector, i32, i32, i32, %struct.vms_vector, %struct.vms_vector, i16, i16 }
%union.anon.0 = type { %struct.ai_static }
%struct.ai_static = type { i8, [11 x i8], i16, i16, i16, i8, i8, i16, i32, i32 }
%union.anon.1 = type { %struct.polyobj_info }
%struct.polyobj_info = type { i32, [10 x %struct.vms_angvec], i32, i32, i32 }
%struct.vms_angvec = type { i16, i16, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Current_level_num", scope: !2, file: !29, line: 139, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !26, imports: !395, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "/Users/richard/code/ChocolateDescent/main_d2/gameseq.cpp", directory: "/Users/richard/code/ChocolateDescent/build-c-ref", checksumkind: CSK_MD5, checksum: "ccc706ac29acfa3b2de8d91a72e22710")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DataVer", file: !6, line: 72, baseType: !7, size: 32, flags: DIFlagEnumClass, elements: !8, identifier: "_ZTS7DataVer")
!6 = !DIFile(filename: "main_d2/inferno.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "f9bd7760bcc54609c0547a3a7ca7ee90")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "DEMO", value: 0)
!10 = !DIEnumerator(name: "FULL", value: 1)
!11 = !{!12, !16, !20, !21, !23}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !14, line: 31, baseType: !15)
!14 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!15 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 31, baseType: !19)
!18 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !24, line: 30, baseType: !25)
!24 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!25 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!26 = !{!0, !27, !30, !35, !37, !39, !41, !43, !111, !136, !138, !140, !142, !144, !150, !155, !160, !165, !167, !172, !174, !176, !181, !186, !191, !194, !199, !201, !206, !209, !214, !219, !224, !229, !234, !236, !241, !243, !245, !250, !253, !258, !263, !265, !268, !270, !273, !278, !280, !282, !284, !289, !294, !299, !301, !303, !305, !310, !312, !314, !316, !321, !323, !325, !327, !329, !331, !334, !339, !341, !343, !345, !347, !352, !354, !359, !362, !364, !366, !371, !376, !378, !380, !382, !384, !387}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "Next_level_num", scope: !2, file: !29, line: 139, type: !7, isLocal: false, isDefinition: true)
!29 = !DIFile(filename: "main_d2/gameseq.cpp", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "ccc706ac29acfa3b2de8d91a72e22710")
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "Current_level_name", scope: !2, file: !29, line: 140, type: !32, isLocal: false, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 288, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 36)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "Last_level", scope: !2, file: !29, line: 143, type: !7, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "Last_secret_level", scope: !2, file: !29, line: 143, type: !7, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "N_players", scope: !2, file: !29, line: 147, type: !7, isLocal: false, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "Player_num", scope: !2, file: !29, line: 148, type: !7, isLocal: false, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "Players", scope: !2, file: !29, line: 149, type: !45, isLocal: false, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 14208, elements: !109)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "player", file: !47, line: 118, baseType: !48)
!47 = !DIFile(filename: "main_d2/player.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "8ffee99de4d393c8ae4578dcf4efebc6")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "player", file: !47, line: 65, size: 1184, flags: DIFlagTypePassByValue, elements: !49, identifier: "_ZTS6player")
!49 = !{!50, !54, !58, !59, !63, !64, !65, !66, !70, !75, !76, !77, !78, !79, !80, !81, !82, !83, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "callsign", scope: !48, file: !47, line: 67, baseType: !51, size: 72)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 72, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 9)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "net_address", scope: !48, file: !47, line: 68, baseType: !55, size: 32, offset: 72)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 4)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "net_port", scope: !48, file: !47, line: 69, baseType: !13, size: 16, offset: 112)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "connected", scope: !48, file: !47, line: 70, baseType: !60, size: 8, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !61, line: 30, baseType: !62)
!61 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!62 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "objnum", scope: !48, file: !47, line: 71, baseType: !7, size: 32, offset: 160)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "n_packets_got", scope: !48, file: !47, line: 72, baseType: !7, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "n_packets_sent", scope: !48, file: !47, line: 73, baseType: !7, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !48, file: !47, line: 78, baseType: !67, size: 32, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !68, line: 31, baseType: !69)
!68 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !48, file: !47, line: 79, baseType: !71, size: 32, offset: 288)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "fix", file: !72, line: 20, baseType: !73)
!72 = !DIFile(filename: "./fix/fix.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c5006a11bf8b4cb7d963898499eda13a")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !74, line: 30, baseType: !7)
!74 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!75 = !DIDerivedType(tag: DW_TAG_member, name: "shields", scope: !48, file: !47, line: 80, baseType: !71, size: 32, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "lives", scope: !48, file: !47, line: 81, baseType: !17, size: 8, offset: 352)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !48, file: !47, line: 82, baseType: !60, size: 8, offset: 360)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "laser_level", scope: !48, file: !47, line: 83, baseType: !17, size: 8, offset: 368)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "starting_level", scope: !48, file: !47, line: 84, baseType: !60, size: 8, offset: 376)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "killer_objnum", scope: !48, file: !47, line: 85, baseType: !20, size: 16, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "primary_weapon_flags", scope: !48, file: !47, line: 86, baseType: !13, size: 16, offset: 400)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_weapon_flags", scope: !48, file: !47, line: 87, baseType: !13, size: 16, offset: 416)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "primary_ammo", scope: !48, file: !47, line: 88, baseType: !84, size: 160, offset: 432)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 10)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_ammo", scope: !48, file: !47, line: 89, baseType: !84, size: 160, offset: 592)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !48, file: !47, line: 91, baseType: !13, size: 16, offset: 752)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "last_score", scope: !48, file: !47, line: 96, baseType: !7, size: 32, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !48, file: !47, line: 97, baseType: !7, size: 32, offset: 800)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "time_level", scope: !48, file: !47, line: 98, baseType: !71, size: 32, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "time_total", scope: !48, file: !47, line: 99, baseType: !71, size: 32, offset: 864)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cloak_time", scope: !48, file: !47, line: 101, baseType: !71, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "invulnerable_time", scope: !48, file: !47, line: 102, baseType: !71, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "KillGoalCount", scope: !48, file: !47, line: 104, baseType: !20, size: 16, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "net_killed_total", scope: !48, file: !47, line: 105, baseType: !20, size: 16, offset: 976)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "net_kills_total", scope: !48, file: !47, line: 106, baseType: !20, size: 16, offset: 992)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "num_kills_level", scope: !48, file: !47, line: 107, baseType: !20, size: 16, offset: 1008)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "num_kills_total", scope: !48, file: !47, line: 108, baseType: !20, size: 16, offset: 1024)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "num_robots_level", scope: !48, file: !47, line: 109, baseType: !20, size: 16, offset: 1040)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "num_robots_total", scope: !48, file: !47, line: 110, baseType: !20, size: 16, offset: 1056)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hostages_rescued_total", scope: !48, file: !47, line: 111, baseType: !13, size: 16, offset: 1072)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "hostages_total", scope: !48, file: !47, line: 112, baseType: !13, size: 16, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hostages_on_board", scope: !48, file: !47, line: 113, baseType: !17, size: 8, offset: 1104)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hostages_level", scope: !48, file: !47, line: 114, baseType: !17, size: 8, offset: 1112)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "homing_object_dist", scope: !48, file: !47, line: 115, baseType: !71, size: 32, offset: 1120)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "hours_level", scope: !48, file: !47, line: 116, baseType: !60, size: 8, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "hours_total", scope: !48, file: !47, line: 117, baseType: !60, size: 8, offset: 1160)
!109 = !{!110}
!110 = !DISubrange(count: 12)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "Player_init", scope: !2, file: !29, line: 150, type: !113, isLocal: false, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 3328, elements: !134)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "obj_position", file: !115, line: 266, baseType: !116)
!115 = !DIFile(filename: "main_d2/object.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "1f2325d356aae4b692933d2aae4f3afd")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obj_position", file: !115, line: 261, size: 416, flags: DIFlagTypePassByValue, elements: !117, identifier: "_ZTS12obj_position")
!117 = !{!118, !126, !133}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !116, file: !115, line: 263, baseType: !119, size: 96)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_vector", file: !120, line: 22, baseType: !121)
!120 = !DIFile(filename: "./vecmat/vecmat.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "dfa84e3325c1ea4f5f74699fff5ef2bf")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_vector", file: !120, line: 19, size: 96, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTS10vms_vector")
!122 = !{!123, !124, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !121, file: !120, line: 21, baseType: !71, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !121, file: !120, line: 21, baseType: !71, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !121, file: !120, line: 21, baseType: !71, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "orient", scope: !116, file: !115, line: 264, baseType: !127, size: 288, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_matrix", file: !120, line: 47, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_matrix", file: !120, line: 44, size: 288, flags: DIFlagTypePassByValue, elements: !129, identifier: "_ZTS10vms_matrix")
!129 = !{!130, !131, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rvec", scope: !128, file: !120, line: 46, baseType: !119, size: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "uvec", scope: !128, file: !120, line: 46, baseType: !119, size: 96, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "fvec", scope: !128, file: !120, line: 46, baseType: !119, size: 96, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !116, file: !115, line: 265, baseType: !20, size: 16, offset: 384)
!134 = !{!135}
!135 = !DISubrange(count: 8)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "MaxNumNetPlayers", scope: !2, file: !29, line: 153, type: !7, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "NumNetPlayerPositions", scope: !2, file: !29, line: 154, type: !7, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "Do_appearance_effect", scope: !2, file: !29, line: 171, type: !7, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "First_secret_visit", scope: !2, file: !29, line: 175, type: !7, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !29, line: 207, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, elements: !148)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!148 = !{!149}
!149 = !DISubrange(count: 16)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(scope: null, file: !29, line: 207, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 456, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 57)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !29, line: 208, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 256, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 32)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !29, line: 210, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 272, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 34)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !29, line: 211, type: !157, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !29, line: 339, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 416, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 52)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "StartingShields", scope: !2, file: !29, line: 414, type: !71, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "flash_dist", scope: !2, file: !29, line: 828, type: !71, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "playername_allowed_chars", scope: !2, file: !29, line: 865, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 88, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 11)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !29, line: 893, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 56, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 7)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(scope: null, file: !29, line: 895, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 24, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 3)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !29, line: 909, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 88, elements: !179)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !29, line: 960, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 48, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 6)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "Bitmap_replacement_data", scope: !2, file: !29, line: 1000, type: !16, isLocal: false, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1030, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 40, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 5)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1049, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !134)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1057, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 192, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 24)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1115, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 608, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 76)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1140, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 336, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 42)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1214, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 352, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 44)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1319, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 176, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 22)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1359, type: !196, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1373, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 168, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 21)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1377, type: !203, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1382, type: !188, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1406, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 144, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 18)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1406, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 32, elements: !56)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1406, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 16, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 2)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1408, type: !260, isLocal: true, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 136, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 17)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1410, type: !247, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1414, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 96, elements: !109)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1423, type: !193, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1423, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 80, elements: !85)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1425, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 216, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 27)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1440, type: !146, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1477, type: !193, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1528, type: !255, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1563, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 440, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 55)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1571, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 248, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 31)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1573, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 224, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 28)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "Entered_from_level", scope: !2, file: !29, line: 1654, type: !7, isLocal: false, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1674, type: !193, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1730, type: !211, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1768, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 104, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 13)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1795, type: !193, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1817, type: !146, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1818, type: !267, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1819, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 120, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 15)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1823, type: !208, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1824, type: !252, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1838, type: !183, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1842, type: !183, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1869, type: !267, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "Secret_level_table", scope: !2, file: !29, line: 1880, type: !333, isLocal: false, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !197)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1889, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 112, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 14)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !29, line: 1924, type: !231, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2040, type: !231, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2059, type: !231, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2079, type: !226, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2232, type: !349, isLocal: true, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 280, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 35)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2374, type: !162, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2406, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 200, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 25)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2412, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 72, elements: !52)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2464, type: !193, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2481, type: !272, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2511, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 480, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 60)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2588, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 328, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 41)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2591, type: !318, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2592, type: !162, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2649, type: !211, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !29, line: 2651, type: !231, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!385 = distinct !DIGlobalVariable(name: "FRACBITS", scope: !2, file: !72, line: 18, type: !386, isLocal: true, isDefinition: true)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "intro_movie", scope: !2, file: !29, line: 2419, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 1120, elements: !184)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 2416, size: 160, flags: DIFlagTypePassByValue, elements: !391)
!391 = !{!392, !393}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "level_num", scope: !390, file: !29, line: 2417, baseType: !7, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "movie_name", scope: !390, file: !29, line: 2418, baseType: !394, size: 104, offset: 32)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 104, elements: !308)
!395 = !{!396, !400, !403, !404, !405, !406, !407, !408, !412, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !441, !443, !445, !451, !455, !458, !461, !466, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !498, !503, !508, !513, !518, !520, !523, !525, !527, !529, !531, !533, !535, !537, !539, !541, !545, !550, !554, !556, !560, !564, !577, !592, !593, !646, !655, !657, !665, !671, !675, !679, !681, !685, !689, !693, !697, !701, !705, !707, !709, !713, !719, !724, !728, !732, !736, !740, !744, !748, !752, !754, !756, !760, !762, !766, !770, !775, !777, !779, !781, !785, !789, !793, !795, !799, !801, !803, !805, !807, !813, !817, !819, !825, !830, !834, !838, !843, !848, !852, !856, !860, !864, !866, !868, !876, !882, !888, !892, !896, !900, !904, !909, !913, !917, !921, !925, !929, !933, !937, !941, !946, !950, !954, !958, !963, !968, !972, !974, !978, !980, !989, !993, !998, !1002, !1006, !1010, !1014, !1016, !1020, !1024, !1028, !1032, !1036, !1038, !1040, !1042, !1050, !1052, !1054, !1056, !1062, !1064, !1065, !1066, !1067, !1070, !1072, !1073, !1077, !1079, !1081, !1085, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1104, !1108, !1110, !1112, !1113, !1118, !1120, !1122, !1124, !1126, !1128, !1130, !1132, !1134, !1136, !1138, !1140, !1142, !1144, !1146, !1148, !1150, !1154, !1156, !1158, !1160, !1164, !1166, !1170, !1172, !1174, !1176, !1178, !1182, !1184, !1186, !1190, !1192, !1194, !1198, !1200, !1204, !1206, !1208, !1212, !1214, !1216, !1218, !1220, !1222, !1224, !1228, !1230, !1232, !1234, !1236, !1238, !1240, !1242, !1246, !1250, !1252, !1254, !1256, !1258, !1260, !1262, !1264, !1266, !1268, !1270, !1272, !1274, !1276, !1278, !1280, !1282, !1284, !1286, !1288, !1292, !1294, !1296, !1298, !1302, !1304, !1308, !1310, !1312, !1314, !1316, !1320, !1322, !1326, !1328, !1330, !1332, !1334, !1338, !1340, !1342, !1346, !1348, !1350, !1352, !1358, !1360, !1364, !1368, !1370, !1372, !1376, !1380, !1384, !1386, !1390, !1395, !1399, !1403, !1405, !1407, !1409, !1411, !1413, !1415, !1419, !1423, !1428, !1433, !1437, !1438, !1442, !1446, !1451, !1456, !1460, !1466, !1470, !1472, !1476, !1478, !1479, !1483, !1485, !1489, !1493, !1497, !1499, !1503, !1507, !1511, !1517, !1519, !1523, !1527, !1531, !1533, !1537, !1541, !1545, !1547, !1549, !1551, !1555, !1559, !1564, !1568, !1574, !1578, !1582, !1584, !1586, !1588, !1592, !1596, !1600, !1602, !1604, !1608, !1612, !1614, !1618, !1622, !1625, !1627, !1629, !1631, !1660, !1665, !1670}
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !60, file: !399, line: 158)
!397 = !DINamespace(name: "__1", scope: !398, exportSymbols: true)
!398 = !DINamespace(name: "std", scope: null)
!399 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdint", directory: "")
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !401, file: !399, line: 159)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !402, line: 30, baseType: !20)
!402 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !73, file: !399, line: 160)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !23, file: !399, line: 161)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !17, file: !399, line: 163)
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !13, file: !399, line: 164)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !67, file: !399, line: 165)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !409, file: !399, line: 166)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !410, line: 31, baseType: !411)
!410 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!411 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !413, file: !399, line: 168)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !414, line: 29, baseType: !60)
!414 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !416, file: !399, line: 169)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !414, line: 30, baseType: !401)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !418, file: !399, line: 170)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !414, line: 31, baseType: !73)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !420, file: !399, line: 171)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !414, line: 32, baseType: !23)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !422, file: !399, line: 173)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !414, line: 33, baseType: !17)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !424, file: !399, line: 174)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !414, line: 34, baseType: !13)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !426, file: !399, line: 175)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !414, line: 35, baseType: !67)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !428, file: !399, line: 176)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !414, line: 36, baseType: !409)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !430, file: !399, line: 178)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !414, line: 40, baseType: !60)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !432, file: !399, line: 179)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !414, line: 41, baseType: !401)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !434, file: !399, line: 180)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !414, line: 42, baseType: !73)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !436, file: !399, line: 181)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !414, line: 43, baseType: !23)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !438, file: !399, line: 183)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !414, line: 44, baseType: !17)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !440, file: !399, line: 184)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !414, line: 45, baseType: !13)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !442, file: !399, line: 185)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !414, line: 46, baseType: !67)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !444, file: !399, line: 186)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !414, line: 47, baseType: !409)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !446, file: !399, line: 188)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !447, line: 32, baseType: !448)
!447 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !449, line: 40, baseType: !450)
!449 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!450 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !452, file: !399, line: 189)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !453, line: 34, baseType: !454)
!453 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!454 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !456, file: !399, line: 191)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !457, line: 32, baseType: !450)
!457 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !459, file: !399, line: 192)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !460, line: 32, baseType: !454)
!460 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !462, file: !465, line: 22)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !463, line: 16, baseType: !464)
!463 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/lib/clang/20/include/__stddef_max_align_t.h", directory: "", checksumkind: CSK_MD5, checksum: "3c0a2f19d136d39aa835c737c7105def")
!464 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!465 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__cstddef/max_align_t.h", directory: "")
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !467, file: !471, line: 113)
!467 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !468, file: !468, line: 217, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "b10215117a277691ffc4168ac4505796")
!469 = !DISubroutineType(types: !470)
!470 = !{!7, !7}
!471 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cctype", directory: "")
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !473, file: !471, line: 114)
!473 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !468, file: !468, line: 223, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !475, file: !471, line: 115)
!475 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !468, file: !468, line: 229, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !477, file: !471, line: 116)
!477 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !468, file: !468, line: 235, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !479, file: !471, line: 117)
!479 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !468, file: !468, line: 242, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !481, file: !471, line: 118)
!481 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !468, file: !468, line: 248, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !483, file: !471, line: 119)
!483 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !468, file: !468, line: 254, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !485, file: !471, line: 120)
!485 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !468, file: !468, line: 260, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !487, file: !471, line: 121)
!487 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !468, file: !468, line: 266, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !489, file: !471, line: 122)
!489 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !468, file: !468, line: 272, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !491, file: !471, line: 123)
!491 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !468, file: !468, line: 278, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !493, file: !471, line: 124)
!493 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !468, file: !468, line: 285, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !495, file: !471, line: 125)
!495 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !468, file: !468, line: 297, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !497, file: !471, line: 126)
!497 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !468, file: !468, line: 303, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !499, file: !502, line: 75)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !500, line: 32, baseType: !501)
!500 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "6dfd3a3d5009054224653c03b2c2b6ac")
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !449, line: 111, baseType: !7)
!502 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwctype", directory: "")
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !504, file: !502, line: 76)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !505, line: 32, baseType: !506)
!505 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctrans_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70040c8494301cc74e19df26f4c1d76")
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !507, line: 44, baseType: !7)
!507 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "c789da493a5b476a3618b20a8fcff3c3")
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !509, file: !502, line: 77)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !510, line: 32, baseType: !511)
!510 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctype_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8d1720b82a490c742e6a297f971be2a2")
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !507, line: 46, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !449, line: 36, baseType: !69)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !514, file: !502, line: 78)
!514 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !515, file: !515, line: 84, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/___wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "d5a8bf0b4062c20bda4d49376e5b44d9")
!516 = !DISubroutineType(types: !517)
!517 = !{!7, !499}
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !519, file: !502, line: 79)
!519 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !515, file: !515, line: 90, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !521, file: !502, line: 80)
!521 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !522, file: !522, line: 53, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "6bc93063cb32b00d3df790305c546a93")
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !524, file: !502, line: 81)
!524 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !515, file: !515, line: 96, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !526, file: !502, line: 82)
!526 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !515, file: !515, line: 108, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !528, file: !502, line: 83)
!528 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !515, file: !515, line: 114, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !530, file: !502, line: 84)
!530 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !515, file: !515, line: 120, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !532, file: !502, line: 85)
!532 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !515, file: !515, line: 126, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !534, file: !502, line: 86)
!534 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !515, file: !515, line: 132, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !536, file: !502, line: 87)
!536 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !515, file: !515, line: 138, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !538, file: !502, line: 88)
!538 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !515, file: !515, line: 144, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !540, file: !502, line: 89)
!540 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !515, file: !515, line: 150, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !542, file: !502, line: 90)
!542 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !515, file: !515, line: 102, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!7, !499, !509}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !546, file: !502, line: 91)
!546 = !DISubprogram(name: "wctype", scope: !515, file: !515, line: 190, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!509, !549}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !551, file: !502, line: 92)
!551 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !515, file: !515, line: 156, type: !552, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{!499, !499}
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !555, file: !502, line: 93)
!555 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !515, file: !515, line: 162, type: !552, flags: DIFlagPrototyped, spFlags: 0)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !557, file: !502, line: 94)
!557 = !DISubprogram(name: "towctrans", scope: !522, file: !522, line: 124, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DISubroutineType(types: !559)
!559 = !{!499, !499, !504}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !561, file: !502, line: 95)
!561 = !DISubprogram(name: "wctrans", scope: !522, file: !522, line: 126, type: !562, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DISubroutineType(types: !563)
!563 = !{!504, !549}
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !565, file: !576, line: 133)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !566, line: 32, baseType: !567)
!566 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8f920c8f4b68eb07504db5a6777c5466")
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !449, line: 72, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !449, line: 70, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !449, line: 67, size: 1024, flags: DIFlagTypePassByValue, elements: !570, identifier: "_ZTS11__mbstate_t")
!570 = !{!571, !575}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !569, file: !449, line: 68, baseType: !572, size: 1024)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1024, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !569, file: !449, line: 69, baseType: !25, size: 64)
!576 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwchar", directory: "")
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !578, file: !576, line: 134)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !579, line: 78, size: 448, flags: DIFlagTypePassByValue, elements: !580, identifier: "_ZTS2tm")
!579 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_time.h", directory: "", checksumkind: CSK_MD5, checksum: "e65eafd533c28a52a9094e430476b03e")
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !578, file: !579, line: 79, baseType: !7, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !578, file: !579, line: 80, baseType: !7, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !578, file: !579, line: 81, baseType: !7, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !578, file: !579, line: 82, baseType: !7, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !578, file: !579, line: 83, baseType: !7, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !578, file: !579, line: 84, baseType: !7, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !578, file: !579, line: 85, baseType: !7, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !578, file: !579, line: 86, baseType: !7, size: 32, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !578, file: !579, line: 87, baseType: !7, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !578, file: !579, line: 88, baseType: !450, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !578, file: !579, line: 89, baseType: !21, size: 64, offset: 384)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !499, file: !576, line: 135)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !594, file: !576, line: 136)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !595, line: 162, baseType: !596)
!595 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "d91ebd7d161d9196cc100822ef0e5cdf")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !595, line: 131, size: 1216, flags: DIFlagTypePassByValue, elements: !597, identifier: "_ZTS7__sFILE")
!597 = !{!598, !600, !601, !602, !603, !604, !609, !610, !612, !616, !620, !628, !632, !633, !636, !637, !639, !643, !644, !645}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !596, file: !595, line: 132, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !596, file: !595, line: 133, baseType: !7, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !596, file: !595, line: 134, baseType: !7, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !596, file: !595, line: 135, baseType: !20, size: 16, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !596, file: !595, line: 136, baseType: !20, size: 16, offset: 144)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !596, file: !595, line: 137, baseType: !605, size: 128, offset: 192)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !595, line: 97, size: 128, flags: DIFlagTypePassByValue, elements: !606, identifier: "_ZTS6__sbuf")
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !605, file: !595, line: 98, baseType: !599, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !605, file: !595, line: 99, baseType: !7, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !596, file: !595, line: 138, baseType: !7, size: 32, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !596, file: !595, line: 141, baseType: !611, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !596, file: !595, line: 142, baseType: !613, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!7, !611}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !596, file: !595, line: 143, baseType: !617, size: 64, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!7, !611, !21, !7}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !596, file: !595, line: 144, baseType: !621, size: 64, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!624, !611, !624, !7}
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !595, line: 86, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !626, line: 83, baseType: !627)
!626 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !449, line: 37, baseType: !25)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !596, file: !595, line: 145, baseType: !629, size: 64, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!7, !611, !549, !7}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !596, file: !595, line: 148, baseType: !605, size: 128, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !596, file: !595, line: 149, baseType: !634, size: 64, offset: 832)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !595, line: 103, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS8__sFILEX")
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !596, file: !595, line: 150, baseType: !7, size: 32, offset: 896)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !596, file: !595, line: 153, baseType: !638, size: 24, offset: 928)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24, elements: !189)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !596, file: !595, line: 154, baseType: !640, size: 8, offset: 952)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 1)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !596, file: !595, line: 157, baseType: !605, size: 128, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !596, file: !595, line: 160, baseType: !7, size: 32, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !596, file: !595, line: 161, baseType: !624, size: 64, offset: 1152)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !647, file: !576, line: 137)
!647 = !DISubprogram(name: "fwprintf", scope: !648, file: !648, line: 107, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c0db33314388059ce7a1663adf1bfda0")
!649 = !DISubroutineType(types: !650)
!650 = !{!7, !651, !652, null}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !656, file: !576, line: 138)
!656 = !DISubprogram(name: "fwscanf", scope: !648, file: !648, line: 108, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !658, file: !576, line: 139)
!658 = !DISubprogram(name: "swprintf", scope: !648, file: !648, line: 120, type: !659, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DISubroutineType(types: !660)
!660 = !{!7, !661, !662, !652, null}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !663, line: 50, baseType: !664)
!663 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !449, line: 87, baseType: !454)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !666, file: !576, line: 140)
!666 = !DISubprogram(name: "vfwprintf", scope: !648, file: !648, line: 124, type: !667, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DISubroutineType(types: !668)
!668 = !{!7, !651, !652, !669}
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !449, line: 95, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !29, baseType: !21)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !672, file: !576, line: 141)
!672 = !DISubprogram(name: "vswprintf", scope: !648, file: !648, line: 126, type: !673, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!7, !661, !662, !652, !669}
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !676, file: !576, line: 142)
!676 = !DISubprogram(name: "swscanf", scope: !648, file: !648, line: 122, type: !677, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DISubroutineType(types: !678)
!678 = !{!7, !652, !652, null}
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !680, file: !576, line: 143)
!680 = !DISubprogram(name: "vfwscanf", scope: !648, file: !648, line: 195, type: !667, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !682, file: !576, line: 144)
!682 = !DISubprogram(name: "vswscanf", scope: !648, file: !648, line: 197, type: !683, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DISubroutineType(types: !684)
!684 = !{!7, !652, !652, !669}
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !686, file: !576, line: 145)
!686 = !DISubprogram(name: "fgetwc", scope: !648, file: !648, line: 100, type: !687, flags: DIFlagPrototyped, spFlags: 0)
!687 = !DISubroutineType(types: !688)
!688 = !{!499, !651}
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !690, file: !576, line: 146)
!690 = !DISubprogram(name: "fgetws", scope: !648, file: !648, line: 102, type: !691, flags: DIFlagPrototyped, spFlags: 0)
!691 = !DISubroutineType(types: !692)
!692 = !{!661, !661, !7, !651}
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !694, file: !576, line: 147)
!694 = !DISubprogram(name: "fputwc", scope: !648, file: !648, line: 104, type: !695, flags: DIFlagPrototyped, spFlags: 0)
!695 = !DISubroutineType(types: !696)
!696 = !{!499, !654, !651}
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !698, file: !576, line: 148)
!698 = !DISubprogram(name: "fputws", scope: !648, file: !648, line: 105, type: !699, flags: DIFlagPrototyped, spFlags: 0)
!699 = !DISubroutineType(types: !700)
!700 = !{!7, !652, !651}
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !702, file: !576, line: 149)
!702 = !DISubprogram(name: "fwide", scope: !648, file: !648, line: 106, type: !703, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{!7, !651, !7}
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !706, file: !576, line: 150)
!706 = !DISubprogram(name: "getwc", scope: !648, file: !648, line: 109, type: !687, flags: DIFlagPrototyped, spFlags: 0)
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !708, file: !576, line: 151)
!708 = !DISubprogram(name: "putwc", scope: !648, file: !648, line: 118, type: !695, flags: DIFlagPrototyped, spFlags: 0)
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !710, file: !576, line: 152)
!710 = !DISubprogram(name: "ungetwc", scope: !648, file: !648, line: 123, type: !711, flags: DIFlagPrototyped, spFlags: 0)
!711 = !DISubroutineType(types: !712)
!712 = !{!499, !499, !651}
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !714, file: !576, line: 153)
!714 = !DISubprogram(name: "wcstod", scope: !648, file: !648, line: 160, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !652, !718}
!717 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !720, file: !576, line: 154)
!720 = !DISubprogram(name: "wcstof", scope: !648, file: !648, line: 200, type: !721, flags: DIFlagPrototyped, spFlags: 0)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !652, !718}
!723 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !725, file: !576, line: 155)
!725 = !DISubprogram(name: "wcstold", scope: !648, file: !648, line: 202, type: !726, flags: DIFlagPrototyped, spFlags: 0)
!726 = !DISubroutineType(types: !727)
!727 = !{!464, !652, !718}
!728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !729, file: !576, line: 156)
!729 = !DISubprogram(name: "wcstol", scope: !648, file: !648, line: 164, type: !730, flags: DIFlagPrototyped, spFlags: 0)
!730 = !DISubroutineType(types: !731)
!731 = !{!450, !652, !718, !7}
!732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !733, file: !576, line: 157)
!733 = !DISubprogram(name: "wcstoll", scope: !648, file: !648, line: 205, type: !734, flags: DIFlagPrototyped, spFlags: 0)
!734 = !DISubroutineType(types: !735)
!735 = !{!25, !652, !718, !7}
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !737, file: !576, line: 158)
!737 = !DISubprogram(name: "wcstoul", scope: !648, file: !648, line: 167, type: !738, flags: DIFlagPrototyped, spFlags: 0)
!738 = !DISubroutineType(types: !739)
!739 = !{!454, !652, !718, !7}
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !741, file: !576, line: 159)
!741 = !DISubprogram(name: "wcstoull", scope: !648, file: !648, line: 207, type: !742, flags: DIFlagPrototyped, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{!411, !652, !718, !7}
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !745, file: !576, line: 160)
!745 = !DISubprogram(name: "wcscpy", scope: !648, file: !648, line: 134, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!746 = !DISubroutineType(types: !747)
!747 = !{!661, !661, !652}
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !749, file: !576, line: 161)
!749 = !DISubprogram(name: "wcsncpy", scope: !648, file: !648, line: 148, type: !750, flags: DIFlagPrototyped, spFlags: 0)
!750 = !DISubroutineType(types: !751)
!751 = !{!661, !661, !652, !662}
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !753, file: !576, line: 162)
!753 = !DISubprogram(name: "wcscat", scope: !648, file: !648, line: 130, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !755, file: !576, line: 163)
!755 = !DISubprogram(name: "wcsncat", scope: !648, file: !648, line: 142, type: !750, flags: DIFlagPrototyped, spFlags: 0)
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !757, file: !576, line: 164)
!757 = !DISubprogram(name: "wcscmp", scope: !648, file: !648, line: 132, type: !758, flags: DIFlagPrototyped, spFlags: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!7, !652, !652}
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !761, file: !576, line: 165)
!761 = !DISubprogram(name: "wcscoll", scope: !648, file: !648, line: 133, type: !758, flags: DIFlagPrototyped, spFlags: 0)
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !763, file: !576, line: 166)
!763 = !DISubprogram(name: "wcsncmp", scope: !648, file: !648, line: 145, type: !764, flags: DIFlagPrototyped, spFlags: 0)
!764 = !DISubroutineType(types: !765)
!765 = !{!7, !652, !652, !662}
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !767, file: !576, line: 167)
!767 = !DISubprogram(name: "wcsxfrm", scope: !648, file: !648, line: 157, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!768 = !DISubroutineType(types: !769)
!769 = !{!662, !661, !652, !662}
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !771, file: !576, line: 168)
!771 = !DISubprogram(name: "wcschr", linkageName: "_Z6wcschrB8ne200100Ua9enable_ifILb1EEPww", scope: !772, file: !772, line: 147, type: !773, flags: DIFlagPrototyped, spFlags: 0)
!772 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/wchar.h", directory: "")
!773 = !DISubroutineType(types: !774)
!774 = !{!661, !661, !654}
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !776, file: !576, line: 169)
!776 = !DISubprogram(name: "wcspbrk", linkageName: "_Z7wcspbrkB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !772, file: !772, line: 158, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !778, file: !576, line: 170)
!778 = !DISubprogram(name: "wcsrchr", linkageName: "_Z7wcsrchrB8ne200100Ua9enable_ifILb1EEPww", scope: !772, file: !772, line: 168, type: !773, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !780, file: !576, line: 171)
!780 = !DISubprogram(name: "wcsstr", linkageName: "_Z6wcsstrB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !772, file: !772, line: 179, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !782, file: !576, line: 172)
!782 = !DISubprogram(name: "wmemchr", linkageName: "_Z7wmemchrB8ne200100Ua9enable_ifILb1EEPwwm", scope: !772, file: !772, line: 190, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!661, !661, !654, !662}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !786, file: !576, line: 173)
!786 = !DISubprogram(name: "wcscspn", scope: !648, file: !648, line: 136, type: !787, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DISubroutineType(types: !788)
!788 = !{!662, !652, !652}
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !790, file: !576, line: 174)
!790 = !DISubprogram(name: "wcslen", scope: !648, file: !648, line: 140, type: !791, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DISubroutineType(types: !792)
!792 = !{!662, !652}
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !794, file: !576, line: 175)
!794 = !DISubprogram(name: "wcsspn", scope: !648, file: !648, line: 155, type: !787, flags: DIFlagPrototyped, spFlags: 0)
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !796, file: !576, line: 176)
!796 = !DISubprogram(name: "wcstok", scope: !648, file: !648, line: 162, type: !797, flags: DIFlagPrototyped, spFlags: 0)
!797 = !DISubroutineType(types: !798)
!798 = !{!661, !661, !652, !718}
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !800, file: !576, line: 177)
!800 = !DISubprogram(name: "wmemcmp", scope: !648, file: !648, line: 170, type: !764, flags: DIFlagPrototyped, spFlags: 0)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !802, file: !576, line: 178)
!802 = !DISubprogram(name: "wmemcpy", scope: !648, file: !648, line: 173, type: !750, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !804, file: !576, line: 179)
!804 = !DISubprogram(name: "wmemmove", scope: !648, file: !648, line: 176, type: !750, flags: DIFlagPrototyped, spFlags: 0)
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !806, file: !576, line: 180)
!806 = !DISubprogram(name: "wmemset", scope: !648, file: !648, line: 179, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !808, file: !576, line: 181)
!808 = !DISubprogram(name: "wcsftime", linkageName: "\01_wcsftime", scope: !648, file: !648, line: 137, type: !809, flags: DIFlagPrototyped, spFlags: 0)
!809 = !DISubroutineType(types: !810)
!810 = !{!662, !661, !662, !652, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !814, file: !576, line: 182)
!814 = !DISubprogram(name: "btowc", scope: !648, file: !648, line: 99, type: !815, flags: DIFlagPrototyped, spFlags: 0)
!815 = !DISubroutineType(types: !816)
!816 = !{!499, !7}
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !818, file: !576, line: 183)
!818 = !DISubprogram(name: "wctob", scope: !648, file: !648, line: 159, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !820, file: !576, line: 184)
!820 = !DISubprogram(name: "mbsinit", scope: !648, file: !648, line: 115, type: !821, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{!7, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !826, file: !576, line: 185)
!826 = !DISubprogram(name: "mbrlen", scope: !648, file: !648, line: 111, type: !827, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{!662, !549, !662, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !831, file: !576, line: 186)
!831 = !DISubprogram(name: "mbrtowc", scope: !648, file: !648, line: 113, type: !832, flags: DIFlagPrototyped, spFlags: 0)
!832 = !DISubroutineType(types: !833)
!833 = !{!662, !661, !549, !662, !829}
!834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !835, file: !576, line: 187)
!835 = !DISubprogram(name: "wcrtomb", scope: !648, file: !648, line: 129, type: !836, flags: DIFlagPrototyped, spFlags: 0)
!836 = !DISubroutineType(types: !837)
!837 = !{!662, !21, !654, !829}
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !839, file: !576, line: 188)
!839 = !DISubprogram(name: "mbsrtowcs", scope: !648, file: !648, line: 116, type: !840, flags: DIFlagPrototyped, spFlags: 0)
!840 = !DISubroutineType(types: !841)
!841 = !{!662, !661, !842, !662, !829}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !844, file: !576, line: 189)
!844 = !DISubprogram(name: "wcsrtombs", scope: !648, file: !648, line: 153, type: !845, flags: DIFlagPrototyped, spFlags: 0)
!845 = !DISubroutineType(types: !846)
!846 = !{!662, !21, !847, !662, !829}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !849, file: !576, line: 191)
!849 = !DISubprogram(name: "getwchar", scope: !648, file: !648, line: 110, type: !850, flags: DIFlagPrototyped, spFlags: 0)
!850 = !DISubroutineType(types: !851)
!851 = !{!499}
!852 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !853, file: !576, line: 192)
!853 = !DISubprogram(name: "vwscanf", scope: !648, file: !648, line: 199, type: !854, flags: DIFlagPrototyped, spFlags: 0)
!854 = !DISubroutineType(types: !855)
!855 = !{!7, !652, !669}
!856 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !857, file: !576, line: 193)
!857 = !DISubprogram(name: "wscanf", scope: !648, file: !648, line: 181, type: !858, flags: DIFlagPrototyped, spFlags: 0)
!858 = !DISubroutineType(types: !859)
!859 = !{!7, !652, null}
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !861, file: !576, line: 195)
!861 = !DISubprogram(name: "putwchar", scope: !648, file: !648, line: 119, type: !862, flags: DIFlagPrototyped, spFlags: 0)
!862 = !DISubroutineType(types: !863)
!863 = !{!499, !654}
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !865, file: !576, line: 196)
!865 = !DISubprogram(name: "vwprintf", scope: !648, file: !648, line: 128, type: !854, flags: DIFlagPrototyped, spFlags: 0)
!866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !867, file: !576, line: 197)
!867 = !DISubprogram(name: "wprintf", scope: !648, file: !648, line: 180, type: !858, flags: DIFlagPrototyped, spFlags: 0)
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !869, file: !875, line: 106)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !870, line: 105, baseType: !871)
!870 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "17a3e5580239ce2f2af260c9c943ad9b")
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 102, size: 64, flags: DIFlagTypePassByValue, elements: !872, identifier: "_ZTS5div_t")
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !871, file: !870, line: 103, baseType: !7, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !871, file: !870, line: 104, baseType: !7, size: 32, offset: 32)
!875 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdlib", directory: "")
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !877, file: !875, line: 107)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !870, line: 110, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 107, size: 128, flags: DIFlagTypePassByValue, elements: !879, identifier: "_ZTS6ldiv_t")
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !878, file: !870, line: 108, baseType: !450, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !878, file: !870, line: 109, baseType: !450, size: 64, offset: 64)
!882 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !883, file: !875, line: 108)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !870, line: 116, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 113, size: 128, flags: DIFlagTypePassByValue, elements: !885, identifier: "_ZTS7lldiv_t")
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !884, file: !870, line: 114, baseType: !25, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !884, file: !870, line: 115, baseType: !25, size: 64, offset: 64)
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !889, file: !875, line: 109)
!889 = !DISubprogram(name: "atof", scope: !870, file: !870, line: 149, type: !890, flags: DIFlagPrototyped, spFlags: 0)
!890 = !DISubroutineType(types: !891)
!891 = !{!717, !549}
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !893, file: !875, line: 110)
!893 = !DISubprogram(name: "atoi", scope: !870, file: !870, line: 150, type: !894, flags: DIFlagPrototyped, spFlags: 0)
!894 = !DISubroutineType(types: !895)
!895 = !{!7, !549}
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !897, file: !875, line: 111)
!897 = !DISubprogram(name: "atol", scope: !870, file: !870, line: 151, type: !898, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DISubroutineType(types: !899)
!899 = !{!450, !549}
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !901, file: !875, line: 112)
!901 = !DISubprogram(name: "atoll", scope: !870, file: !870, line: 154, type: !902, flags: DIFlagPrototyped, spFlags: 0)
!902 = !DISubroutineType(types: !903)
!903 = !{!25, !549}
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !905, file: !875, line: 113)
!905 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !870, file: !870, line: 184, type: !906, flags: DIFlagPrototyped, spFlags: 0)
!906 = !DISubroutineType(types: !907)
!907 = !{!717, !549, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!909 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !910, file: !875, line: 114)
!910 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !870, file: !870, line: 185, type: !911, flags: DIFlagPrototyped, spFlags: 0)
!911 = !DISubroutineType(types: !912)
!912 = !{!723, !549, !908}
!913 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !914, file: !875, line: 115)
!914 = !DISubprogram(name: "strtold", scope: !870, file: !870, line: 188, type: !915, flags: DIFlagPrototyped, spFlags: 0)
!915 = !DISubroutineType(types: !916)
!916 = !{!464, !549, !908}
!917 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !918, file: !875, line: 116)
!918 = !DISubprogram(name: "strtol", scope: !870, file: !870, line: 186, type: !919, flags: DIFlagPrototyped, spFlags: 0)
!919 = !DISubroutineType(types: !920)
!920 = !{!450, !549, !908, !7}
!921 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !922, file: !875, line: 117)
!922 = !DISubprogram(name: "strtoll", scope: !870, file: !870, line: 191, type: !923, flags: DIFlagPrototyped, spFlags: 0)
!923 = !DISubroutineType(types: !924)
!924 = !{!25, !549, !908, !7}
!925 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !926, file: !875, line: 118)
!926 = !DISubprogram(name: "strtoul", scope: !870, file: !870, line: 194, type: !927, flags: DIFlagPrototyped, spFlags: 0)
!927 = !DISubroutineType(types: !928)
!928 = !{!454, !549, !908, !7}
!929 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !930, file: !875, line: 119)
!930 = !DISubprogram(name: "strtoull", scope: !870, file: !870, line: 197, type: !931, flags: DIFlagPrototyped, spFlags: 0)
!931 = !DISubroutineType(types: !932)
!932 = !{!411, !549, !908, !7}
!933 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !934, file: !875, line: 120)
!934 = !DISubprogram(name: "rand", scope: !870, file: !870, line: 181, type: !935, flags: DIFlagPrototyped, spFlags: 0)
!935 = !DISubroutineType(types: !936)
!936 = !{!7}
!937 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !938, file: !875, line: 121)
!938 = !DISubprogram(name: "srand", scope: !870, file: !870, line: 183, type: !939, flags: DIFlagPrototyped, spFlags: 0)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !69}
!941 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !942, file: !875, line: 122)
!942 = !DISubprogram(name: "calloc", scope: !943, file: !943, line: 55, type: !944, flags: DIFlagPrototyped, spFlags: 0)
!943 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/malloc/_malloc.h", directory: "", checksumkind: CSK_MD5, checksum: "169c9ed8662627a4a4d92e321cfa866c")
!944 = !DISubroutineType(types: !945)
!945 = !{!611, !662, !662}
!946 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !947, file: !875, line: 123)
!947 = !DISubprogram(name: "free", scope: !943, file: !943, line: 56, type: !948, flags: DIFlagPrototyped, spFlags: 0)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !611}
!950 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !951, file: !875, line: 124)
!951 = !DISubprogram(name: "malloc", scope: !943, file: !943, line: 54, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!952 = !DISubroutineType(types: !953)
!953 = !{!611, !662}
!954 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !955, file: !875, line: 125)
!955 = !DISubprogram(name: "realloc", scope: !943, file: !943, line: 57, type: !956, flags: DIFlagPrototyped, spFlags: 0)
!956 = !DISubroutineType(types: !957)
!957 = !{!611, !611, !662}
!958 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !959, file: !875, line: 126)
!959 = !DISubprogram(name: "abort", scope: !960, file: !960, line: 33, type: !961, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!960 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_abort.h", directory: "", checksumkind: CSK_MD5, checksum: "b8994a53d49770cf67adab87821b3fcb")
!961 = !DISubroutineType(types: !962)
!962 = !{null}
!963 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !964, file: !875, line: 127)
!964 = !DISubprogram(name: "atexit", scope: !870, file: !870, line: 144, type: !965, flags: DIFlagPrototyped, spFlags: 0)
!965 = !DISubroutineType(types: !966)
!966 = !{!7, !967}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!968 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !969, file: !875, line: 128)
!969 = !DISubprogram(name: "exit", scope: !870, file: !870, line: 160, type: !970, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !7}
!972 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !973, file: !875, line: 129)
!973 = !DISubprogram(name: "_Exit", scope: !870, file: !870, line: 210, type: !970, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!974 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !975, file: !875, line: 130)
!975 = !DISubprogram(name: "getenv", scope: !870, file: !870, line: 162, type: !976, flags: DIFlagPrototyped, spFlags: 0)
!976 = !DISubroutineType(types: !977)
!977 = !{!21, !549}
!978 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !979, file: !875, line: 131)
!979 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !870, file: !870, line: 203, type: !894, flags: DIFlagPrototyped, spFlags: 0)
!980 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !981, file: !875, line: 132)
!981 = !DISubprogram(name: "bsearch", scope: !870, file: !870, line: 156, type: !982, flags: DIFlagPrototyped, spFlags: 0)
!982 = !DISubroutineType(types: !983)
!983 = !{!611, !984, !984, !662, !662, !986}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!7, !984, !984}
!989 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !990, file: !875, line: 133)
!990 = !DISubprogram(name: "qsort", scope: !870, file: !870, line: 175, type: !991, flags: DIFlagPrototyped, spFlags: 0)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !611, !662, !662, !986}
!993 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !994, file: !875, line: 134)
!994 = !DISubprogram(name: "abs", linkageName: "_Z3absB8ne200100e", scope: !995, file: !995, line: 123, type: !996, flags: DIFlagPrototyped, spFlags: 0)
!995 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/stdlib.h", directory: "")
!996 = !DISubroutineType(types: !997)
!997 = !{!464, !464}
!998 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !999, file: !875, line: 135)
!999 = !DISubprogram(name: "labs", scope: !870, file: !870, line: 163, type: !1000, flags: DIFlagPrototyped, spFlags: 0)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!450, !450}
!1002 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !1003, file: !875, line: 136)
!1003 = !DISubprogram(name: "llabs", scope: !870, file: !870, line: 167, type: !1004, flags: DIFlagPrototyped, spFlags: 0)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!25, !25}
!1006 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !1007, file: !875, line: 137)
!1007 = !DISubprogram(name: "div", linkageName: "_Z3divB8ne200100xx", scope: !995, file: !995, line: 143, type: !1008, flags: DIFlagPrototyped, spFlags: 0)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!883, !25, !25}
!1010 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !1011, file: !875, line: 138)
!1011 = !DISubprogram(name: "ldiv", scope: !870, file: !870, line: 164, type: !1012, flags: DIFlagPrototyped, spFlags: 0)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!877, !450, !450}
!1014 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !1015, file: !875, line: 139)
!1015 = !DISubprogram(name: "lldiv", scope: !870, file: !870, line: 168, type: !1008, flags: DIFlagPrototyped, spFlags: 0)
!1016 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !1017, file: !875, line: 140)
!1017 = !DISubprogram(name: "mblen", scope: !870, file: !870, line: 171, type: !1018, flags: DIFlagPrototyped, spFlags: 0)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!7, !549, !662}
!1020 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !1021, file: !875, line: 142)
!1021 = !DISubprogram(name: "mbtowc", scope: !870, file: !870, line: 173, type: !1022, flags: DIFlagPrototyped, spFlags: 0)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!7, !661, !549, !662}
!1024 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !1025, file: !875, line: 143)
!1025 = !DISubprogram(name: "wctomb", scope: !870, file: !870, line: 207, type: !1026, flags: DIFlagPrototyped, spFlags: 0)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!7, !21, !654}
!1028 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !397, entity: !1029, file: !875, line: 144)
!1029 = !DISubprogram(name: "mbstowcs", scope: !870, file: !870, line: 172, type: !1030, flags: DIFlagPrototyped, spFlags: 0)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!662, !661, !549, !662}
