; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/aipath.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/aipath.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.segment = type { [6 x %struct.side], [6 x i16], [8 x i16], i32 }
%struct.side = type { i8, i8, i16, i16, i16, [4 x %struct.uvl], [2 x %struct.vms_vector] }
%struct.uvl = type { i32, i32, i32 }
%struct.vms_vector = type { i32, i32, i32 }
%struct.object = type { i32, i8, i8, i16, i16, i8, i8, i8, i8, i16, i16, %struct.vms_vector, %struct.vms_matrix, i32, i32, %struct.vms_vector, i8, i8, i8, i8, i32, %union.anon, %union.anon.0, %union.anon.1 }
%struct.vms_matrix = type { %struct.vms_vector, %struct.vms_vector, %struct.vms_vector }
%union.anon = type { %struct.physics_info }
%struct.physics_info = type { %struct.vms_vector, %struct.vms_vector, i32, i32, i32, %struct.vms_vector, %struct.vms_vector, i16, i16 }
%union.anon.0 = type { %struct.ai_static }
%struct.ai_static = type { i8, [11 x i8], i16, i16, i16, i8, i8, i16, i32, i32 }
%union.anon.1 = type { %struct.polyobj_info }
%struct.polyobj_info = type { i32, [10 x %struct.vms_angvec], i32, i32, i32 }
%struct.vms_angvec = type { i16, i16, i16 }
%struct.point_seg = type { i32, %struct.vms_vector }

!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !222, line: 34, baseType: !223)
!222 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!223 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!224 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !153, entity: !225, file: !158, line: 191)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !226, line: 32, baseType: !219)
!226 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!227 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !153, entity: !228, file: !158, line: 192)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !229, line: 32, baseType: !223)
!229 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!230 = !{i32 2, !"SDK Version", [2 x i32] [i32 15, i32 4]}
!231 = !{i32 7, !"Dwarf Version", i32 5}
!232 = !{i32 2, !"Debug Info Version", i32 3}
!233 = !{i32 1, !"wchar_size", i32 4}
!234 = !{i32 8, !"PIC Level", i32 2}
!235 = !{i32 7, !"uwtable", i32 1}
!236 = !{i32 7, !"frame-pointer", i32 1}
!237 = !{!"Homebrew clang version 20.1.8"}
!238 = distinct !DISubprogram(name: "create_random_xlate", linkageName: "_Z19create_random_xlatePa", scope: !2, file: !2, line: 56, type: !239, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !242)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!242 = !{}
!243 = !DILocalVariable(name: "xt", arg: 1, scope: !238, file: !2, line: 56, type: !241)
!244 = !DILocation(line: 56, column: 34, scope: !238)
!245 = !DILocalVariable(name: "i", scope: !238, file: !2, line: 58, type: !63)
!246 = !DILocation(line: 58, column: 6, scope: !238)
!247 = !DILocation(line: 60, column: 8, scope: !248)
!248 = distinct !DILexicalBlock(scope: !238, file: !2, line: 60, column: 2)
!249 = !DILocation(line: 60, column: 7, scope: !248)
!250 = !DILocation(line: 60, column: 12, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !2, line: 60, column: 2)
!252 = !DILocation(line: 60, column: 13, scope: !251)
!253 = !DILocation(line: 60, column: 2, scope: !248)
!254 = !DILocation(line: 61, column: 11, scope: !251)
!255 = !DILocation(line: 61, column: 3, scope: !251)
!256 = !DILocation(line: 61, column: 6, scope: !251)
!257 = !DILocation(line: 61, column: 9, scope: !251)
!258 = !DILocation(line: 60, column: 38, scope: !251)
!259 = !DILocation(line: 60, column: 2, scope: !251)
!260 = distinct !{!260, !253, !261, !262}
!261 = !DILocation(line: 61, column: 11, scope: !248)
!262 = !{!"llvm.loop.mustprogress"}
!263 = !DILocation(line: 63, column: 8, scope: !264)
!264 = distinct !DILexicalBlock(scope: !238, file: !2, line: 63, column: 2)
!265 = !DILocation(line: 63, column: 7, scope: !264)
!266 = !DILocation(line: 63, column: 12, scope: !267)
!267 = distinct !DILexicalBlock(scope: !264, file: !2, line: 63, column: 2)
!268 = !DILocation(line: 63, column: 13, scope: !267)
!269 = !DILocation(line: 63, column: 2, scope: !264)
!270 = !DILocalVariable(name: "j", scope: !271, file: !2, line: 64, type: !63)
!271 = distinct !DILexicalBlock(scope: !267, file: !2, line: 63, column: 42)
!272 = !DILocation(line: 64, column: 7, scope: !271)
!273 = !DILocation(line: 64, column: 12, scope: !271)
!274 = !DILocation(line: 64, column: 20, scope: !271)
!275 = !DILocation(line: 64, column: 43, scope: !271)
!276 = !DILocalVariable(name: "temp_byte", scope: !271, file: !2, line: 65, type: !155)
!277 = !DILocation(line: 65, column: 10, scope: !271)
!278 = !DILocation(line: 66, column: 3, scope: !271)
!279 = !DILocation(line: 0, scope: !271)
!280 = !DILocation(line: 68, column: 15, scope: !271)
!281 = !DILocation(line: 68, column: 18, scope: !271)
!282 = !DILocation(line: 68, column: 13, scope: !271)
!283 = !DILocation(line: 69, column: 11, scope: !271)
!284 = !DILocation(line: 69, column: 14, scope: !271)
!285 = !DILocation(line: 69, column: 3, scope: !271)
!286 = !DILocation(line: 69, column: 6, scope: !271)
!287 = !DILocation(line: 69, column: 9, scope: !271)
!288 = !DILocation(line: 70, column: 11, scope: !271)
!289 = !DILocation(line: 70, column: 3, scope: !271)
!290 = !DILocation(line: 70, column: 6, scope: !271)
!291 = !DILocation(line: 70, column: 9, scope: !271)
!292 = !DILocation(line: 71, column: 2, scope: !271)
!293 = !DILocation(line: 63, column: 38, scope: !267)
!294 = !DILocation(line: 63, column: 2, scope: !267)
!295 = distinct !{!295, !269, !296, !262}
!296 = !DILocation(line: 71, column: 2, scope: !264)
!297 = !DILocation(line: 73, column: 1, scope: !238)
!298 = distinct !DISubprogram(name: "insert_center_points", linkageName: "_Z20insert_center_pointsP9point_segPi", scope: !2, file: !2, line: 79, type: !299, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !242)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !301, !315}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "point_seg", file: !303, line: 178, baseType: !304)
!303 = !DIFile(filename: "main_d2/aistruct.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d122430e792a0ddc0f9eaa08ad217628")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 175, size: 128, flags: DIFlagTypePassByValue, elements: !305, identifier: "_ZTS9point_seg")
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !304, file: !303, line: 176, baseType: !63, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !304, file: !303, line: 177, baseType: !308, size: 96, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_vector", file: !309, line: 22, baseType: !310)
!309 = !DIFile(filename: "./vecmat/vecmat.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "dfa84e3325c1ea4f5f74699fff5ef2bf")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_vector", file: !309, line: 19, size: 96, flags: DIFlagTypePassByValue, elements: !311, identifier: "_ZTS10vms_vector")
!311 = !{!312, !313, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !310, file: !309, line: 21, baseType: !69, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !310, file: !309, line: 21, baseType: !69, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !310, file: !309, line: 21, baseType: !69, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!316 = !DILocalVariable(name: "psegs", arg: 1, scope: !298, file: !2, line: 79, type: !301)
!317 = !DILocation(line: 79, column: 38, scope: !298)
!318 = !DILocalVariable(name: "num_points", arg: 2, scope: !298, file: !2, line: 79, type: !315)
!319 = !DILocation(line: 79, column: 50, scope: !298)
!320 = !DILocalVariable(name: "i", scope: !298, file: !2, line: 81, type: !63)
!321 = !DILocation(line: 81, column: 6, scope: !298)
!322 = !DILocalVariable(name: "j", scope: !298, file: !2, line: 81, type: !63)
!323 = !DILocation(line: 81, column: 9, scope: !298)
!324 = !DILocalVariable(name: "last_point", scope: !298, file: !2, line: 81, type: !63)
!325 = !DILocation(line: 81, column: 12, scope: !298)
!326 = !DILocalVariable(name: "count", scope: !298, file: !2, line: 82, type: !63)
!327 = !DILocation(line: 82, column: 6, scope: !298)
!328 = !DILocation(line: 82, column: 13, scope: !298)
!329 = !DILocation(line: 82, column: 12, scope: !298)
!330 = !DILocation(line: 84, column: 16, scope: !298)
!331 = !DILocation(line: 84, column: 15, scope: !298)
!332 = !DILocation(line: 84, column: 26, scope: !298)
!333 = !DILocation(line: 84, column: 13, scope: !298)
!334 = !DILocation(line: 86, column: 9, scope: !335)
!335 = distinct !DILexicalBlock(scope: !298, file: !2, line: 86, column: 2)
!336 = !DILocation(line: 86, column: 8, scope: !335)
!337 = !DILocation(line: 86, column: 7, scope: !335)
!338 = !DILocation(line: 86, column: 21, scope: !339)
!339 = distinct !DILexicalBlock(scope: !335, file: !2, line: 86, column: 2)
!340 = !DILocation(line: 86, column: 22, scope: !339)
!341 = !DILocation(line: 86, column: 2, scope: !335)
!342 = !DILocalVariable(name: "connect_side", scope: !343, file: !2, line: 87, type: !63)
!343 = distinct !DILexicalBlock(scope: !339, file: !2, line: 86, column: 31)
!344 = !DILocation(line: 87, column: 9, scope: !343)
!345 = !DILocalVariable(name: "temp_segnum", scope: !343, file: !2, line: 87, type: !63)
!346 = !DILocation(line: 87, column: 23, scope: !343)
!347 = !DILocalVariable(name: "center_point", scope: !343, file: !2, line: 88, type: !308)
!348 = !DILocation(line: 88, column: 14, scope: !343)
!349 = !DILocalVariable(name: "new_point", scope: !343, file: !2, line: 88, type: !308)
!350 = !DILocation(line: 88, column: 28, scope: !343)
!351 = !DILocation(line: 90, column: 16, scope: !343)
!352 = !DILocation(line: 90, column: 22, scope: !343)
!353 = !DILocation(line: 90, column: 3, scope: !343)
!354 = !DILocation(line: 90, column: 11, scope: !343)
!355 = !DILocation(line: 90, column: 10, scope: !343)
!356 = !DILocation(line: 90, column: 14, scope: !343)
!357 = !DILocation(line: 91, column: 46, scope: !343)
!358 = !DILocation(line: 91, column: 52, scope: !343)
!359 = !DILocation(line: 91, column: 55, scope: !343)
!360 = !DILocation(line: 91, column: 37, scope: !343)
!361 = !DILocation(line: 91, column: 74, scope: !343)
!362 = !DILocation(line: 91, column: 80, scope: !343)
!363 = !DILocation(line: 91, column: 81, scope: !343)
!364 = !DILocation(line: 91, column: 85, scope: !343)
!365 = !DILocation(line: 91, column: 65, scope: !343)
!366 = !DILocation(line: 91, column: 18, scope: !343)
!367 = !DILocation(line: 91, column: 16, scope: !343)
!368 = !DILocation(line: 92, column: 3, scope: !343)
!369 = !DILocation(line: 93, column: 7, scope: !370)
!370 = distinct !DILexicalBlock(scope: !343, file: !2, line: 93, column: 7)
!371 = !DILocation(line: 93, column: 20, scope: !370)
!372 = !DILocation(line: 94, column: 17, scope: !370)
!373 = !DILocation(line: 94, column: 4, scope: !370)
!374 = !DILocation(line: 95, column: 57, scope: !343)
!375 = !DILocation(line: 95, column: 63, scope: !343)
!376 = !DILocation(line: 95, column: 64, scope: !343)
!377 = !DILocation(line: 95, column: 68, scope: !343)
!378 = !DILocation(line: 95, column: 48, scope: !343)
!379 = !DILocation(line: 95, column: 77, scope: !343)
!380 = !DILocation(line: 95, column: 3, scope: !343)
!381 = !DILocation(line: 96, column: 27, scope: !343)
!382 = !DILocation(line: 96, column: 33, scope: !343)
!383 = !DILocation(line: 96, column: 34, scope: !343)
!384 = !DILocation(line: 96, column: 38, scope: !343)
!385 = !DILocation(line: 96, column: 3, scope: !343)
!386 = !DILocation(line: 97, column: 13, scope: !343)
!387 = !DILocation(line: 97, column: 15, scope: !343)
!388 = !DILocation(line: 98, column: 13, scope: !343)
!389 = !DILocation(line: 98, column: 15, scope: !343)
!390 = !DILocation(line: 99, column: 13, scope: !343)
!391 = !DILocation(line: 99, column: 15, scope: !343)
!392 = !DILocation(line: 100, column: 15, scope: !343)
!393 = !DILocation(line: 100, column: 23, scope: !343)
!394 = !DILocation(line: 100, column: 22, scope: !343)
!395 = !DILocation(line: 100, column: 24, scope: !343)
!396 = !DILocation(line: 100, column: 28, scope: !343)
!397 = !DILocation(line: 100, column: 3, scope: !343)
!398 = !DILocation(line: 101, column: 33, scope: !343)
!399 = !DILocation(line: 101, column: 41, scope: !343)
!400 = !DILocation(line: 101, column: 40, scope: !343)
!401 = !DILocation(line: 101, column: 42, scope: !343)
!402 = !DILocation(line: 101, column: 46, scope: !343)
!403 = !DILocation(line: 101, column: 53, scope: !343)
!404 = !DILocation(line: 101, column: 61, scope: !343)
!405 = !DILocation(line: 101, column: 60, scope: !343)
!406 = !DILocation(line: 101, column: 64, scope: !343)
!407 = !DILocation(line: 101, column: 17, scope: !343)
!408 = !DILocation(line: 101, column: 15, scope: !343)
!409 = !DILocation(line: 102, column: 7, scope: !410)
!410 = distinct !DILexicalBlock(scope: !343, file: !2, line: 102, column: 7)
!411 = !DILocation(line: 102, column: 19, scope: !410)
!412 = !DILocation(line: 103, column: 4, scope: !413)
!413 = distinct !DILexicalBlock(scope: !410, file: !2, line: 102, column: 26)
!414 = !DILocation(line: 104, column: 4, scope: !413)
!415 = !DILocation(line: 104, column: 12, scope: !413)
!416 = !DILocation(line: 104, column: 11, scope: !413)
!417 = !DILocation(line: 104, column: 13, scope: !413)
!418 = !DILocation(line: 104, column: 17, scope: !413)
!419 = !DILocation(line: 104, column: 23, scope: !413)
!420 = !DILocation(line: 105, column: 20, scope: !413)
!421 = !DILocation(line: 105, column: 28, scope: !413)
!422 = !DILocation(line: 105, column: 27, scope: !413)
!423 = !DILocation(line: 105, column: 29, scope: !413)
!424 = !DILocation(line: 105, column: 33, scope: !413)
!425 = !DILocation(line: 105, column: 40, scope: !413)
!426 = !DILocation(line: 105, column: 48, scope: !413)
!427 = !DILocation(line: 105, column: 47, scope: !413)
!428 = !DILocation(line: 105, column: 51, scope: !413)
!429 = !DILocation(line: 105, column: 4, scope: !413)
!430 = !DILocation(line: 106, column: 3, scope: !413)
!431 = !DILocation(line: 108, column: 25, scope: !343)
!432 = !DILocation(line: 108, column: 33, scope: !343)
!433 = !DILocation(line: 108, column: 32, scope: !343)
!434 = !DILocation(line: 108, column: 36, scope: !343)
!435 = !DILocation(line: 108, column: 3, scope: !343)
!436 = !DILocation(line: 108, column: 11, scope: !343)
!437 = !DILocation(line: 108, column: 10, scope: !343)
!438 = !DILocation(line: 108, column: 12, scope: !343)
!439 = !DILocation(line: 108, column: 16, scope: !343)
!440 = !DILocation(line: 108, column: 23, scope: !343)
!441 = !DILocation(line: 109, column: 8, scope: !343)
!442 = !DILocation(line: 110, column: 2, scope: !343)
!443 = !DILocation(line: 86, column: 27, scope: !339)
!444 = !DILocation(line: 86, column: 2, scope: !339)
!445 = distinct !{!445, !341, !446, !262}
!446 = !DILocation(line: 110, column: 2, scope: !335)
!447 = !DILocation(line: 115, column: 8, scope: !448)
!448 = distinct !DILexicalBlock(scope: !298, file: !2, line: 115, column: 2)
!449 = !DILocation(line: 115, column: 7, scope: !448)
!450 = !DILocation(line: 115, column: 12, scope: !451)
!451 = distinct !DILexicalBlock(scope: !448, file: !2, line: 115, column: 2)
!452 = !DILocation(line: 115, column: 14, scope: !451)
!453 = !DILocation(line: 115, column: 19, scope: !451)
!454 = !DILocation(line: 115, column: 13, scope: !451)
!455 = !DILocation(line: 115, column: 2, scope: !448)
!456 = !DILocalVariable(name: "temp1", scope: !457, file: !2, line: 116, type: !308)
!457 = distinct !DILexicalBlock(scope: !451, file: !2, line: 115, column: 29)
!458 = !DILocation(line: 116, column: 14, scope: !457)
!459 = !DILocalVariable(name: "temp2", scope: !457, file: !2, line: 116, type: !308)
!460 = !DILocation(line: 116, column: 21, scope: !457)
!461 = !DILocalVariable(name: "dot", scope: !457, file: !2, line: 117, type: !69)
!462 = !DILocation(line: 117, column: 9, scope: !457)
!463 = !DILocation(line: 119, column: 9, scope: !457)
!464 = !DILocation(line: 119, column: 7, scope: !457)
!465 = !DILocation(line: 121, column: 7, scope: !466)
!466 = distinct !DILexicalBlock(scope: !457, file: !2, line: 121, column: 7)
!467 = !DILocation(line: 121, column: 11, scope: !466)
!468 = !DILocation(line: 121, column: 14, scope: !466)
!469 = !DILocation(line: 121, column: 26, scope: !466)
!470 = !DILocation(line: 121, column: 46, scope: !466)
!471 = !DILocation(line: 121, column: 19, scope: !466)
!472 = !DILocation(line: 121, column: 17, scope: !466)
!473 = !DILocation(line: 122, column: 4, scope: !466)
!474 = !DILocation(line: 122, column: 10, scope: !466)
!475 = !DILocation(line: 122, column: 13, scope: !466)
!476 = !DILocation(line: 122, column: 20, scope: !466)
!477 = !DILocation(line: 124, column: 2, scope: !457)
!478 = !DILocation(line: 115, column: 24, scope: !451)
!479 = !DILocation(line: 115, column: 2, scope: !451)
!480 = distinct !{!480, !455, !481, !262}
!481 = !DILocation(line: 124, column: 2, scope: !448)
!482 = !DILocation(line: 127, column: 4, scope: !298)
!483 = !DILocation(line: 128, column: 8, scope: !484)
!484 = distinct !DILexicalBlock(scope: !298, file: !2, line: 128, column: 2)
!485 = !DILocation(line: 128, column: 7, scope: !484)
!486 = !DILocation(line: 128, column: 12, scope: !487)
!487 = distinct !DILexicalBlock(scope: !484, file: !2, line: 128, column: 2)
!488 = !DILocation(line: 128, column: 14, scope: !487)
!489 = !DILocation(line: 128, column: 13, scope: !487)
!490 = !DILocation(line: 128, column: 2, scope: !484)
!491 = !DILocation(line: 129, column: 7, scope: !492)
!492 = distinct !DILexicalBlock(scope: !487, file: !2, line: 129, column: 7)
!493 = !DILocation(line: 129, column: 13, scope: !492)
!494 = !DILocation(line: 129, column: 16, scope: !492)
!495 = !DILocation(line: 129, column: 23, scope: !492)
!496 = !DILocation(line: 130, column: 17, scope: !492)
!497 = !DILocation(line: 130, column: 23, scope: !492)
!498 = !DILocation(line: 130, column: 4, scope: !492)
!499 = !DILocation(line: 130, column: 11, scope: !492)
!500 = !DILocation(line: 130, column: 15, scope: !492)
!501 = !DILocation(line: 129, column: 27, scope: !492)
!502 = !DILocation(line: 128, column: 22, scope: !487)
!503 = !DILocation(line: 128, column: 2, scope: !487)
!504 = distinct !{!504, !490, !505, !262}
!505 = !DILocation(line: 130, column: 24, scope: !484)
!506 = !DILocation(line: 132, column: 16, scope: !298)
!507 = !DILocation(line: 132, column: 3, scope: !298)
!508 = !DILocation(line: 132, column: 14, scope: !298)
!509 = !DILocation(line: 133, column: 1, scope: !298)
!510 = distinct !DISubprogram(name: "fixmul", linkageName: "_Z6fixmulii", scope: !70, file: !70, line: 83, type: !511, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !242)
!511 = !DISubroutineType(types: !512)
!512 = !{!69, !69, !69}
!513 = !DILocalVariable(name: "a", arg: 1, scope: !510, file: !70, line: 83, type: !69)
!514 = !DILocation(line: 83, column: 26, scope: !510)
!515 = !DILocalVariable(name: "b", arg: 2, scope: !510, file: !70, line: 83, type: !69)
!516 = !DILocation(line: 83, column: 33, scope: !510)
!517 = !DILocation(line: 85, column: 19, scope: !510)
!518 = !DILocation(line: 85, column: 32, scope: !510)
!519 = !DILocation(line: 85, column: 21, scope: !510)
!520 = !DILocation(line: 85, column: 35, scope: !510)
!521 = !DILocation(line: 85, column: 9, scope: !510)
!522 = !DILocation(line: 85, column: 2, scope: !510)
!523 = distinct !DISubprogram(name: "move_towards_outside", linkageName: "_Z20move_towards_outsideP9point_segPiP6objecti", scope: !2, file: !2, line: 143, type: !524, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !242)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !301, !315, !526, !63}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !528, line: 259, baseType: !529)
!528 = !DIFile(filename: "main_d2/object.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "1f2325d356aae4b692933d2aae4f3afd")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !528, line: 210, size: 2144, flags: DIFlagTypePassByValue, elements: !530, identifier: "_ZTS6object")
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !550, !551, !552, !553, !554, !555, !556, !557, !558, !576, !629}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !529, file: !528, line: 212, baseType: !63, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !529, file: !528, line: 213, baseType: !166, size: 8, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !529, file: !528, line: 214, baseType: !166, size: 8, offset: 40)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !529, file: !528, line: 215, baseType: !162, size: 16, offset: 48)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !529, file: !528, line: 215, baseType: !162, size: 16, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !529, file: !528, line: 216, baseType: !166, size: 8, offset: 80)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "movement_type", scope: !529, file: !528, line: 217, baseType: !166, size: 8, offset: 88)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "render_type", scope: !529, file: !528, line: 218, baseType: !166, size: 8, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !529, file: !528, line: 219, baseType: !166, size: 8, offset: 104)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !529, file: !528, line: 220, baseType: !162, size: 16, offset: 112)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "attached_obj", scope: !529, file: !528, line: 221, baseType: !162, size: 16, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !529, file: !528, line: 222, baseType: !308, size: 96, offset: 160)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "orient", scope: !529, file: !528, line: 223, baseType: !544, size: 288, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_matrix", file: !309, line: 47, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_matrix", file: !309, line: 44, size: 288, flags: DIFlagTypePassByValue, elements: !546, identifier: "_ZTS10vms_matrix")
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rvec", scope: !545, file: !309, line: 46, baseType: !308, size: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "uvec", scope: !545, file: !309, line: 46, baseType: !308, size: 96, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fvec", scope: !545, file: !309, line: 46, baseType: !308, size: 96, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !529, file: !528, line: 224, baseType: !69, size: 32, offset: 544)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "shields", scope: !529, file: !528, line: 225, baseType: !69, size: 32, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !529, file: !528, line: 226, baseType: !308, size: 96, offset: 608)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "contains_type", scope: !529, file: !528, line: 227, baseType: !155, size: 8, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "contains_id", scope: !529, file: !528, line: 228, baseType: !155, size: 8, offset: 712)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "contains_count", scope: !529, file: !528, line: 229, baseType: !155, size: 8, offset: 720)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "matcen_creator", scope: !529, file: !528, line: 230, baseType: !155, size: 8, offset: 728)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lifeleft", scope: !529, file: !528, line: 231, baseType: !69, size: 32, offset: 736)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mtype", scope: !529, file: !528, line: 240, baseType: !559, size: 512, offset: 768)
!559 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !528, line: 236, size: 512, flags: DIFlagTypePassByValue, elements: !560, identifier: "_ZTSN6objectUt_E")
!560 = !{!561, !575}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "phys_info", scope: !559, file: !528, line: 238, baseType: !562, size: 512)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "physics_info", file: !528, line: 153, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "physics_info", file: !528, line: 142, size: 512, flags: DIFlagTypePassByValue, elements: !564, identifier: "_ZTS12physics_info")
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !574}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !563, file: !528, line: 144, baseType: !308, size: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "thrust", scope: !563, file: !528, line: 145, baseType: !308, size: 96, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !563, file: !528, line: 146, baseType: !69, size: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "drag", scope: !563, file: !528, line: 147, baseType: !69, size: 32, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "brakes", scope: !563, file: !528, line: 148, baseType: !69, size: 32, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rotvel", scope: !563, file: !528, line: 149, baseType: !308, size: 96, offset: 288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rotthrust", scope: !563, file: !528, line: 150, baseType: !308, size: 96, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "turnroll", scope: !563, file: !528, line: 151, baseType: !573, size: 16, offset: 480)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixang", file: !70, line: 21, baseType: !162)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !563, file: !528, line: 152, baseType: !170, size: 16, offset: 496)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "spin_rate", scope: !559, file: !528, line: 239, baseType: !308, size: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !529, file: !528, line: 250, baseType: !577, size: 256, offset: 1280)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !528, line: 243, size: 256, flags: DIFlagTypePassByValue, elements: !578, identifier: "_ZTSN6objectUt0_E")
!578 = !{!579, !590, !600, !617, !622}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "laser_info", scope: !577, file: !528, line: 245, baseType: !580, size: 160)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "laser_info_t", file: !528, line: 166, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "laser_info_s", file: !528, line: 157, size: 160, flags: DIFlagTypePassByValue, elements: !582, identifier: "_ZTS12laser_info_s")
!582 = !{!583, !584, !585, !586, !587, !588, !589}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "parent_type", scope: !581, file: !528, line: 159, baseType: !162, size: 16)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "parent_num", scope: !581, file: !528, line: 160, baseType: !162, size: 16, offset: 16)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "parent_signature", scope: !581, file: !528, line: 161, baseType: !63, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !581, file: !528, line: 162, baseType: !69, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "last_hitobj", scope: !581, file: !528, line: 163, baseType: !162, size: 16, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "track_goal", scope: !581, file: !528, line: 164, baseType: !162, size: 16, offset: 112)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !581, file: !528, line: 165, baseType: !69, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "expl_info", scope: !577, file: !528, line: 246, baseType: !591, size: 128)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "explosion_info", file: !528, line: 176, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "explosion_info", file: !528, line: 168, size: 128, flags: DIFlagTypePassByValue, elements: !593, identifier: "_ZTS14explosion_info")
!593 = !{!594, !595, !596, !597, !598, !599}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "spawn_time", scope: !592, file: !528, line: 170, baseType: !69, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "delete_time", scope: !592, file: !528, line: 171, baseType: !69, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "delete_objnum", scope: !592, file: !528, line: 172, baseType: !162, size: 16, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "attach_parent", scope: !592, file: !528, line: 173, baseType: !162, size: 16, offset: 80)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "prev_attach", scope: !592, file: !528, line: 174, baseType: !162, size: 16, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next_attach", scope: !592, file: !528, line: 175, baseType: !162, size: 16, offset: 112)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ai_info", scope: !577, file: !528, line: 247, baseType: !601, size: 256)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ai_static", file: !303, line: 144, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ai_static", file: !303, line: 127, size: 256, flags: DIFlagTypePassByValue, elements: !603, identifier: "_ZTS9ai_static")
!603 = !{!604, !605, !609, !610, !611, !612, !613, !614, !615, !616}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "behavior", scope: !602, file: !303, line: 128, baseType: !166, size: 8)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !602, file: !303, line: 129, baseType: !606, size: 88, offset: 8)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 88, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 11)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "hide_segment", scope: !602, file: !303, line: 130, baseType: !162, size: 16, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "hide_index", scope: !602, file: !303, line: 131, baseType: !162, size: 16, offset: 112)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !602, file: !303, line: 132, baseType: !162, size: 16, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cur_path_index", scope: !602, file: !303, line: 133, baseType: !155, size: 8, offset: 144)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dying_sound_playing", scope: !602, file: !303, line: 134, baseType: !155, size: 8, offset: 152)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_num", scope: !602, file: !303, line: 139, baseType: !162, size: 16, offset: 160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_signature", scope: !602, file: !303, line: 140, baseType: !63, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dying_start_time", scope: !602, file: !303, line: 141, baseType: !69, size: 32, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "light_info", scope: !577, file: !528, line: 248, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "light_info_t", file: !528, line: 181, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "light_info_s", file: !528, line: 178, size: 32, flags: DIFlagTypePassByValue, elements: !620, identifier: "_ZTS12light_info_s")
!620 = !{!621}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !619, file: !528, line: 180, baseType: !69, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "powerup_info", scope: !577, file: !528, line: 249, baseType: !623, size: 96)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "powerup_info_t", file: !528, line: 190, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "powerup_info_s", file: !528, line: 185, size: 96, flags: DIFlagTypePassByValue, elements: !625, identifier: "_ZTS14powerup_info_s")
!625 = !{!626, !627, !628}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !624, file: !528, line: 187, baseType: !63, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !624, file: !528, line: 188, baseType: !69, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !624, file: !528, line: 189, baseType: !63, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !529, file: !528, line: 257, baseType: !630, size: 608, offset: 1536)
!630 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !528, line: 253, size: 608, flags: DIFlagTypePassByValue, elements: !631, identifier: "_ZTSN6objectUt1_E")
!631 = !{!632, !650}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pobj_info", scope: !630, file: !528, line: 255, baseType: !633, size: 608)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "polyobj_info", file: !528, line: 208, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "polyobj_info", file: !528, line: 201, size: 608, flags: DIFlagTypePassByValue, elements: !635, identifier: "_ZTS12polyobj_info")
!635 = !{!636, !637, !647, !648, !649}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "model_num", scope: !634, file: !528, line: 203, baseType: !63, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "anim_angles", scope: !634, file: !528, line: 204, baseType: !638, size: 480, offset: 32)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 480, elements: !645)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_angvec", file: !309, line: 40, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_angvec", file: !309, line: 37, size: 48, flags: DIFlagTypePassByValue, elements: !641, identifier: "_ZTS10vms_angvec")
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !640, file: !309, line: 39, baseType: !573, size: 16)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !640, file: !309, line: 39, baseType: !573, size: 16, offset: 16)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !640, file: !309, line: 39, baseType: !573, size: 16, offset: 32)
!645 = !{!646}
!646 = !DISubrange(count: 10)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "subobj_flags", scope: !634, file: !528, line: 205, baseType: !63, size: 32, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_override", scope: !634, file: !528, line: 206, baseType: !63, size: 32, offset: 544)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "alt_textures", scope: !634, file: !528, line: 207, baseType: !63, size: 32, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_info", scope: !630, file: !528, line: 256, baseType: !651, size: 96)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "vclip_info_t", file: !528, line: 197, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vclip_info_s", file: !528, line: 192, size: 96, flags: DIFlagTypePassByValue, elements: !653, identifier: "_ZTS12vclip_info_s")
!653 = !{!654, !655, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_num", scope: !652, file: !528, line: 194, baseType: !63, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "frametime", scope: !652, file: !528, line: 195, baseType: !69, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !652, file: !528, line: 196, baseType: !155, size: 8, offset: 64)
!657 = !DILocalVariable(name: "psegs", arg: 1, scope: !523, file: !2, line: 143, type: !301)
!658 = !DILocation(line: 143, column: 38, scope: !523)
!659 = !DILocalVariable(name: "num_points", arg: 2, scope: !523, file: !2, line: 143, type: !315)
!660 = !DILocation(line: 143, column: 50, scope: !523)
!661 = !DILocalVariable(name: "objp", arg: 3, scope: !523, file: !2, line: 143, type: !526)
!662 = !DILocation(line: 143, column: 70, scope: !523)
!663 = !DILocalVariable(name: "rand_flag", arg: 4, scope: !523, file: !2, line: 143, type: !63)
!664 = !DILocation(line: 143, column: 80, scope: !523)
!665 = !DILocalVariable(name: "i", scope: !523, file: !2, line: 145, type: !63)
!666 = !DILocation(line: 145, column: 6, scope: !523)
!667 = !DILocalVariable(name: "new_psegs", scope: !523, file: !2, line: 146, type: !668)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 25600, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 200)
!671 = !DILocation(line: 146, column: 12, scope: !523)
!672 = !DILocation(line: 148, column: 2, scope: !523)
!673 = !DILocation(line: 150, column: 8, scope: !674)
!674 = distinct !DILexicalBlock(scope: !523, file: !2, line: 150, column: 2)
!675 = !DILocation(line: 150, column: 7, scope: !674)
!676 = !DILocation(line: 150, column: 12, scope: !677)
!677 = distinct !DILexicalBlock(scope: !674, file: !2, line: 150, column: 2)
!678 = !DILocation(line: 150, column: 15, scope: !677)
!679 = !DILocation(line: 150, column: 14, scope: !677)
!680 = !DILocation(line: 150, column: 25, scope: !677)
!681 = !DILocation(line: 150, column: 13, scope: !677)
!682 = !DILocation(line: 150, column: 2, scope: !674)
!683 = !DILocalVariable(name: "new_segnum", scope: !684, file: !2, line: 151, type: !63)
!684 = distinct !DILexicalBlock(scope: !677, file: !2, line: 150, column: 34)
!685 = !DILocation(line: 151, column: 9, scope: !684)
!686 = !DILocalVariable(name: "segment_size", scope: !684, file: !2, line: 152, type: !69)
!687 = !DILocation(line: 152, column: 9, scope: !684)
!688 = !DILocalVariable(name: "segnum", scope: !684, file: !2, line: 153, type: !63)
!689 = !DILocation(line: 153, column: 9, scope: !684)
!690 = !DILocalVariable(name: "a", scope: !684, file: !2, line: 154, type: !308)
!691 = !DILocation(line: 154, column: 14, scope: !684)
!692 = !DILocalVariable(name: "b", scope: !684, file: !2, line: 154, type: !308)
!693 = !DILocation(line: 154, column: 17, scope: !684)
!694 = !DILocalVariable(name: "c", scope: !684, file: !2, line: 154, type: !308)
!695 = !DILocation(line: 154, column: 20, scope: !684)
!696 = !DILocalVariable(name: "d", scope: !684, file: !2, line: 154, type: !308)
!697 = !DILocation(line: 154, column: 23, scope: !684)
!698 = !DILocalVariable(name: "e", scope: !684, file: !2, line: 154, type: !308)
!699 = !DILocation(line: 154, column: 26, scope: !684)
!700 = !DILocalVariable(name: "goal_pos", scope: !684, file: !2, line: 155, type: !308)
!701 = !DILocation(line: 155, column: 14, scope: !684)
!702 = !DILocalVariable(name: "count", scope: !684, file: !2, line: 156, type: !63)
!703 = !DILocation(line: 156, column: 9, scope: !684)
!704 = !DILocalVariable(name: "temp_segnum", scope: !684, file: !2, line: 157, type: !63)
!705 = !DILocation(line: 157, column: 9, scope: !684)
!706 = !DILocation(line: 160, column: 33, scope: !684)
!707 = !DILocation(line: 160, column: 39, scope: !684)
!708 = !DILocation(line: 160, column: 42, scope: !684)
!709 = !DILocation(line: 160, column: 49, scope: !684)
!710 = !DILocation(line: 160, column: 55, scope: !684)
!711 = !DILocation(line: 160, column: 58, scope: !684)
!712 = !DILocation(line: 160, column: 17, scope: !684)
!713 = !DILocation(line: 160, column: 15, scope: !684)
!714 = !DILocation(line: 161, column: 3, scope: !684)
!715 = !DILocation(line: 162, column: 21, scope: !684)
!716 = !DILocation(line: 162, column: 3, scope: !684)
!717 = !DILocation(line: 162, column: 9, scope: !684)
!718 = !DILocation(line: 162, column: 12, scope: !684)
!719 = !DILocation(line: 162, column: 19, scope: !684)
!720 = !DILocation(line: 163, column: 12, scope: !684)
!721 = !DILocation(line: 163, column: 18, scope: !684)
!722 = !DILocation(line: 163, column: 21, scope: !684)
!723 = !DILocation(line: 163, column: 10, scope: !684)
!724 = !DILocation(line: 165, column: 19, scope: !684)
!725 = !DILocation(line: 165, column: 25, scope: !684)
!726 = !DILocation(line: 165, column: 28, scope: !684)
!727 = !DILocation(line: 165, column: 36, scope: !684)
!728 = !DILocation(line: 165, column: 42, scope: !684)
!729 = !DILocation(line: 165, column: 43, scope: !684)
!730 = !DILocation(line: 165, column: 47, scope: !684)
!731 = !DILocation(line: 165, column: 3, scope: !684)
!732 = !DILocation(line: 166, column: 19, scope: !684)
!733 = !DILocation(line: 166, column: 25, scope: !684)
!734 = !DILocation(line: 166, column: 26, scope: !684)
!735 = !DILocation(line: 166, column: 30, scope: !684)
!736 = !DILocation(line: 166, column: 38, scope: !684)
!737 = !DILocation(line: 166, column: 44, scope: !684)
!738 = !DILocation(line: 166, column: 47, scope: !684)
!739 = !DILocation(line: 166, column: 3, scope: !684)
!740 = !DILocation(line: 167, column: 19, scope: !684)
!741 = !DILocation(line: 167, column: 25, scope: !684)
!742 = !DILocation(line: 167, column: 26, scope: !684)
!743 = !DILocation(line: 167, column: 30, scope: !684)
!744 = !DILocation(line: 167, column: 38, scope: !684)
!745 = !DILocation(line: 167, column: 44, scope: !684)
!746 = !DILocation(line: 167, column: 45, scope: !684)
!747 = !DILocation(line: 167, column: 49, scope: !684)
!748 = !DILocation(line: 167, column: 3, scope: !684)
!749 = !DILocation(line: 169, column: 3, scope: !684)
!750 = !DILocation(line: 170, column: 3, scope: !684)
!751 = !DILocation(line: 171, column: 11, scope: !752)
!752 = distinct !DILexicalBlock(scope: !684, file: !2, line: 171, column: 7)
!753 = !DILocation(line: 171, column: 7, scope: !752)
!754 = !DILocation(line: 171, column: 31, scope: !752)
!755 = !DILocation(line: 172, column: 14, scope: !756)
!756 = distinct !DILexicalBlock(scope: !757, file: !2, line: 172, column: 8)
!757 = distinct !DILexicalBlock(scope: !752, file: !2, line: 171, column: 44)
!758 = !DILocation(line: 172, column: 8, scope: !756)
!759 = !DILocation(line: 172, column: 17, scope: !756)
!760 = !DILocation(line: 173, column: 9, scope: !761)
!761 = distinct !DILexicalBlock(scope: !762, file: !2, line: 173, column: 9)
!762 = distinct !DILexicalBlock(scope: !756, file: !2, line: 172, column: 27)
!763 = !DILocation(line: 174, column: 13, scope: !764)
!764 = distinct !DILexicalBlock(scope: !761, file: !2, line: 173, column: 20)
!765 = !DILocation(line: 174, column: 21, scope: !764)
!766 = !DILocation(line: 174, column: 28, scope: !764)
!767 = !DILocation(line: 174, column: 8, scope: !764)
!768 = !DILocation(line: 174, column: 10, scope: !764)
!769 = !DILocation(line: 175, column: 13, scope: !764)
!770 = !DILocation(line: 175, column: 21, scope: !764)
!771 = !DILocation(line: 175, column: 28, scope: !764)
!772 = !DILocation(line: 175, column: 8, scope: !764)
!773 = !DILocation(line: 175, column: 10, scope: !764)
!774 = !DILocation(line: 176, column: 18, scope: !764)
!775 = !DILocation(line: 176, column: 12, scope: !764)
!776 = !DILocation(line: 176, column: 29, scope: !764)
!777 = !DILocation(line: 176, column: 23, scope: !764)
!778 = !DILocation(line: 176, column: 21, scope: !764)
!779 = !DILocation(line: 176, column: 32, scope: !764)
!780 = !DILocation(line: 176, column: 8, scope: !764)
!781 = !DILocation(line: 176, column: 10, scope: !764)
!782 = !DILocation(line: 177, column: 6, scope: !764)
!783 = !DILocation(line: 178, column: 5, scope: !764)
!784 = !DILocation(line: 179, column: 8, scope: !785)
!785 = distinct !DILexicalBlock(scope: !761, file: !2, line: 178, column: 12)
!786 = !DILocation(line: 179, column: 10, scope: !785)
!787 = !DILocation(line: 180, column: 8, scope: !785)
!788 = !DILocation(line: 180, column: 10, scope: !785)
!789 = !DILocation(line: 181, column: 8, scope: !785)
!790 = !DILocation(line: 181, column: 10, scope: !785)
!791 = !DILocation(line: 183, column: 4, scope: !762)
!792 = !DILocation(line: 184, column: 9, scope: !793)
!793 = distinct !DILexicalBlock(scope: !794, file: !2, line: 184, column: 9)
!794 = distinct !DILexicalBlock(scope: !756, file: !2, line: 183, column: 11)
!795 = !DILocation(line: 185, column: 13, scope: !796)
!796 = distinct !DILexicalBlock(scope: !793, file: !2, line: 184, column: 20)
!797 = !DILocation(line: 185, column: 21, scope: !796)
!798 = !DILocation(line: 185, column: 28, scope: !796)
!799 = !DILocation(line: 185, column: 8, scope: !796)
!800 = !DILocation(line: 185, column: 10, scope: !796)
!801 = !DILocation(line: 186, column: 13, scope: !796)
!802 = !DILocation(line: 186, column: 21, scope: !796)
!803 = !DILocation(line: 186, column: 28, scope: !796)
!804 = !DILocation(line: 186, column: 8, scope: !796)
!805 = !DILocation(line: 186, column: 10, scope: !796)
!806 = !DILocation(line: 187, column: 18, scope: !796)
!807 = !DILocation(line: 187, column: 12, scope: !796)
!808 = !DILocation(line: 187, column: 29, scope: !796)
!809 = !DILocation(line: 187, column: 23, scope: !796)
!810 = !DILocation(line: 187, column: 21, scope: !796)
!811 = !DILocation(line: 187, column: 32, scope: !796)
!812 = !DILocation(line: 187, column: 8, scope: !796)
!813 = !DILocation(line: 187, column: 10, scope: !796)
!814 = !DILocation(line: 188, column: 6, scope: !796)
!815 = !DILocation(line: 189, column: 5, scope: !796)
!816 = !DILocation(line: 190, column: 8, scope: !817)
!817 = distinct !DILexicalBlock(scope: !793, file: !2, line: 189, column: 12)
!818 = !DILocation(line: 190, column: 10, scope: !817)
!819 = !DILocation(line: 191, column: 8, scope: !817)
!820 = !DILocation(line: 191, column: 10, scope: !817)
!821 = !DILocation(line: 192, column: 8, scope: !817)
!822 = !DILocation(line: 192, column: 10, scope: !817)
!823 = !DILocation(line: 195, column: 3, scope: !757)
!824 = !DILocation(line: 196, column: 4, scope: !825)
!825 = distinct !DILexicalBlock(scope: !752, file: !2, line: 195, column: 10)
!826 = !DILocation(line: 197, column: 4, scope: !825)
!827 = !DILocation(line: 198, column: 4, scope: !825)
!828 = !DILocation(line: 201, column: 5, scope: !829)
!829 = distinct !DILexicalBlock(scope: !684, file: !2, line: 201, column: 5)
!830 = !DILocation(line: 201, column: 26, scope: !829)
!831 = !DILocation(line: 202, column: 2, scope: !829)
!832 = !DILocation(line: 206, column: 55, scope: !684)
!833 = !DILocation(line: 206, column: 46, scope: !684)
!834 = !DILocation(line: 206, column: 63, scope: !684)
!835 = !DILocation(line: 206, column: 37, scope: !684)
!836 = !DILocation(line: 206, column: 93, scope: !684)
!837 = !DILocation(line: 206, column: 84, scope: !684)
!838 = !DILocation(line: 206, column: 101, scope: !684)
!839 = !DILocation(line: 206, column: 75, scope: !684)
!840 = !DILocation(line: 206, column: 18, scope: !684)
!841 = !DILocation(line: 206, column: 16, scope: !684)
!842 = !DILocation(line: 207, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !684, file: !2, line: 207, column: 7)
!844 = !DILocation(line: 207, column: 20, scope: !843)
!845 = !DILocation(line: 208, column: 17, scope: !843)
!846 = !DILocation(line: 208, column: 4, scope: !843)
!847 = !DILocation(line: 210, column: 32, scope: !684)
!848 = !DILocation(line: 210, column: 38, scope: !684)
!849 = !DILocation(line: 210, column: 41, scope: !684)
!850 = !DILocation(line: 210, column: 52, scope: !684)
!851 = !DILocation(line: 210, column: 64, scope: !684)
!852 = !DILocation(line: 210, column: 3, scope: !684)
!853 = !DILocation(line: 212, column: 9, scope: !684)
!854 = !DILocation(line: 213, column: 3, scope: !684)
!855 = !DILocation(line: 213, column: 10, scope: !684)
!856 = !DILocalVariable(name: "fq", scope: !857, file: !2, line: 214, type: !858)
!857 = distinct !DILexicalBlock(scope: !684, file: !2, line: 213, column: 17)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "fvi_query", file: !859, line: 58, baseType: !860)
!859 = !DIFile(filename: "main_d2/fvi.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d2a92d1b0ff4ebfc1a57eff3c7d6fa46")
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fvi_query", file: !859, line: 50, size: 384, flags: DIFlagTypePassByValue, elements: !861, identifier: "_ZTS9fvi_query")
!861 = !{!862, !864, !865, !866, !867, !868, !869}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "p0", scope: !860, file: !859, line: 52, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !860, file: !859, line: 52, baseType: !863, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "startseg", scope: !860, file: !859, line: 53, baseType: !63, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !860, file: !859, line: 54, baseType: !69, size: 32, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "thisobjnum", scope: !860, file: !859, line: 55, baseType: !162, size: 16, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_obj_list", scope: !860, file: !859, line: 56, baseType: !315, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !860, file: !859, line: 57, baseType: !63, size: 32, offset: 320)
!870 = !DILocation(line: 214, column: 14, scope: !857)
!871 = !DILocalVariable(name: "hit_data", scope: !857, file: !2, line: 215, type: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "fvi_info", file: !859, line: 40, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fvi_info", file: !859, line: 29, size: 3584, flags: DIFlagTypePassByValue, elements: !874, identifier: "_ZTS8fvi_info")
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "hit_type", scope: !873, file: !859, line: 31, baseType: !63, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "hit_pnt", scope: !873, file: !859, line: 32, baseType: !308, size: 96, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "hit_seg", scope: !873, file: !859, line: 33, baseType: !63, size: 32, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "hit_side", scope: !873, file: !859, line: 34, baseType: !63, size: 32, offset: 160)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "hit_side_seg", scope: !873, file: !859, line: 35, baseType: !63, size: 32, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "hit_object", scope: !873, file: !859, line: 36, baseType: !63, size: 32, offset: 224)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "hit_wallnorm", scope: !873, file: !859, line: 37, baseType: !308, size: 96, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "n_segs", scope: !873, file: !859, line: 38, baseType: !63, size: 32, offset: 352)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "seglist", scope: !873, file: !859, line: 39, baseType: !884, size: 3200, offset: 384)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 3200, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 100)
!887 = !DILocation(line: 215, column: 14, scope: !857)
!888 = !DILocalVariable(name: "hit_type", scope: !857, file: !2, line: 216, type: !63)
!889 = !DILocation(line: 216, column: 10, scope: !857)
!890 = !DILocation(line: 218, column: 18, scope: !857)
!891 = !DILocation(line: 218, column: 24, scope: !857)
!892 = !DILocation(line: 218, column: 27, scope: !857)
!893 = !DILocation(line: 218, column: 7, scope: !857)
!894 = !DILocation(line: 218, column: 15, scope: !857)
!895 = !DILocation(line: 219, column: 21, scope: !857)
!896 = !DILocation(line: 219, column: 27, scope: !857)
!897 = !DILocation(line: 219, column: 30, scope: !857)
!898 = !DILocation(line: 219, column: 7, scope: !857)
!899 = !DILocation(line: 219, column: 19, scope: !857)
!900 = !DILocation(line: 220, column: 7, scope: !857)
!901 = !DILocation(line: 220, column: 15, scope: !857)
!902 = !DILocation(line: 221, column: 17, scope: !857)
!903 = !DILocation(line: 221, column: 23, scope: !857)
!904 = !DILocation(line: 221, column: 7, scope: !857)
!905 = !DILocation(line: 221, column: 15, scope: !857)
!906 = !DILocation(line: 222, column: 22, scope: !857)
!907 = !DILocation(line: 222, column: 26, scope: !857)
!908 = !DILocation(line: 222, column: 7, scope: !857)
!909 = !DILocation(line: 222, column: 20, scope: !857)
!910 = !DILocation(line: 223, column: 7, scope: !857)
!911 = !DILocation(line: 223, column: 23, scope: !857)
!912 = !DILocation(line: 224, column: 7, scope: !857)
!913 = !DILocation(line: 224, column: 17, scope: !857)
!914 = !DILocation(line: 226, column: 15, scope: !857)
!915 = !DILocation(line: 226, column: 13, scope: !857)
!916 = !DILocation(line: 228, column: 8, scope: !917)
!917 = distinct !DILexicalBlock(scope: !857, file: !2, line: 228, column: 8)
!918 = !DILocation(line: 228, column: 17, scope: !917)
!919 = !DILocation(line: 229, column: 11, scope: !917)
!920 = !DILocation(line: 229, column: 5, scope: !917)
!921 = !DILocation(line: 231, column: 10, scope: !922)
!922 = distinct !DILexicalBlock(scope: !923, file: !2, line: 231, column: 9)
!923 = distinct !DILexicalBlock(scope: !917, file: !2, line: 230, column: 9)
!924 = !DILocation(line: 231, column: 16, scope: !922)
!925 = !DILocation(line: 231, column: 22, scope: !922)
!926 = !DILocation(line: 231, column: 26, scope: !922)
!927 = !DILocation(line: 231, column: 35, scope: !922)
!928 = !DILocation(line: 232, column: 6, scope: !922)
!929 = !DILocation(line: 233, column: 22, scope: !923)
!930 = !DILocation(line: 233, column: 26, scope: !923)
!931 = !DILocation(line: 233, column: 39, scope: !923)
!932 = !DILocation(line: 233, column: 47, scope: !923)
!933 = !DILocation(line: 233, column: 28, scope: !923)
!934 = !DILocation(line: 233, column: 49, scope: !923)
!935 = !DILocation(line: 233, column: 14, scope: !923)
!936 = !DILocation(line: 233, column: 16, scope: !923)
!937 = !DILocation(line: 234, column: 22, scope: !923)
!938 = !DILocation(line: 234, column: 26, scope: !923)
!939 = !DILocation(line: 234, column: 39, scope: !923)
!940 = !DILocation(line: 234, column: 47, scope: !923)
!941 = !DILocation(line: 234, column: 28, scope: !923)
!942 = !DILocation(line: 234, column: 49, scope: !923)
!943 = !DILocation(line: 234, column: 14, scope: !923)
!944 = !DILocation(line: 234, column: 16, scope: !923)
!945 = !DILocation(line: 235, column: 22, scope: !923)
!946 = !DILocation(line: 235, column: 26, scope: !923)
!947 = !DILocation(line: 235, column: 39, scope: !923)
!948 = !DILocation(line: 235, column: 47, scope: !923)
!949 = !DILocation(line: 235, column: 28, scope: !923)
!950 = !DILocation(line: 235, column: 49, scope: !923)
!951 = !DILocation(line: 235, column: 14, scope: !923)
!952 = !DILocation(line: 235, column: 16, scope: !923)
!953 = !DILocation(line: 236, column: 10, scope: !923)
!954 = !DILocation(line: 237, column: 9, scope: !955)
!955 = distinct !DILexicalBlock(scope: !923, file: !2, line: 237, column: 9)
!956 = !DILocation(line: 237, column: 15, scope: !955)
!957 = !DILocation(line: 238, column: 17, scope: !958)
!958 = distinct !DILexicalBlock(scope: !955, file: !2, line: 237, column: 21)
!959 = !DILocation(line: 238, column: 23, scope: !958)
!960 = !DILocation(line: 238, column: 26, scope: !958)
!961 = !DILocation(line: 238, column: 15, scope: !958)
!962 = !DILocation(line: 239, column: 5, scope: !958)
!963 = distinct !{!963, !854, !964, !262}
!964 = !DILocation(line: 241, column: 3, scope: !684)
!965 = !DILocation(line: 244, column: 42, scope: !684)
!966 = !DILocation(line: 244, column: 48, scope: !684)
!967 = !DILocation(line: 244, column: 51, scope: !684)
!968 = !DILocation(line: 244, column: 16, scope: !684)
!969 = !DILocation(line: 244, column: 14, scope: !684)
!970 = !DILocation(line: 245, column: 7, scope: !971)
!971 = distinct !DILexicalBlock(scope: !684, file: !2, line: 245, column: 7)
!972 = !DILocation(line: 245, column: 21, scope: !971)
!973 = !DILocation(line: 245, column: 27, scope: !971)
!974 = !DILocation(line: 245, column: 30, scope: !971)
!975 = !DILocation(line: 245, column: 18, scope: !971)
!976 = !DILocation(line: 246, column: 14, scope: !977)
!977 = distinct !DILexicalBlock(scope: !971, file: !2, line: 245, column: 38)
!978 = !DILocation(line: 246, column: 4, scope: !977)
!979 = !DILocation(line: 246, column: 17, scope: !977)
!980 = !DILocation(line: 246, column: 23, scope: !977)
!981 = !DILocation(line: 247, column: 26, scope: !977)
!982 = !DILocation(line: 247, column: 14, scope: !977)
!983 = !DILocation(line: 247, column: 4, scope: !977)
!984 = !DILocation(line: 247, column: 17, scope: !977)
!985 = !DILocation(line: 247, column: 24, scope: !977)
!986 = !DILocation(line: 248, column: 3, scope: !977)
!987 = !DILocation(line: 249, column: 25, scope: !988)
!988 = distinct !DILexicalBlock(scope: !971, file: !2, line: 248, column: 10)
!989 = !DILocation(line: 249, column: 31, scope: !988)
!990 = !DILocation(line: 249, column: 34, scope: !988)
!991 = !DILocation(line: 249, column: 14, scope: !988)
!992 = !DILocation(line: 249, column: 4, scope: !988)
!993 = !DILocation(line: 249, column: 17, scope: !988)
!994 = !DILocation(line: 249, column: 23, scope: !988)
!995 = !DILocation(line: 250, column: 26, scope: !988)
!996 = !DILocation(line: 250, column: 32, scope: !988)
!997 = !DILocation(line: 250, column: 35, scope: !988)
!998 = !DILocation(line: 250, column: 14, scope: !988)
!999 = !DILocation(line: 250, column: 4, scope: !988)
!1000 = !DILocation(line: 250, column: 17, scope: !988)
!1001 = !DILocation(line: 250, column: 24, scope: !988)
!1002 = !DILocation(line: 253, column: 2, scope: !684)
!1003 = !DILocation(line: 150, column: 30, scope: !677)
!1004 = !DILocation(line: 150, column: 2, scope: !677)
!1005 = distinct !{!1005, !682, !1006, !262}
!1006 = !DILocation(line: 253, column: 2, scope: !674)
!1007 = !DILocation(line: 255, column: 8, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !523, file: !2, line: 255, column: 2)
!1009 = !DILocation(line: 255, column: 7, scope: !1008)
!1010 = !DILocation(line: 255, column: 12, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 255, column: 2)
!1012 = !DILocation(line: 255, column: 15, scope: !1011)
!1013 = !DILocation(line: 255, column: 14, scope: !1011)
!1014 = !DILocation(line: 255, column: 25, scope: !1011)
!1015 = !DILocation(line: 255, column: 13, scope: !1011)
!1016 = !DILocation(line: 255, column: 2, scope: !1008)
!1017 = !DILocation(line: 256, column: 24, scope: !1011)
!1018 = !DILocation(line: 256, column: 14, scope: !1011)
!1019 = !DILocation(line: 256, column: 3, scope: !1011)
!1020 = !DILocation(line: 256, column: 9, scope: !1011)
!1021 = !DILocation(line: 256, column: 12, scope: !1011)
!1022 = !DILocation(line: 255, column: 30, scope: !1011)
!1023 = !DILocation(line: 255, column: 2, scope: !1011)
!1024 = distinct !{!1024, !1016, !1025, !262}
!1025 = !DILocation(line: 256, column: 25, scope: !1008)
!1026 = !DILocation(line: 257, column: 1, scope: !523)
!1027 = distinct !DISubprogram(name: "create_path_points", linkageName: "_Z18create_path_pointsP6objectiiP9point_segPsiiii", scope: !2, file: !2, line: 272, type: !1028, scopeLine: 273, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !242)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!63, !526, !63, !63, !301, !1030, !63, !63, !63, !63}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!1031 = !DILocalVariable(name: "objp", arg: 1, scope: !1027, file: !2, line: 272, type: !526)
!1032 = !DILocation(line: 272, column: 32, scope: !1027)
!1033 = !DILocalVariable(name: "start_seg", arg: 2, scope: !1027, file: !2, line: 272, type: !63)
!1034 = !DILocation(line: 272, column: 42, scope: !1027)
!1035 = !DILocalVariable(name: "end_seg", arg: 3, scope: !1027, file: !2, line: 272, type: !63)
!1036 = !DILocation(line: 272, column: 57, scope: !1027)
!1037 = !DILocalVariable(name: "psegs", arg: 4, scope: !1027, file: !2, line: 272, type: !301)
!1038 = !DILocation(line: 272, column: 77, scope: !1027)
!1039 = !DILocalVariable(name: "num_points", arg: 5, scope: !1027, file: !2, line: 272, type: !1030)
!1040 = !DILocation(line: 272, column: 91, scope: !1027)
!1041 = !DILocalVariable(name: "max_depth", arg: 6, scope: !1027, file: !2, line: 272, type: !63)
!1042 = !DILocation(line: 272, column: 107, scope: !1027)
!1043 = !DILocalVariable(name: "random_flag", arg: 7, scope: !1027, file: !2, line: 272, type: !63)
!1044 = !DILocation(line: 272, column: 122, scope: !1027)
!1045 = !DILocalVariable(name: "safety_flag", arg: 8, scope: !1027, file: !2, line: 272, type: !63)
!1046 = !DILocation(line: 272, column: 139, scope: !1027)
!1047 = !DILocalVariable(name: "avoid_seg", arg: 9, scope: !1027, file: !2, line: 272, type: !63)
!1048 = !DILocation(line: 272, column: 156, scope: !1027)
!1049 = !DILocalVariable(name: "cur_seg", scope: !1027, file: !2, line: 274, type: !63)
!1050 = !DILocation(line: 274, column: 7, scope: !1027)
!1051 = !DILocalVariable(name: "sidenum", scope: !1027, file: !2, line: 275, type: !63)
!1052 = !DILocation(line: 275, column: 7, scope: !1027)
!1053 = !DILocalVariable(name: "qtail", scope: !1027, file: !2, line: 276, type: !63)
!1054 = !DILocation(line: 276, column: 7, scope: !1027)
!1055 = !DILocalVariable(name: "qhead", scope: !1027, file: !2, line: 276, type: !63)
!1056 = !DILocation(line: 276, column: 18, scope: !1027)
!1057 = !DILocalVariable(name: "i", scope: !1027, file: !2, line: 277, type: !63)
!1058 = !DILocation(line: 277, column: 7, scope: !1027)
!1059 = !DILocalVariable(name: "visited", scope: !1027, file: !2, line: 278, type: !1060)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 7200, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 900)
!1063 = !DILocation(line: 278, column: 10, scope: !1027)
!1064 = !DILocalVariable(name: "seg_queue", scope: !1027, file: !2, line: 279, type: !1065)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 28800, elements: !1061)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "seg_seg", file: !303, line: 182, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 180, size: 32, flags: DIFlagTypePassByValue, elements: !1068, identifier: "_ZTS7seg_seg")
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1067, file: !303, line: 181, baseType: !162, size: 16)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1067, file: !303, line: 181, baseType: !162, size: 16, offset: 16)
!1071 = !DILocation(line: 279, column: 10, scope: !1027)
!1072 = !DILocalVariable(name: "depth", scope: !1027, file: !2, line: 280, type: !1073)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 14400, elements: !1061)
!1074 = !DILocation(line: 280, column: 9, scope: !1027)
!1075 = !DILocalVariable(name: "cur_depth", scope: !1027, file: !2, line: 281, type: !63)
!1076 = !DILocation(line: 281, column: 7, scope: !1027)
!1077 = !DILocalVariable(name: "random_xlate", scope: !1027, file: !2, line: 282, type: !1078)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 48, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 6)
!1081 = !DILocation(line: 282, column: 10, scope: !1027)
!1082 = !DILocalVariable(name: "original_psegs", scope: !1027, file: !2, line: 283, type: !301)
!1083 = !DILocation(line: 283, column: 13, scope: !1027)
!1084 = !DILocation(line: 283, column: 30, scope: !1027)
!1085 = !DILocalVariable(name: "l_num_points", scope: !1027, file: !2, line: 284, type: !63)
!1086 = !DILocation(line: 284, column: 7, scope: !1027)
!1087 = !DILocation(line: 291, column: 6, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 291, column: 5)
!1089 = !DILocation(line: 291, column: 12, scope: !1088)
!1090 = !DILocation(line: 291, column: 17, scope: !1088)
!1091 = !DILocation(line: 291, column: 31, scope: !1088)
!1092 = !DILocation(line: 291, column: 35, scope: !1088)
!1093 = !DILocation(line: 291, column: 41, scope: !1088)
!1094 = !DILocation(line: 291, column: 55, scope: !1088)
!1095 = !DILocation(line: 291, column: 64, scope: !1088)
!1096 = !DILocation(line: 292, column: 14, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1088, file: !2, line: 291, column: 82)
!1098 = !DILocation(line: 293, column: 14, scope: !1097)
!1099 = !DILocation(line: 293, column: 29, scope: !1097)
!1100 = !DILocation(line: 293, column: 12, scope: !1097)
!1101 = !DILocation(line: 295, column: 1, scope: !1097)
!1102 = !DILocation(line: 297, column: 6, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 297, column: 6)
!1104 = !DILocation(line: 297, column: 16, scope: !1103)
!1105 = !DILocation(line: 298, column: 13, scope: !1103)
!1106 = !DILocation(line: 298, column: 3, scope: !1103)
!1107 = !DILocation(line: 300, column: 15, scope: !1027)
!1108 = !DILocation(line: 308, column: 2, scope: !1027)
!1109 = !DILocation(line: 308, column: 41, scope: !1027)
!1110 = !DILocation(line: 308, column: 62, scope: !1027)
!1111 = !DILocation(line: 308, column: 40, scope: !1027)
!1112 = !DILocation(line: 308, column: 39, scope: !1027)
!1113 = !DILocation(line: 309, column: 2, scope: !1027)
!1114 = !DILocation(line: 309, column: 37, scope: !1027)
!1115 = !DILocation(line: 309, column: 58, scope: !1027)
!1116 = !DILocation(line: 309, column: 36, scope: !1027)
!1117 = !DILocation(line: 309, column: 35, scope: !1027)
!1118 = !DILocation(line: 312, column: 6, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 312, column: 6)
!1120 = !DILocation(line: 312, column: 16, scope: !1119)
!1121 = !DILocation(line: 313, column: 3, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1119, file: !2, line: 312, column: 23)
!1123 = !DILocation(line: 314, column: 8, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1122, file: !2, line: 314, column: 7)
!1125 = !DILocation(line: 314, column: 21, scope: !1124)
!1126 = !DILocation(line: 314, column: 18, scope: !1124)
!1127 = !DILocation(line: 314, column: 32, scope: !1124)
!1128 = !DILocation(line: 314, column: 36, scope: !1124)
!1129 = !DILocation(line: 314, column: 47, scope: !1124)
!1130 = !DILocation(line: 314, column: 44, scope: !1124)
!1131 = !DILocation(line: 316, column: 12, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1124, file: !2, line: 315, column: 3)
!1133 = !DILocation(line: 316, column: 4, scope: !1132)
!1134 = !DILocation(line: 316, column: 23, scope: !1132)
!1135 = !DILocation(line: 317, column: 10, scope: !1132)
!1136 = !DILocation(line: 317, column: 4, scope: !1132)
!1137 = !DILocation(line: 317, column: 21, scope: !1132)
!1138 = !DILocation(line: 318, column: 3, scope: !1132)
!1139 = !DILocation(line: 320, column: 2, scope: !1122)
!1140 = !DILocation(line: 322, column: 6, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 322, column: 6)
!1142 = !DILocation(line: 323, column: 23, scope: !1141)
!1143 = !DILocation(line: 323, column: 3, scope: !1141)
!1144 = !DILocation(line: 325, column: 12, scope: !1027)
!1145 = !DILocation(line: 325, column: 10, scope: !1027)
!1146 = !DILocation(line: 326, column: 10, scope: !1027)
!1147 = !DILocation(line: 326, column: 2, scope: !1027)
!1148 = !DILocation(line: 326, column: 19, scope: !1027)
!1149 = !DILocation(line: 327, column: 12, scope: !1027)
!1150 = !DILocation(line: 329, column: 2, scope: !1027)
!1151 = !DILocation(line: 329, column: 9, scope: !1027)
!1152 = !DILocation(line: 329, column: 20, scope: !1027)
!1153 = !DILocation(line: 329, column: 17, scope: !1027)
!1154 = !DILocalVariable(name: "segp", scope: !1155, file: !2, line: 331, type: !1156)
!1155 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 330, column: 2)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "segment", file: !1158, line: 123, baseType: !1159)
!1158 = !DIFile(filename: "main_d2/segment.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c950815a9b07e6bab2fa2587b90affec")
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "segment", file: !1158, line: 100, size: 4096, flags: DIFlagTypePassByValue, elements: !1160, identifier: "_ZTS7segment")
!1160 = !{!1161, !1185, !1187, !1191}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "sides", scope: !1159, file: !1158, line: 105, baseType: !1162, size: 3840)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1163, size: 3840, elements: !1079)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "side", file: !1158, line: 91, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "side", file: !1158, line: 82, size: 640, flags: DIFlagTypePassByValue, elements: !1165, identifier: "_ZTS4side")
!1165 = !{!1166, !1167, !1168, !1169, !1170, !1171, !1181}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1164, file: !1158, line: 84, baseType: !155, size: 8)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1164, file: !1158, line: 85, baseType: !166, size: 8, offset: 8)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "wall_num", scope: !1164, file: !1158, line: 86, baseType: !162, size: 16, offset: 16)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_num", scope: !1164, file: !1158, line: 87, baseType: !162, size: 16, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_num2", scope: !1164, file: !1158, line: 88, baseType: !162, size: 16, offset: 48)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "uvls", scope: !1164, file: !1158, line: 89, baseType: !1172, size: 384, offset: 64)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1173, size: 384, elements: !1179)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uvl", file: !1158, line: 67, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uvl", file: !1158, line: 64, size: 96, flags: DIFlagTypePassByValue, elements: !1175, identifier: "_ZTS3uvl")
!1175 = !{!1176, !1177, !1178}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1174, file: !1158, line: 66, baseType: !69, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1174, file: !1158, line: 66, baseType: !69, size: 32, offset: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1174, file: !1158, line: 66, baseType: !69, size: 32, offset: 64)
!1179 = !{!1180}
!1180 = !DISubrange(count: 4)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "normals", scope: !1164, file: !1158, line: 90, baseType: !1182, size: 192, offset: 448)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 192, elements: !1183)
!1183 = !{!1184}
!1184 = !DISubrange(count: 2)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1159, file: !1158, line: 106, baseType: !1186, size: 96, offset: 3840)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 96, elements: !1079)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !1159, file: !1158, line: 107, baseType: !1188, size: 128, offset: 3936)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 128, elements: !1189)
!1189 = !{!1190}
!1190 = !DISubrange(count: 8)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1159, file: !1158, line: 112, baseType: !63, size: 32, offset: 4064)
!1192 = !DILocation(line: 331, column: 12, scope: !1155)
!1193 = !DILocation(line: 331, column: 29, scope: !1155)
!1194 = !DILocation(line: 331, column: 20, scope: !1155)
!1195 = !DILocation(line: 333, column: 7, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 333, column: 7)
!1197 = !DILocation(line: 334, column: 8, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1196, file: !2, line: 334, column: 8)
!1199 = !DILocation(line: 334, column: 17, scope: !1198)
!1200 = !DILocation(line: 335, column: 25, scope: !1198)
!1201 = !DILocation(line: 335, column: 5, scope: !1198)
!1202 = !DILocation(line: 334, column: 19, scope: !1198)
!1203 = !DILocation(line: 338, column: 16, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 338, column: 3)
!1205 = !DILocation(line: 338, column: 8, scope: !1204)
!1206 = !DILocation(line: 338, column: 21, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1204, file: !2, line: 338, column: 3)
!1208 = !DILocation(line: 338, column: 29, scope: !1207)
!1209 = !DILocation(line: 338, column: 3, scope: !1204)
!1210 = !DILocalVariable(name: "snum", scope: !1211, file: !2, line: 341, type: !63)
!1211 = distinct !DILexicalBlock(scope: !1207, file: !2, line: 339, column: 3)
!1212 = !DILocation(line: 341, column: 8, scope: !1211)
!1213 = !DILocation(line: 341, column: 15, scope: !1211)
!1214 = !DILocation(line: 343, column: 8, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1211, file: !2, line: 343, column: 8)
!1216 = !DILocation(line: 344, column: 25, scope: !1215)
!1217 = !DILocation(line: 344, column: 12, scope: !1215)
!1218 = !DILocation(line: 344, column: 10, scope: !1215)
!1219 = !DILocation(line: 344, column: 5, scope: !1215)
!1220 = !DILocation(line: 346, column: 8, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1211, file: !2, line: 346, column: 8)
!1222 = !DILocation(line: 346, column: 39, scope: !1221)
!1223 = !DILocation(line: 346, column: 44, scope: !1221)
!1224 = !DILocation(line: 346, column: 72, scope: !1221)
!1225 = !DILocation(line: 346, column: 43, scope: !1221)
!1226 = !DILocation(line: 346, column: 88, scope: !1221)
!1227 = !DILocation(line: 346, column: 112, scope: !1221)
!1228 = !DILocation(line: 346, column: 118, scope: !1221)
!1229 = !DILocation(line: 346, column: 124, scope: !1221)
!1230 = !DILocation(line: 346, column: 92, scope: !1221)
!1231 = !DILocation(line: 346, column: 91, scope: !1221)
!1232 = !DILocalVariable(name: "this_seg", scope: !1233, file: !2, line: 348, type: !63)
!1233 = distinct !DILexicalBlock(scope: !1221, file: !2, line: 347, column: 4)
!1234 = !DILocation(line: 348, column: 11, scope: !1233)
!1235 = !DILocation(line: 348, column: 22, scope: !1233)
!1236 = !DILocation(line: 348, column: 28, scope: !1233)
!1237 = !DILocation(line: 348, column: 37, scope: !1233)
!1238 = !DILocation(line: 349, column: 5, scope: !1233)
!1239 = !DILocation(line: 350, column: 11, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1233, file: !2, line: 350, column: 9)
!1241 = !DILocation(line: 350, column: 22, scope: !1240)
!1242 = !DILocation(line: 350, column: 19, scope: !1240)
!1243 = !DILocation(line: 350, column: 33, scope: !1240)
!1244 = !DILocation(line: 350, column: 37, scope: !1240)
!1245 = !DILocation(line: 350, column: 49, scope: !1240)
!1246 = !DILocation(line: 350, column: 46, scope: !1240)
!1247 = !DILocation(line: 350, column: 61, scope: !1240)
!1248 = !DILocation(line: 350, column: 65, scope: !1240)
!1249 = !DILocation(line: 350, column: 80, scope: !1240)
!1250 = !DILocation(line: 350, column: 90, scope: !1240)
!1251 = !DILocation(line: 350, column: 87, scope: !1240)
!1252 = !DILocalVariable(name: "center_point", scope: !1253, file: !2, line: 352, type: !308)
!1253 = distinct !DILexicalBlock(scope: !1240, file: !2, line: 351, column: 5)
!1254 = !DILocation(line: 352, column: 17, scope: !1253)
!1255 = !DILocalVariable(name: "fq", scope: !1253, file: !2, line: 354, type: !858)
!1256 = !DILocation(line: 354, column: 16, scope: !1253)
!1257 = !DILocalVariable(name: "hit_data", scope: !1253, file: !2, line: 355, type: !872)
!1258 = !DILocation(line: 355, column: 16, scope: !1253)
!1259 = !DILocalVariable(name: "hit_type", scope: !1253, file: !2, line: 356, type: !63)
!1260 = !DILocation(line: 356, column: 12, scope: !1253)
!1261 = !DILocation(line: 358, column: 50, scope: !1253)
!1262 = !DILocation(line: 358, column: 56, scope: !1253)
!1263 = !DILocation(line: 358, column: 6, scope: !1253)
!1264 = !DILocation(line: 360, column: 20, scope: !1253)
!1265 = !DILocation(line: 360, column: 26, scope: !1253)
!1266 = !DILocation(line: 360, column: 9, scope: !1253)
!1267 = !DILocation(line: 360, column: 17, scope: !1253)
!1268 = !DILocation(line: 361, column: 23, scope: !1253)
!1269 = !DILocation(line: 361, column: 29, scope: !1253)
!1270 = !DILocation(line: 361, column: 9, scope: !1253)
!1271 = !DILocation(line: 361, column: 21, scope: !1253)
!1272 = !DILocation(line: 362, column: 9, scope: !1253)
!1273 = !DILocation(line: 362, column: 17, scope: !1253)
!1274 = !DILocation(line: 363, column: 19, scope: !1253)
!1275 = !DILocation(line: 363, column: 25, scope: !1253)
!1276 = !DILocation(line: 363, column: 9, scope: !1253)
!1277 = !DILocation(line: 363, column: 17, scope: !1253)
!1278 = !DILocation(line: 364, column: 24, scope: !1253)
!1279 = !DILocation(line: 364, column: 28, scope: !1253)
!1280 = !DILocation(line: 364, column: 9, scope: !1253)
!1281 = !DILocation(line: 364, column: 22, scope: !1253)
!1282 = !DILocation(line: 365, column: 9, scope: !1253)
!1283 = !DILocation(line: 365, column: 25, scope: !1253)
!1284 = !DILocation(line: 366, column: 9, scope: !1253)
!1285 = !DILocation(line: 366, column: 19, scope: !1253)
!1286 = !DILocation(line: 368, column: 17, scope: !1253)
!1287 = !DILocation(line: 368, column: 15, scope: !1253)
!1288 = !DILocation(line: 369, column: 10, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1253, file: !2, line: 369, column: 10)
!1290 = !DILocation(line: 369, column: 19, scope: !1289)
!1291 = !DILocation(line: 372, column: 7, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1289, file: !2, line: 370, column: 6)
!1293 = !DILocation(line: 374, column: 5, scope: !1253)
!1294 = !DILocation(line: 376, column: 18, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1233, file: !2, line: 376, column: 9)
!1296 = !DILocation(line: 376, column: 10, scope: !1295)
!1297 = !DILocation(line: 376, column: 9, scope: !1295)
!1298 = !DILocation(line: 378, column: 31, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1295, file: !2, line: 377, column: 5)
!1300 = !DILocation(line: 378, column: 16, scope: !1299)
!1301 = !DILocation(line: 378, column: 6, scope: !1299)
!1302 = !DILocation(line: 378, column: 23, scope: !1299)
!1303 = !DILocation(line: 378, column: 29, scope: !1299)
!1304 = !DILocation(line: 379, column: 29, scope: !1299)
!1305 = !DILocation(line: 379, column: 16, scope: !1299)
!1306 = !DILocation(line: 379, column: 6, scope: !1299)
!1307 = !DILocation(line: 379, column: 23, scope: !1299)
!1308 = !DILocation(line: 379, column: 27, scope: !1299)
!1309 = !DILocation(line: 380, column: 14, scope: !1299)
!1310 = !DILocation(line: 380, column: 6, scope: !1299)
!1311 = !DILocation(line: 380, column: 24, scope: !1299)
!1312 = !DILocation(line: 381, column: 23, scope: !1299)
!1313 = !DILocation(line: 381, column: 32, scope: !1299)
!1314 = !DILocation(line: 381, column: 17, scope: !1299)
!1315 = !DILocation(line: 381, column: 6, scope: !1299)
!1316 = !DILocation(line: 381, column: 21, scope: !1299)
!1317 = !DILocation(line: 382, column: 16, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1299, file: !2, line: 382, column: 10)
!1319 = !DILocation(line: 382, column: 21, scope: !1318)
!1320 = !DILocation(line: 382, column: 10, scope: !1318)
!1321 = !DILocation(line: 382, column: 28, scope: !1318)
!1322 = !DILocation(line: 382, column: 25, scope: !1318)
!1323 = !DILocation(line: 385, column: 27, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1318, file: !2, line: 383, column: 6)
!1325 = !DILocation(line: 385, column: 32, scope: !1324)
!1326 = !DILocation(line: 385, column: 17, scope: !1324)
!1327 = !DILocation(line: 385, column: 36, scope: !1324)
!1328 = !DILocation(line: 385, column: 15, scope: !1324)
!1329 = !DILocation(line: 386, column: 7, scope: !1324)
!1330 = !DILocation(line: 388, column: 5, scope: !1299)
!1331 = !DILocation(line: 389, column: 4, scope: !1233)
!1332 = !DILocation(line: 346, column: 130, scope: !1221)
!1333 = !DILabel(scope: !1211, name: "dont_add", file: !2, line: 390)
!1334 = !DILocation(line: 390, column: 1, scope: !1211)
!1335 = !DILocation(line: 391, column: 3, scope: !1211)
!1336 = !DILocation(line: 338, column: 61, scope: !1207)
!1337 = !DILocation(line: 338, column: 3, scope: !1207)
!1338 = distinct !{!1338, !1209, !1339, !262}
!1339 = !DILocation(line: 391, column: 3, scope: !1204)
!1340 = !DILocation(line: 393, column: 7, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 393, column: 7)
!1342 = !DILocation(line: 393, column: 16, scope: !1341)
!1343 = !DILocation(line: 393, column: 13, scope: !1341)
!1344 = !DILocation(line: 396, column: 8, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1346, file: !2, line: 396, column: 8)
!1346 = distinct !DILexicalBlock(scope: !1341, file: !2, line: 394, column: 3)
!1347 = !DILocation(line: 396, column: 14, scope: !1345)
!1348 = !DILocation(line: 397, column: 15, scope: !1345)
!1349 = !DILocation(line: 398, column: 8, scope: !1345)
!1350 = !DILocation(line: 398, column: 34, scope: !1345)
!1351 = !DILocation(line: 398, column: 5, scope: !1345)
!1352 = !DILocation(line: 399, column: 8, scope: !1345)
!1353 = !DILocation(line: 399, column: 34, scope: !1345)
!1354 = !DILocation(line: 399, column: 5, scope: !1345)
!1355 = !DILocation(line: 400, column: 8, scope: !1345)
!1356 = !DILocation(line: 400, column: 34, scope: !1345)
!1357 = !DILocation(line: 400, column: 5, scope: !1345)
!1358 = !DILocation(line: 397, column: 13, scope: !1345)
!1359 = !DILocation(line: 397, column: 5, scope: !1345)
!1360 = !DILocation(line: 402, column: 25, scope: !1345)
!1361 = !DILocation(line: 402, column: 31, scope: !1345)
!1362 = !DILocation(line: 402, column: 15, scope: !1345)
!1363 = !DILocation(line: 402, column: 36, scope: !1345)
!1364 = !DILocation(line: 402, column: 13, scope: !1345)
!1365 = !DILocation(line: 403, column: 4, scope: !1346)
!1366 = !DILocation(line: 406, column: 23, scope: !1155)
!1367 = !DILocation(line: 406, column: 13, scope: !1155)
!1368 = !DILocation(line: 406, column: 30, scope: !1155)
!1369 = !DILocation(line: 406, column: 11, scope: !1155)
!1370 = !DILocation(line: 407, column: 21, scope: !1155)
!1371 = !DILocation(line: 407, column: 15, scope: !1155)
!1372 = !DILocation(line: 407, column: 13, scope: !1155)
!1373 = !DILocation(line: 408, column: 8, scope: !1155)
!1374 = !DILocation(line: 408, column: 3, scope: !1155)
!1375 = !DILabel(scope: !1155, name: "cpp_done1", file: !2, line: 410)
!1376 = !DILocation(line: 410, column: 1, scope: !1155)
!1377 = distinct !{!1377, !1150, !1378, !262}
!1378 = !DILocation(line: 411, column: 2, scope: !1027)
!1379 = !DILocation(line: 416, column: 7, scope: !1027)
!1380 = !DILocalVariable(name: "checkval", scope: !1027, file: !2, line: 415, type: !63)
!1381 = !DILocation(line: 415, column: 6, scope: !1027)
!1382 = !DILocation(line: 417, column: 6, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 417, column: 6)
!1384 = !DILocation(line: 417, column: 12, scope: !1383)
!1385 = !DILocation(line: 418, column: 14, scope: !1383)
!1386 = !DILocation(line: 419, column: 6, scope: !1383)
!1387 = !DILocation(line: 419, column: 32, scope: !1383)
!1388 = !DILocation(line: 419, column: 3, scope: !1383)
!1389 = !DILocation(line: 420, column: 6, scope: !1383)
!1390 = !DILocation(line: 420, column: 32, scope: !1383)
!1391 = !DILocation(line: 420, column: 3, scope: !1383)
!1392 = !DILocation(line: 421, column: 6, scope: !1383)
!1393 = !DILocation(line: 421, column: 32, scope: !1383)
!1394 = !DILocation(line: 421, column: 3, scope: !1383)
!1395 = !DILocation(line: 418, column: 12, scope: !1383)
!1396 = !DILocation(line: 418, column: 3, scope: !1383)
!1397 = !DILocation(line: 423, column: 24, scope: !1383)
!1398 = !DILocation(line: 423, column: 14, scope: !1383)
!1399 = !DILocation(line: 423, column: 31, scope: !1383)
!1400 = !DILocation(line: 423, column: 12, scope: !1383)
!1401 = !DILocation(line: 425, column: 2, scope: !1027)
!1402 = !DILocation(line: 425, column: 9, scope: !1027)
!1403 = !DILocation(line: 425, column: 21, scope: !1027)
!1404 = !DILocation(line: 425, column: 18, scope: !1027)
!1405 = !DILocation(line: 427, column: 7, scope: !1406)
!1406 = distinct !DILexicalBlock(scope: !1407, file: !2, line: 427, column: 7)
!1407 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 426, column: 2)
!1408 = !DILocation(line: 427, column: 13, scope: !1406)
!1409 = !DILocation(line: 432, column: 18, scope: !1410)
!1410 = distinct !DILexicalBlock(scope: !1406, file: !2, line: 428, column: 3)
!1411 = !DILocation(line: 432, column: 5, scope: !1410)
!1412 = !DILocation(line: 432, column: 16, scope: !1410)
!1413 = !DILocation(line: 433, column: 4, scope: !1410)
!1414 = !DILocation(line: 436, column: 8, scope: !1407)
!1415 = !DILocation(line: 437, column: 24, scope: !1407)
!1416 = !DILocation(line: 437, column: 14, scope: !1407)
!1417 = !DILocation(line: 437, column: 31, scope: !1407)
!1418 = !DILocation(line: 437, column: 12, scope: !1407)
!1419 = distinct !{!1419, !1401, !1420, !262}
!1420 = !DILocation(line: 438, column: 2, scope: !1027)
!1421 = !DILocation(line: 445, column: 2, scope: !1027)
!1422 = !DILocation(line: 445, column: 9, scope: !1027)
!1423 = !DILocation(line: 445, column: 15, scope: !1027)
!1424 = !DILocalVariable(name: "parent_seg", scope: !1425, file: !2, line: 446, type: !63)
!1425 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 445, column: 21)
!1426 = !DILocation(line: 446, column: 7, scope: !1425)
!1427 = !DILocalVariable(name: "this_seg", scope: !1425, file: !2, line: 446, type: !63)
!1428 = !DILocation(line: 446, column: 19, scope: !1425)
!1429 = !DILocation(line: 448, column: 24, scope: !1425)
!1430 = !DILocation(line: 448, column: 14, scope: !1425)
!1431 = !DILocation(line: 448, column: 31, scope: !1425)
!1432 = !DILocation(line: 448, column: 12, scope: !1425)
!1433 = !DILocation(line: 449, column: 26, scope: !1425)
!1434 = !DILocation(line: 449, column: 16, scope: !1425)
!1435 = !DILocation(line: 449, column: 33, scope: !1425)
!1436 = !DILocation(line: 449, column: 14, scope: !1425)
!1437 = !DILocation(line: 450, column: 3, scope: !1425)
!1438 = !DILocation(line: 0, scope: !1425)
!1439 = !DILocation(line: 451, column: 19, scope: !1425)
!1440 = !DILocation(line: 451, column: 3, scope: !1425)
!1441 = !DILocation(line: 451, column: 10, scope: !1425)
!1442 = !DILocation(line: 451, column: 17, scope: !1425)
!1443 = !DILocation(line: 453, column: 27, scope: !1425)
!1444 = !DILocation(line: 453, column: 34, scope: !1425)
!1445 = !DILocation(line: 453, column: 50, scope: !1425)
!1446 = !DILocation(line: 453, column: 41, scope: !1425)
!1447 = !DILocation(line: 453, column: 3, scope: !1425)
!1448 = !DILocation(line: 454, column: 8, scope: !1425)
!1449 = !DILocation(line: 455, column: 15, scope: !1425)
!1450 = !DILocation(line: 460, column: 7, scope: !1451)
!1451 = distinct !DILexicalBlock(scope: !1425, file: !2, line: 460, column: 7)
!1452 = !DILocation(line: 460, column: 21, scope: !1451)
!1453 = !DILocation(line: 460, column: 18, scope: !1451)
!1454 = !DILocation(line: 461, column: 4, scope: !1451)
!1455 = !DILocation(line: 463, column: 3, scope: !1425)
!1456 = !DILocation(line: 465, column: 9, scope: !1457)
!1457 = distinct !DILexicalBlock(scope: !1425, file: !2, line: 464, column: 3)
!1458 = !DILocation(line: 466, column: 8, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !1457, file: !2, line: 466, column: 8)
!1460 = !DILocation(line: 466, column: 14, scope: !1459)
!1461 = !DILocation(line: 467, column: 5, scope: !1459)
!1462 = !DILocation(line: 469, column: 3, scope: !1457)
!1463 = !DILocation(line: 469, column: 22, scope: !1425)
!1464 = !DILocation(line: 469, column: 12, scope: !1425)
!1465 = !DILocation(line: 469, column: 29, scope: !1425)
!1466 = !DILocation(line: 469, column: 36, scope: !1425)
!1467 = !DILocation(line: 469, column: 33, scope: !1425)
!1468 = distinct !{!1468, !1455, !1469, !262}
!1469 = !DILocation(line: 469, column: 46, scope: !1425)
!1470 = distinct !{!1470, !1421, !1471, !262}
!1471 = !DILocation(line: 470, column: 2, scope: !1027)
!1472 = !DILocation(line: 472, column: 2, scope: !1027)
!1473 = !DILocation(line: 0, scope: !1027)
!1474 = !DILocation(line: 473, column: 18, scope: !1027)
!1475 = !DILocation(line: 473, column: 2, scope: !1027)
!1476 = !DILocation(line: 473, column: 9, scope: !1027)
!1477 = !DILocation(line: 473, column: 16, scope: !1027)
!1478 = !DILocation(line: 475, column: 26, scope: !1027)
!1479 = !DILocation(line: 475, column: 33, scope: !1027)
!1480 = !DILocation(line: 475, column: 49, scope: !1027)
!1481 = !DILocation(line: 475, column: 40, scope: !1027)
!1482 = !DILocation(line: 475, column: 2, scope: !1027)
!1483 = !DILocation(line: 476, column: 7, scope: !1027)
!1484 = !DILocation(line: 477, column: 14, scope: !1027)
!1485 = !DILocation(line: 484, column: 8, scope: !1486)
!1486 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 484, column: 2)
!1487 = !DILocation(line: 484, column: 7, scope: !1486)
!1488 = !DILocation(line: 484, column: 12, scope: !1489)
!1489 = distinct !DILexicalBlock(scope: !1486, file: !2, line: 484, column: 2)
!1490 = !DILocation(line: 484, column: 15, scope: !1489)
!1491 = !DILocation(line: 484, column: 27, scope: !1489)
!1492 = !DILocation(line: 484, column: 13, scope: !1489)
!1493 = !DILocation(line: 484, column: 2, scope: !1486)
!1494 = !DILocalVariable(name: "temp_point_seg", scope: !1495, file: !2, line: 485, type: !302)
!1495 = distinct !DILexicalBlock(scope: !1489, file: !2, line: 484, column: 36)
!1496 = !DILocation(line: 485, column: 14, scope: !1495)
!1497 = !DILocation(line: 485, column: 33, scope: !1495)
!1498 = !DILocation(line: 485, column: 50, scope: !1495)
!1499 = !DILocation(line: 485, column: 48, scope: !1495)
!1500 = !DILocation(line: 485, column: 31, scope: !1495)
!1501 = !DILocation(line: 486, column: 29, scope: !1495)
!1502 = !DILocation(line: 486, column: 46, scope: !1495)
!1503 = !DILocation(line: 486, column: 44, scope: !1495)
!1504 = !DILocation(line: 486, column: 61, scope: !1495)
!1505 = !DILocation(line: 486, column: 59, scope: !1495)
!1506 = !DILocation(line: 486, column: 63, scope: !1495)
!1507 = !DILocation(line: 486, column: 5, scope: !1495)
!1508 = !DILocation(line: 486, column: 22, scope: !1495)
!1509 = !DILocation(line: 486, column: 20, scope: !1495)
!1510 = !DILocation(line: 486, column: 25, scope: !1495)
!1511 = !DILocation(line: 487, column: 5, scope: !1495)
!1512 = !DILocation(line: 487, column: 22, scope: !1495)
!1513 = !DILocation(line: 487, column: 20, scope: !1495)
!1514 = !DILocation(line: 487, column: 37, scope: !1495)
!1515 = !DILocation(line: 487, column: 35, scope: !1495)
!1516 = !DILocation(line: 487, column: 39, scope: !1495)
!1517 = !DILocation(line: 487, column: 44, scope: !1495)
!1518 = !DILocation(line: 488, column: 2, scope: !1495)
!1519 = !DILocation(line: 484, column: 32, scope: !1489)
!1520 = !DILocation(line: 484, column: 2, scope: !1489)
!1521 = distinct !{!1521, !1493, !1522, !262}
!1522 = !DILocation(line: 488, column: 2, scope: !1486)
!1523 = !DILocation(line: 496, column: 6, scope: !1524)
!1524 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 496, column: 6)
!1525 = !DILocation(line: 497, column: 7, scope: !1526)
!1526 = distinct !DILexicalBlock(scope: !1527, file: !2, line: 497, column: 7)
!1527 = distinct !DILexicalBlock(scope: !1524, file: !2, line: 496, column: 19)
!1528 = !DILocation(line: 497, column: 13, scope: !1526)
!1529 = !DILocation(line: 497, column: 28, scope: !1526)
!1530 = !DILocation(line: 497, column: 26, scope: !1526)
!1531 = !DILocation(line: 497, column: 41, scope: !1526)
!1532 = !DILocation(line: 497, column: 45, scope: !1526)
!1533 = !DILocation(line: 501, column: 4, scope: !1534)
!1534 = distinct !DILexicalBlock(scope: !1526, file: !2, line: 497, column: 63)
!1535 = !DILocation(line: 502, column: 4, scope: !1534)
!1536 = !DILocation(line: 503, column: 18, scope: !1534)
!1537 = !DILocation(line: 503, column: 5, scope: !1534)
!1538 = !DILocation(line: 503, column: 16, scope: !1534)
!1539 = !DILocation(line: 504, column: 4, scope: !1534)
!1540 = !DILocation(line: 507, column: 25, scope: !1541)
!1541 = distinct !DILexicalBlock(scope: !1526, file: !2, line: 505, column: 10)
!1542 = !DILocation(line: 507, column: 4, scope: !1541)
!1543 = !DILocation(line: 510, column: 2, scope: !1527)
!1544 = !DILocation(line: 519, column: 6, scope: !1545)
!1545 = distinct !DILexicalBlock(scope: !1027, file: !2, line: 519, column: 6)
!1546 = !DILocation(line: 519, column: 12, scope: !1545)
!1547 = !DILocation(line: 519, column: 17, scope: !1545)
!1548 = !DILocation(line: 520, column: 18, scope: !1549)
!1549 = distinct !DILexicalBlock(scope: !1545, file: !2, line: 520, column: 7)
!1550 = !DILocation(line: 520, column: 24, scope: !1549)
!1551 = !DILocation(line: 520, column: 7, scope: !1549)
!1552 = !DILocation(line: 520, column: 28, scope: !1549)
!1553 = !DILocation(line: 521, column: 25, scope: !1549)
!1554 = !DILocation(line: 521, column: 56, scope: !1549)
!1555 = !DILocation(line: 521, column: 4, scope: !1549)
!1556 = !DILocation(line: 527, column: 16, scope: !1027)
!1557 = !DILocation(line: 527, column: 3, scope: !1027)
!1558 = !DILocation(line: 527, column: 14, scope: !1027)
!1559 = !DILocation(line: 528, column: 2, scope: !1027)
!1560 = !DILocation(line: 529, column: 1, scope: !1027)
!1561 = distinct !DISubprogram(name: "ai_reset_all_paths", linkageName: "_Z18ai_reset_all_pathsv", scope: !2, file: !2, line: 1590, type: !1562, scopeLine: 1591, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !242)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{null}
!1564 = !DILocalVariable(name: "i", scope: !1561, file: !2, line: 1592, type: !63)
!1565 = !DILocation(line: 1592, column: 6, scope: !1561)
!1566 = !DILocation(line: 1594, column: 8, scope: !1567)
!1567 = distinct !DILexicalBlock(scope: !1561, file: !2, line: 1594, column: 2)
!1568 = !DILocation(line: 1594, column: 7, scope: !1567)
!1569 = !DILocation(line: 1594, column: 12, scope: !1570)
!1570 = distinct !DILexicalBlock(scope: !1567, file: !2, line: 1594, column: 2)
!1571 = !DILocation(line: 1594, column: 15, scope: !1570)
!1572 = !DILocation(line: 1594, column: 13, scope: !1570)
!1573 = !DILocation(line: 1594, column: 2, scope: !1567)
!1574 = !DILocation(line: 1595, column: 15, scope: !1575)
!1575 = distinct !DILexicalBlock(scope: !1570, file: !2, line: 1595, column: 7)
!1576 = !DILocation(line: 1595, column: 7, scope: !1575)
!1577 = !DILocation(line: 1595, column: 18, scope: !1575)
!1578 = !DILocation(line: 1595, column: 31, scope: !1575)
!1579 = !DILocation(line: 1596, column: 12, scope: !1580)
!1580 = distinct !DILexicalBlock(scope: !1575, file: !2, line: 1595, column: 41)
!1581 = !DILocation(line: 1596, column: 4, scope: !1580)
!1582 = !DILocation(line: 1596, column: 15, scope: !1580)
!1583 = !DILocation(line: 1596, column: 29, scope: !1580)
!1584 = !DILocation(line: 1596, column: 40, scope: !1580)
!1585 = !DILocation(line: 1597, column: 12, scope: !1580)
!1586 = !DILocation(line: 1597, column: 4, scope: !1580)
!1587 = !DILocation(line: 1597, column: 15, scope: !1580)
!1588 = !DILocation(line: 1597, column: 29, scope: !1580)
!1589 = !DILocation(line: 1597, column: 41, scope: !1580)
!1590 = !DILocation(line: 1598, column: 3, scope: !1580)
!1591 = !DILocation(line: 1595, column: 34, scope: !1575)
!1592 = !DILocation(line: 1594, column: 38, scope: !1570)
!1593 = !DILocation(line: 1594, column: 2, scope: !1570)
!1594 = distinct !{!1594, !1573, !1595, !262}
!1595 = !DILocation(line: 1598, column: 3, scope: !1567)
!1596 = !DILocation(line: 1600, column: 2, scope: !1561)
!1597 = !DILocation(line: 1602, column: 1, scope: !1561)
!1598 = distinct !DISubprogram(name: "polish_path", linkageName: "_Z11polish_pathP6objectP9point_segi", scope: !2, file: !2, line: 543, type: !1599, scopeLine: 544, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !242)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!63, !526, !301, !63}
!1601 = !DILocalVariable(name: "objp", arg: 1, scope: !1598, file: !2, line: 543, type: !526)
!1602 = !DILocation(line: 543, column: 25, scope: !1598)
!1603 = !DILocalVariable(name: "psegs", arg: 2, scope: !1598, file: !2, line: 543, type: !301)
!1604 = !DILocation(line: 543, column: 42, scope: !1598)
!1605 = !DILocalVariable(name: "num_points", arg: 3, scope: !1598, file: !2, line: 543, type: !63)
!1606 = !DILocation(line: 543, column: 53, scope: !1598)
!1607 = !DILocalVariable(name: "i", scope: !1598, file: !2, line: 545, type: !63)
!1608 = !DILocation(line: 545, column: 6, scope: !1598)
!1609 = !DILocalVariable(name: "first_point", scope: !1598, file: !2, line: 545, type: !63)
!1610 = !DILocation(line: 545, column: 9, scope: !1598)
!1611 = !DILocation(line: 547, column: 6, scope: !1612)
!1612 = distinct !DILexicalBlock(scope: !1598, file: !2, line: 547, column: 6)
!1613 = !DILocation(line: 547, column: 17, scope: !1612)
!1614 = !DILocation(line: 548, column: 10, scope: !1612)
!1615 = !DILocation(line: 548, column: 3, scope: !1612)
!1616 = !DILocation(line: 551, column: 17, scope: !1617)
!1617 = distinct !DILexicalBlock(scope: !1598, file: !2, line: 551, column: 6)
!1618 = !DILocation(line: 551, column: 23, scope: !1617)
!1619 = !DILocation(line: 551, column: 6, scope: !1617)
!1620 = !DILocation(line: 551, column: 27, scope: !1617)
!1621 = !DILocation(line: 552, column: 7, scope: !1622)
!1622 = distinct !DILexicalBlock(scope: !1617, file: !2, line: 552, column: 7)
!1623 = !DILocation(line: 552, column: 21, scope: !1622)
!1624 = !DILocation(line: 552, column: 18, scope: !1622)
!1625 = !DILocation(line: 553, column: 11, scope: !1622)
!1626 = !DILocation(line: 553, column: 4, scope: !1622)
!1627 = !DILocation(line: 555, column: 35, scope: !1622)
!1628 = !DILocation(line: 555, column: 33, scope: !1622)
!1629 = !DILocation(line: 558, column: 8, scope: !1630)
!1630 = distinct !DILexicalBlock(scope: !1598, file: !2, line: 558, column: 2)
!1631 = !DILocation(line: 558, column: 7, scope: !1630)
!1632 = !DILocation(line: 558, column: 12, scope: !1633)
!1633 = distinct !DILexicalBlock(scope: !1630, file: !2, line: 558, column: 2)
!1634 = !DILocation(line: 558, column: 13, scope: !1633)
!1635 = !DILocation(line: 558, column: 2, scope: !1630)
!1636 = !DILocalVariable(name: "fq", scope: !1637, file: !2, line: 559, type: !858)
!1637 = distinct !DILexicalBlock(scope: !1633, file: !2, line: 558, column: 22)
!1638 = !DILocation(line: 559, column: 13, scope: !1637)
!1639 = !DILocalVariable(name: "hit_data", scope: !1637, file: !2, line: 560, type: !872)
!1640 = !DILocation(line: 560, column: 13, scope: !1637)
