; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/fuelcen.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/fuelcen.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.matcen_info = type { [2 x i32], i32, i32, i16, i16 }
%struct.FuelCenter = type { i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, %struct.vms_vector }
%struct.vms_vector = type { i32, i32, i32 }
%struct.segment2 = type { i8, i8, i8, i8, i32 }
%struct.segment = type { [6 x %struct.side], [6 x i16], [8 x i16], i32 }
%struct.side = type { i8, i8, i16, i16, i16, [4 x %struct.uvl], [2 x %struct.vms_vector] }
%struct.uvl = type { i32, i32, i32 }
%struct.object = type { i32, i8, i8, i16, i16, i8, i8, i8, i8, i16, i16, %struct.vms_vector, %struct.vms_matrix, i32, i32, %struct.vms_vector, i8, i8, i8, i8, i32, %union.anon, %union.anon.0, %union.anon.1 }
%struct.vms_matrix = type { %struct.vms_vector, %struct.vms_vector, %struct.vms_vector }
%union.anon = type { %struct.physics_info }
%struct.physics_info = type { %struct.vms_vector, %struct.vms_vector, i32, i32, i32, %struct.vms_vector, %struct.vms_vector, i16, i16 }
%union.anon.0 = type { %struct.ai_static }
%struct.ai_static = type { i8, [11 x i8], i16, i16, i16, i8, i8, i16, i32, i32 }
%union.anon.1 = type { %struct.polyobj_info }
%struct.polyobj_info = type { i32, [10 x %struct.vms_angvec], i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Fuelcen_refill_speed", scope: !2, file: !15, line: 54, type: !16, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !12, imports: !241, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "/Users/richard/code/ChocolateDescent/main_d2/fuelcen.cpp", directory: "/Users/richard/code/ChocolateDescent/build-c-ref", checksumkind: CSK_MD5, checksum: "4c0f18e2fb995ff70e76eccffc6280cd")
!4 = !{!5, !6, !9}
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !7, line: 30, baseType: !8)
!7 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!8 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !10, line: 30, baseType: !11)
!10 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!11 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!12 = !{!0, !13, !20, !22, !24, !42, !44, !70, !72, !113, !120, !125, !130, !135, !140, !142, !147, !152, !157, !162, !167, !172, !174, !176, !178, !183, !188, !193, !198, !203, !208, !214, !219, !224, !229, !234, !236, !238}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "Fuelcen_give_amount", scope: !2, file: !15, line: 55, type: !16, isLocal: false, isDefinition: true)
!15 = !DIFile(filename: "main_d2/fuelcen.cpp", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "4c0f18e2fb995ff70e76eccffc6280cd")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "fix", file: !17, line: 20, baseType: !18)
!17 = !DIFile(filename: "./fix/fix.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c5006a11bf8b4cb7d963898499eda13a")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !19, line: 30, baseType: !5)
!19 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "Fuelcen_max_amount", scope: !2, file: !15, line: 56, type: !16, isLocal: false, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "EnergyToCreateOneRobot", scope: !2, file: !15, line: 60, type: !16, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "RobotCenters", scope: !2, file: !15, line: 65, type: !26, isLocal: false, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 3200, elements: !40)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "matcen_info", file: !28, line: 117, baseType: !29)
!28 = !DIFile(filename: "main_d2/fuelcen.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "8ae6b7177fad5b3c733b361bc7aef356")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matcen_info", file: !28, line: 110, size: 160, flags: DIFlagTypePassByValue, elements: !30, identifier: "_ZTS11matcen_info")
!30 = !{!31, !35, !36, !37, !39}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "robot_flags", scope: !29, file: !28, line: 112, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 2)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "hit_points", scope: !29, file: !28, line: 113, baseType: !16, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !29, file: !28, line: 114, baseType: !16, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !29, file: !28, line: 115, baseType: !38, size: 16, offset: 128)
!38 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fuelcen_num", scope: !29, file: !28, line: 116, baseType: !38, size: 16, offset: 144)
!40 = !{!41}
!41 = !DISubrange(count: 20)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "Num_robot_centers", scope: !2, file: !15, line: 66, type: !5, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "Station", scope: !2, file: !15, line: 68, type: !46, isLocal: false, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 22400, elements: !68)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "FuelCenter", file: !28, line: 103, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FuelCenter", file: !28, line: 88, size: 320, flags: DIFlagTypePassByValue, elements: !49, identifier: "_ZTS10FuelCenter")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !48, file: !28, line: 90, baseType: !5, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !48, file: !28, line: 91, baseType: !5, size: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !48, file: !28, line: 92, baseType: !6, size: 8, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !48, file: !28, line: 93, baseType: !6, size: 8, offset: 72)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Lives", scope: !48, file: !28, line: 94, baseType: !6, size: 8, offset: 80)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dum1", scope: !48, file: !28, line: 95, baseType: !6, size: 8, offset: 88)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Capacity", scope: !48, file: !28, line: 96, baseType: !16, size: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MaxCapacity", scope: !48, file: !28, line: 97, baseType: !16, size: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Timer", scope: !48, file: !28, line: 98, baseType: !16, size: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Disable_time", scope: !48, file: !28, line: 99, baseType: !16, size: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !48, file: !28, line: 102, baseType: !61, size: 96, offset: 224)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_vector", file: !62, line: 22, baseType: !63)
!62 = !DIFile(filename: "./vecmat/vecmat.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "dfa84e3325c1ea4f5f74699fff5ef2bf")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_vector", file: !62, line: 19, size: 96, flags: DIFlagTypePassByValue, elements: !64, identifier: "_ZTS10vms_vector")
!64 = !{!65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !63, file: !62, line: 21, baseType: !16, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !63, file: !62, line: 21, baseType: !16, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !63, file: !62, line: 21, baseType: !16, size: 32, offset: 64)
!68 = !{!69}
!69 = !DISubrange(count: 70)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "Num_fuelcenters", scope: !2, file: !15, line: 69, type: !5, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "PlayerSegment", scope: !2, file: !15, line: 71, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "segment", file: !76, line: 123, baseType: !77)
!76 = !DIFile(filename: "main_d2/segment.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c950815a9b07e6bab2fa2587b90affec")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "segment", file: !76, line: 100, size: 4096, flags: DIFlagTypePassByValue, elements: !78, identifier: "_ZTS7segment")
!78 = !{!79, !106, !108, !112}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sides", scope: !77, file: !76, line: 105, baseType: !80, size: 3840)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 3840, elements: !104)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "side", file: !76, line: 91, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "side", file: !76, line: 82, size: 640, flags: DIFlagTypePassByValue, elements: !83, identifier: "_ZTS4side")
!83 = !{!84, !85, !89, !90, !91, !92, !102}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !76, line: 84, baseType: !6, size: 8)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !82, file: !76, line: 85, baseType: !86, size: 8, offset: 8)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !87, line: 31, baseType: !88)
!87 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!88 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "wall_num", scope: !82, file: !76, line: 86, baseType: !38, size: 16, offset: 16)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_num", scope: !82, file: !76, line: 87, baseType: !38, size: 16, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_num2", scope: !82, file: !76, line: 88, baseType: !38, size: 16, offset: 48)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "uvls", scope: !82, file: !76, line: 89, baseType: !93, size: 384, offset: 64)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 384, elements: !100)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uvl", file: !76, line: 67, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uvl", file: !76, line: 64, size: 96, flags: DIFlagTypePassByValue, elements: !96, identifier: "_ZTS3uvl")
!96 = !{!97, !98, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !95, file: !76, line: 66, baseType: !16, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !95, file: !76, line: 66, baseType: !16, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !95, file: !76, line: 66, baseType: !16, size: 32, offset: 64)
!100 = !{!101}
!101 = !DISubrange(count: 4)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "normals", scope: !82, file: !76, line: 90, baseType: !103, size: 192, offset: 448)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 192, elements: !33)
!104 = !{!105}
!105 = !DISubrange(count: 6)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !77, file: !76, line: 106, baseType: !107, size: 96, offset: 3840)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 96, elements: !104)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !77, file: !76, line: 107, baseType: !109, size: 128, offset: 3936)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 8)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !77, file: !76, line: 112, baseType: !5, size: 32, offset: 4064)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !15, line: 185, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 304, elements: !118)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!118 = !{!119}
!119 = !DISubrange(count: 38)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !15, line: 188, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 16)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !15, line: 188, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 456, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 57)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !15, line: 191, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 280, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 35)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !15, line: 192, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 168, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 21)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !15, line: 223, type: !115, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !15, line: 284, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 224, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 28)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !15, line: 286, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 320, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 40)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !15, line: 287, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 288, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 36)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !15, line: 288, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 584, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 73)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !15, line: 317, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 336, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 42)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !15, line: 388, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 352, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 44)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "Num_extry_robots", scope: !2, file: !15, line: 420, type: !5, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "FrameCount_last_msg", scope: !2, file: !15, line: 423, type: !5, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !15, line: 444, type: !127, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !15, line: 473, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 248, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 31)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !15, line: 488, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 272, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 34)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !15, line: 531, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 448, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 56)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !15, line: 544, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 312, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 39)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !15, line: 616, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 392, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 49)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !15, line: 636, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 496, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 62)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "last_play_time", scope: !210, file: !15, line: 702, type: !16, isLocal: true, isDefinition: true)
!210 = distinct !DISubprogram(name: "fuelcen_give_fuel", linkageName: "_Z17fuelcen_give_fuelP7segmenti", scope: !15, file: !15, line: 698, type: !211, scopeLine: 699, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{!16, !74, !16}
!213 = !{}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !15, line: 704, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 104, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 13)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1123, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 184, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 23)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1134, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 240, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 30)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1135, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 408, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 51)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1147, type: !221, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1181, type: !137, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!239 = distinct !DIGlobalVariable(name: "FRACBITS", scope: !2, file: !17, line: 18, type: !240, isLocal: true, isDefinition: true)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!241 = !{!242, !246, !249, !250, !251, !252, !256, !260, !264, !267, !269, !271, !273, !275, !277, !279, !281, !283, !285, !287, !289, !291, !293, !295, !297, !303, !307, !310, !313, !322, !324, !326, !328}
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !6, file: !245, line: 158)
!243 = !DINamespace(name: "__1", scope: !244, exportSymbols: true)
!244 = !DINamespace(name: "std", scope: null)
!245 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdint", directory: "")
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !247, file: !245, line: 159)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !248, line: 30, baseType: !38)
!248 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !18, file: !245, line: 160)
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !9, file: !245, line: 161)
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !86, file: !245, line: 163)
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !253, file: !245, line: 164)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !254, line: 31, baseType: !255)
!254 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!255 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !257, file: !245, line: 165)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !258, line: 31, baseType: !259)
!258 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!259 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !261, file: !245, line: 166)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !262, line: 31, baseType: !263)
!262 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!263 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !265, file: !245, line: 168)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !266, line: 29, baseType: !6)
!266 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !268, file: !245, line: 169)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !266, line: 30, baseType: !247)
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !270, file: !245, line: 170)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !266, line: 31, baseType: !18)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !272, file: !245, line: 171)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !266, line: 32, baseType: !9)
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !274, file: !245, line: 173)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !266, line: 33, baseType: !86)
!275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !276, file: !245, line: 174)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !266, line: 34, baseType: !253)
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !278, file: !245, line: 175)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !266, line: 35, baseType: !257)
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !280, file: !245, line: 176)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !266, line: 36, baseType: !261)
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !282, file: !245, line: 178)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !266, line: 40, baseType: !6)
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !284, file: !245, line: 179)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !266, line: 41, baseType: !247)
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !286, file: !245, line: 180)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !266, line: 42, baseType: !18)
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !288, file: !245, line: 181)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !266, line: 43, baseType: !9)
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !290, file: !245, line: 183)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !266, line: 44, baseType: !86)
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !292, file: !245, line: 184)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !266, line: 45, baseType: !253)
!293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !294, file: !245, line: 185)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !266, line: 46, baseType: !257)
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !296, file: !245, line: 186)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !266, line: 47, baseType: !261)
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !298, file: !245, line: 188)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !299, line: 32, baseType: !300)
!299 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !301, line: 40, baseType: !302)
!301 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!302 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !304, file: !245, line: 189)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !305, line: 34, baseType: !306)
!305 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!306 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !308, file: !245, line: 191)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !309, line: 32, baseType: !302)
!309 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !311, file: !245, line: 192)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !312, line: 32, baseType: !306)
!312 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !314, file: !321, line: 422)
!314 = !DISubprogram(name: "isfinite", linkageName: "_ZNSt3__16__math8isfiniteB8ne200100Ee", scope: !316, file: !315, line: 79, type: !317, flags: DIFlagPrototyped, spFlags: 0)
!315 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__math/traits.h", directory: "")
!316 = !DINamespace(name: "__math", scope: !243)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !320}
!319 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!320 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!321 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/math.h", directory: "")
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !323, file: !321, line: 425)
!323 = !DISubprogram(name: "isinf", linkageName: "_ZNSt3__16__math5isinfB8ne200100Ee", scope: !316, file: !315, line: 103, type: !317, flags: DIFlagPrototyped, spFlags: 0)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !325, file: !321, line: 429)
!325 = !DISubprogram(name: "isnan", linkageName: "_ZNSt3__16__math5isnanB8ne200100Ee", scope: !316, file: !315, line: 127, type: !317, flags: DIFlagPrototyped, spFlags: 0)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !327, file: !321, line: 430)
!327 = !DISubprogram(name: "isnormal", linkageName: "_ZNSt3__16__math8isnormalB8ne200100Ee", scope: !316, file: !315, line: 146, type: !317, flags: DIFlagPrototyped, spFlags: 0)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !329, file: !321, line: 485)
!329 = !DISubprogram(name: "modf", linkageName: "_ZNSt3__16__math4modfB8ne200100EePe", scope: !316, file: !330, line: 55, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!330 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__math/modulo.h", directory: "")
!331 = !DISubroutineType(types: !332)
!332 = !{!320, !320, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!334 = !{i32 2, !"SDK Version", [2 x i32] [i32 15, i32 4]}
!335 = !{i32 7, !"Dwarf Version", i32 5}
!336 = !{i32 2, !"Debug Info Version", i32 3}
!337 = !{i32 1, !"wchar_size", i32 4}
!338 = !{i32 8, !"PIC Level", i32 2}
!339 = !{i32 7, !"uwtable", i32 1}
!340 = !{i32 7, !"frame-pointer", i32 1}
!341 = !{!"Homebrew clang version 20.1.8"}
!342 = distinct !DISubprogram(name: "fuelcen_reset", linkageName: "_Z13fuelcen_resetv", scope: !15, file: !15, line: 87, type: !343, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!343 = !DISubroutineType(types: !344)
!344 = !{null}
!345 = !DILocalVariable(name: "i", scope: !342, file: !15, line: 89, type: !5)
!346 = !DILocation(line: 89, column: 6, scope: !342)
!347 = !DILocation(line: 91, column: 18, scope: !342)
!348 = !DILocation(line: 94, column: 9, scope: !349)
!349 = distinct !DILexicalBlock(scope: !342, file: !15, line: 94, column: 2)
!350 = !DILocation(line: 94, column: 7, scope: !349)
!351 = !DILocation(line: 94, column: 14, scope: !352)
!352 = distinct !DILexicalBlock(scope: !349, file: !15, line: 94, column: 2)
!353 = !DILocation(line: 94, column: 16, scope: !352)
!354 = !DILocation(line: 94, column: 2, scope: !349)
!355 = !DILocation(line: 95, column: 13, scope: !352)
!356 = !DILocation(line: 95, column: 3, scope: !352)
!357 = !DILocation(line: 95, column: 16, scope: !352)
!358 = !DILocation(line: 95, column: 24, scope: !352)
!359 = !DILocation(line: 94, column: 33, scope: !352)
!360 = !DILocation(line: 94, column: 2, scope: !352)
!361 = distinct !{!361, !354, !362, !363}
!362 = !DILocation(line: 95, column: 26, scope: !349)
!363 = !{!"llvm.loop.mustprogress"}
!364 = !DILocation(line: 97, column: 20, scope: !342)
!365 = !DILocation(line: 99, column: 1, scope: !342)
!366 = distinct !DISubprogram(name: "reset_all_robot_centers", linkageName: "_Z23reset_all_robot_centersv", scope: !15, file: !15, line: 102, type: !343, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!367 = !DILocalVariable(name: "i", scope: !366, file: !15, line: 104, type: !5)
!368 = !DILocation(line: 104, column: 6, scope: !366)
!369 = !DILocation(line: 107, column: 9, scope: !370)
!370 = distinct !DILexicalBlock(scope: !366, file: !15, line: 107, column: 2)
!371 = !DILocation(line: 107, column: 7, scope: !370)
!372 = !DILocation(line: 107, column: 14, scope: !373)
!373 = distinct !DILexicalBlock(scope: !370, file: !15, line: 107, column: 2)
!374 = !DILocation(line: 107, column: 18, scope: !373)
!375 = !DILocation(line: 107, column: 16, scope: !373)
!376 = !DILocation(line: 107, column: 2, scope: !370)
!377 = !DILocation(line: 108, column: 17, scope: !378)
!378 = distinct !DILexicalBlock(scope: !373, file: !15, line: 108, column: 7)
!379 = !DILocation(line: 108, column: 7, scope: !378)
!380 = !DILocation(line: 108, column: 20, scope: !378)
!381 = !DILocation(line: 108, column: 28, scope: !378)
!382 = !DILocation(line: 109, column: 14, scope: !383)
!383 = distinct !DILexicalBlock(scope: !378, file: !15, line: 108, column: 54)
!384 = !DILocation(line: 109, column: 4, scope: !383)
!385 = !DILocation(line: 109, column: 17, scope: !383)
!386 = !DILocation(line: 109, column: 25, scope: !383)
!387 = !DILocation(line: 110, column: 14, scope: !383)
!388 = !DILocation(line: 110, column: 4, scope: !383)
!389 = !DILocation(line: 110, column: 17, scope: !383)
!390 = !DILocation(line: 110, column: 28, scope: !383)
!391 = !DILocation(line: 111, column: 3, scope: !383)
!392 = !DILocation(line: 108, column: 31, scope: !378)
!393 = !DILocation(line: 107, column: 33, scope: !373)
!394 = !DILocation(line: 107, column: 2, scope: !373)
!395 = distinct !{!395, !376, !396, !363}
!396 = !DILocation(line: 111, column: 3, scope: !370)
!397 = !DILocation(line: 112, column: 1, scope: !366)
!398 = distinct !DISubprogram(name: "fuelcen_create", linkageName: "_Z14fuelcen_createP7segment", scope: !15, file: !15, line: 117, type: !399, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !74}
!401 = !DILocalVariable(name: "segp", arg: 1, scope: !398, file: !15, line: 117, type: !74)
!402 = !DILocation(line: 117, column: 30, scope: !398)
!403 = !DILocalVariable(name: "segnum", scope: !398, file: !15, line: 119, type: !5)
!404 = !DILocation(line: 119, column: 6, scope: !398)
!405 = !DILocation(line: 119, column: 21, scope: !398)
!406 = !DILocation(line: 119, column: 26, scope: !398)
!407 = !DILocation(line: 119, column: 20, scope: !398)
!408 = !DILocalVariable(name: "seg2p", scope: !398, file: !15, line: 168, type: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "segment2", file: !76, line: 137, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "segment2", file: !76, line: 130, size: 64, flags: DIFlagTypePassByValue, elements: !412, identifier: "_ZTS8segment2")
!412 = !{!413, !414, !415, !416, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "special", scope: !411, file: !76, line: 132, baseType: !86, size: 8)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "matcen_num", scope: !411, file: !76, line: 133, baseType: !6, size: 8, offset: 8)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !411, file: !76, line: 134, baseType: !6, size: 8, offset: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "s2_flags", scope: !411, file: !76, line: 135, baseType: !86, size: 8, offset: 24)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "static_light", scope: !411, file: !76, line: 136, baseType: !16, size: 32, offset: 32)
!418 = !DILocation(line: 168, column: 12, scope: !398)
!419 = !DILocation(line: 168, column: 31, scope: !398)
!420 = !DILocation(line: 168, column: 21, scope: !398)
!421 = !DILocalVariable(name: "station_type", scope: !398, file: !15, line: 170, type: !5)
!422 = !DILocation(line: 170, column: 6, scope: !398)
!423 = !DILocation(line: 172, column: 17, scope: !398)
!424 = !DILocation(line: 172, column: 24, scope: !398)
!425 = !DILocation(line: 172, column: 15, scope: !398)
!426 = !DILocation(line: 174, column: 10, scope: !398)
!427 = !DILocation(line: 174, column: 2, scope: !398)
!428 = !DILocation(line: 178, column: 3, scope: !429)
!429 = distinct !DILexicalBlock(scope: !398, file: !15, line: 174, column: 24)
!430 = !DILocation(line: 183, column: 3, scope: !429)
!431 = !DILocation(line: 185, column: 51, scope: !429)
!432 = !DILocation(line: 185, column: 3, scope: !429)
!433 = !DILocation(line: 186, column: 2, scope: !429)
!434 = !DILocation(line: 188, column: 2, scope: !398)
!435 = !DILocation(line: 189, column: 6, scope: !436)
!436 = distinct !DILexicalBlock(scope: !398, file: !15, line: 189, column: 6)
!437 = !DILocation(line: 189, column: 12, scope: !436)
!438 = !DILocation(line: 189, column: 21, scope: !436)
!439 = !DILocation(line: 191, column: 2, scope: !398)
!440 = !DILocation(line: 192, column: 2, scope: !398)
!441 = !DILocation(line: 194, column: 17, scope: !398)
!442 = !DILocation(line: 194, column: 2, scope: !398)
!443 = !DILocation(line: 194, column: 9, scope: !398)
!444 = !DILocation(line: 194, column: 15, scope: !398)
!445 = !DILocation(line: 195, column: 34, scope: !398)
!446 = !DILocation(line: 195, column: 10, scope: !398)
!447 = !DILocation(line: 195, column: 2, scope: !398)
!448 = !DILocation(line: 195, column: 27, scope: !398)
!449 = !DILocation(line: 195, column: 32, scope: !398)
!450 = !DILocation(line: 196, column: 41, scope: !398)
!451 = !DILocation(line: 196, column: 10, scope: !398)
!452 = !DILocation(line: 196, column: 2, scope: !398)
!453 = !DILocation(line: 196, column: 27, scope: !398)
!454 = !DILocation(line: 196, column: 39, scope: !398)
!455 = !DILocation(line: 197, column: 46, scope: !398)
!456 = !DILocation(line: 197, column: 38, scope: !398)
!457 = !DILocation(line: 197, column: 63, scope: !398)
!458 = !DILocation(line: 197, column: 10, scope: !398)
!459 = !DILocation(line: 197, column: 2, scope: !398)
!460 = !DILocation(line: 197, column: 27, scope: !398)
!461 = !DILocation(line: 197, column: 36, scope: !398)
!462 = !DILocation(line: 198, column: 36, scope: !398)
!463 = !DILocation(line: 198, column: 42, scope: !398)
!464 = !DILocation(line: 198, column: 10, scope: !398)
!465 = !DILocation(line: 198, column: 2, scope: !398)
!466 = !DILocation(line: 198, column: 27, scope: !398)
!467 = !DILocation(line: 198, column: 34, scope: !398)
!468 = !DILocation(line: 199, column: 10, scope: !398)
!469 = !DILocation(line: 199, column: 2, scope: !398)
!470 = !DILocation(line: 199, column: 27, scope: !398)
!471 = !DILocation(line: 199, column: 33, scope: !398)
!472 = !DILocation(line: 200, column: 10, scope: !398)
!473 = !DILocation(line: 200, column: 2, scope: !398)
!474 = !DILocation(line: 200, column: 27, scope: !398)
!475 = !DILocation(line: 200, column: 32, scope: !398)
!476 = !DILocation(line: 204, column: 34, scope: !398)
!477 = !DILocation(line: 204, column: 26, scope: !398)
!478 = !DILocation(line: 204, column: 51, scope: !398)
!479 = !DILocation(line: 204, column: 59, scope: !398)
!480 = !DILocation(line: 204, column: 2, scope: !398)
!481 = !DILocation(line: 210, column: 17, scope: !398)
!482 = !DILocation(line: 211, column: 1, scope: !398)
!483 = distinct !DISubprogram(name: "matcen_create", linkageName: "_Z13matcen_createP7segment", scope: !15, file: !15, line: 216, type: !399, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!484 = !DILocalVariable(name: "segp", arg: 1, scope: !483, file: !15, line: 216, type: !74)
!485 = !DILocation(line: 216, column: 29, scope: !483)
!486 = !DILocalVariable(name: "seg2p", scope: !483, file: !15, line: 218, type: !409)
!487 = !DILocation(line: 218, column: 12, scope: !483)
!488 = !DILocation(line: 218, column: 31, scope: !483)
!489 = !DILocation(line: 218, column: 36, scope: !483)
!490 = !DILocation(line: 218, column: 21, scope: !483)
!491 = !DILocalVariable(name: "station_type", scope: !483, file: !15, line: 220, type: !5)
!492 = !DILocation(line: 220, column: 6, scope: !483)
!493 = !DILocation(line: 220, column: 21, scope: !483)
!494 = !DILocation(line: 220, column: 28, scope: !483)
!495 = !DILocation(line: 222, column: 2, scope: !483)
!496 = !DILocation(line: 223, column: 2, scope: !483)
!497 = !DILocation(line: 224, column: 6, scope: !498)
!498 = distinct !DILexicalBlock(scope: !483, file: !15, line: 224, column: 6)
!499 = !DILocation(line: 224, column: 12, scope: !498)
!500 = !DILocation(line: 224, column: 21, scope: !498)
!501 = !DILocation(line: 226, column: 2, scope: !483)
!502 = !DILocation(line: 227, column: 2, scope: !483)
!503 = !DILocation(line: 229, column: 17, scope: !483)
!504 = !DILocation(line: 229, column: 2, scope: !483)
!505 = !DILocation(line: 229, column: 9, scope: !483)
!506 = !DILocation(line: 229, column: 15, scope: !483)
!507 = !DILocation(line: 230, column: 34, scope: !483)
!508 = !DILocation(line: 230, column: 10, scope: !483)
!509 = !DILocation(line: 230, column: 2, scope: !483)
!510 = !DILocation(line: 230, column: 27, scope: !483)
!511 = !DILocation(line: 230, column: 32, scope: !483)
!512 = !DILocation(line: 231, column: 42, scope: !483)
!513 = !DILocation(line: 231, column: 59, scope: !483)
!514 = !DILocation(line: 231, column: 38, scope: !483)
!515 = !DILocation(line: 231, column: 10, scope: !483)
!516 = !DILocation(line: 231, column: 2, scope: !483)
!517 = !DILocation(line: 231, column: 27, scope: !483)
!518 = !DILocation(line: 231, column: 36, scope: !483)
!519 = !DILocation(line: 232, column: 49, scope: !483)
!520 = !DILocation(line: 232, column: 41, scope: !483)
!521 = !DILocation(line: 232, column: 66, scope: !483)
!522 = !DILocation(line: 232, column: 10, scope: !483)
!523 = !DILocation(line: 232, column: 2, scope: !483)
!524 = !DILocation(line: 232, column: 27, scope: !483)
!525 = !DILocation(line: 232, column: 39, scope: !483)
!526 = !DILocation(line: 234, column: 36, scope: !483)
!527 = !DILocation(line: 234, column: 42, scope: !483)
!528 = !DILocation(line: 234, column: 10, scope: !483)
!529 = !DILocation(line: 234, column: 2, scope: !483)
!530 = !DILocation(line: 234, column: 27, scope: !483)
!531 = !DILocation(line: 234, column: 34, scope: !483)
!532 = !DILocation(line: 235, column: 10, scope: !483)
!533 = !DILocation(line: 235, column: 2, scope: !483)
!534 = !DILocation(line: 235, column: 27, scope: !483)
!535 = !DILocation(line: 235, column: 33, scope: !483)
!536 = !DILocation(line: 236, column: 10, scope: !483)
!537 = !DILocation(line: 236, column: 2, scope: !483)
!538 = !DILocation(line: 236, column: 27, scope: !483)
!539 = !DILocation(line: 236, column: 32, scope: !483)
!540 = !DILocation(line: 240, column: 34, scope: !483)
!541 = !DILocation(line: 240, column: 26, scope: !483)
!542 = !DILocation(line: 240, column: 51, scope: !483)
!543 = !DILocation(line: 240, column: 69, scope: !483)
!544 = !DILocation(line: 240, column: 75, scope: !483)
!545 = !DILocation(line: 240, column: 60, scope: !483)
!546 = !DILocation(line: 240, column: 2, scope: !483)
!547 = !DILocation(line: 242, column: 22, scope: !483)
!548 = !DILocation(line: 242, column: 2, scope: !483)
!549 = !DILocation(line: 242, column: 9, scope: !483)
!550 = !DILocation(line: 242, column: 20, scope: !483)
!551 = !DILocation(line: 243, column: 19, scope: !483)
!552 = !DILocation(line: 245, column: 15, scope: !483)
!553 = !DILocation(line: 245, column: 22, scope: !483)
!554 = !DILocation(line: 245, column: 2, scope: !483)
!555 = !DILocation(line: 245, column: 34, scope: !483)
!556 = !DILocation(line: 245, column: 45, scope: !483)
!557 = !DILocation(line: 246, column: 15, scope: !483)
!558 = !DILocation(line: 246, column: 22, scope: !483)
!559 = !DILocation(line: 246, column: 2, scope: !483)
!560 = !DILocation(line: 246, column: 34, scope: !483)
!561 = !DILocation(line: 246, column: 43, scope: !483)
!562 = !DILocation(line: 247, column: 43, scope: !483)
!563 = !DILocation(line: 247, column: 49, scope: !483)
!564 = !DILocation(line: 247, column: 15, scope: !483)
!565 = !DILocation(line: 247, column: 22, scope: !483)
!566 = !DILocation(line: 247, column: 2, scope: !483)
!567 = !DILocation(line: 247, column: 34, scope: !483)
!568 = !DILocation(line: 247, column: 41, scope: !483)
!569 = !DILocation(line: 248, column: 48, scope: !483)
!570 = !DILocation(line: 248, column: 15, scope: !483)
!571 = !DILocation(line: 248, column: 22, scope: !483)
!572 = !DILocation(line: 248, column: 2, scope: !483)
!573 = !DILocation(line: 248, column: 34, scope: !483)
!574 = !DILocation(line: 248, column: 46, scope: !483)
!575 = !DILocation(line: 251, column: 17, scope: !483)
!576 = !DILocation(line: 252, column: 1, scope: !483)
!577 = distinct !DISubprogram(name: "i2f", linkageName: "_Z3i2fi", scope: !17, file: !17, line: 49, type: !578, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!578 = !DISubroutineType(types: !579)
!579 = !{!16, !5}
!580 = !DILocalVariable(name: "i", arg: 1, scope: !577, file: !17, line: 49, type: !5)
!581 = !DILocation(line: 49, column: 23, scope: !577)
!582 = !DILocation(line: 51, column: 9, scope: !577)
!583 = !DILocation(line: 51, column: 11, scope: !577)
!584 = !DILocation(line: 51, column: 2, scope: !577)
!585 = distinct !DISubprogram(name: "fuelcen_activate", linkageName: "_Z16fuelcen_activateP7segmenti", scope: !15, file: !15, line: 256, type: !586, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !74, !5}
!588 = !DILocalVariable(name: "segp", arg: 1, scope: !585, file: !15, line: 256, type: !74)
!589 = !DILocation(line: 256, column: 32, scope: !585)
!590 = !DILocalVariable(name: "station_type", arg: 2, scope: !585, file: !15, line: 256, type: !5)
!591 = !DILocation(line: 256, column: 42, scope: !585)
!592 = !DILocalVariable(name: "seg2p", scope: !585, file: !15, line: 258, type: !409)
!593 = !DILocation(line: 258, column: 12, scope: !585)
!594 = !DILocation(line: 258, column: 31, scope: !585)
!595 = !DILocation(line: 258, column: 36, scope: !585)
!596 = !DILocation(line: 258, column: 21, scope: !585)
!597 = !DILocation(line: 260, column: 19, scope: !585)
!598 = !DILocation(line: 260, column: 2, scope: !585)
!599 = !DILocation(line: 260, column: 9, scope: !585)
!600 = !DILocation(line: 260, column: 17, scope: !585)
!601 = !DILocation(line: 262, column: 6, scope: !602)
!602 = distinct !DILexicalBlock(scope: !585, file: !15, line: 262, column: 6)
!603 = !DILocation(line: 262, column: 13, scope: !602)
!604 = !DILocation(line: 262, column: 21, scope: !602)
!605 = !DILocation(line: 263, column: 17, scope: !602)
!606 = !DILocation(line: 263, column: 3, scope: !602)
!607 = !DILocation(line: 265, column: 18, scope: !602)
!608 = !DILocation(line: 265, column: 3, scope: !602)
!609 = !DILocation(line: 267, column: 1, scope: !585)
!610 = distinct !DISubprogram(name: "trigger_matcen", linkageName: "_Z14trigger_matceni", scope: !15, file: !15, line: 276, type: !611, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !5}
!613 = !DILocalVariable(name: "segnum", arg: 1, scope: !610, file: !15, line: 276, type: !5)
!614 = !DILocation(line: 276, column: 25, scope: !610)
!615 = !DILocalVariable(name: "seg2p", scope: !610, file: !15, line: 279, type: !409)
!616 = !DILocation(line: 279, column: 12, scope: !610)
!617 = !DILocation(line: 279, column: 31, scope: !610)
!618 = !DILocation(line: 279, column: 21, scope: !610)
!619 = !DILocalVariable(name: "pos", scope: !610, file: !15, line: 280, type: !61)
!620 = !DILocation(line: 280, column: 13, scope: !610)
!621 = !DILocalVariable(name: "delta", scope: !610, file: !15, line: 280, type: !61)
!622 = !DILocation(line: 280, column: 18, scope: !610)
!623 = !DILocalVariable(name: "robotcen", scope: !610, file: !15, line: 281, type: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!625 = !DILocation(line: 281, column: 14, scope: !610)
!626 = !DILocalVariable(name: "objnum", scope: !610, file: !15, line: 282, type: !5)
!627 = !DILocation(line: 282, column: 8, scope: !610)
!628 = !DILocation(line: 284, column: 2, scope: !610)
!629 = !DILocation(line: 286, column: 2, scope: !610)
!630 = !DILocation(line: 287, column: 2, scope: !610)
!631 = !DILocation(line: 288, column: 2, scope: !610)
!632 = !DILocation(line: 0, scope: !610)
!633 = !DILocation(line: 290, column: 35, scope: !610)
!634 = !DILocation(line: 290, column: 42, scope: !610)
!635 = !DILocation(line: 290, column: 22, scope: !610)
!636 = !DILocation(line: 290, column: 54, scope: !610)
!637 = !DILocation(line: 290, column: 14, scope: !610)
!638 = !DILocation(line: 290, column: 11, scope: !610)
!639 = !DILocation(line: 292, column: 6, scope: !640)
!640 = distinct !DILexicalBlock(scope: !610, file: !15, line: 292, column: 6)
!641 = !DILocation(line: 292, column: 16, scope: !640)
!642 = !DILocation(line: 292, column: 24, scope: !640)
!643 = !DILocation(line: 293, column: 3, scope: !640)
!644 = !DILocation(line: 295, column: 7, scope: !645)
!645 = distinct !DILexicalBlock(scope: !610, file: !15, line: 295, column: 6)
!646 = !DILocation(line: 295, column: 17, scope: !645)
!647 = !DILocation(line: 295, column: 6, scope: !645)
!648 = !DILocation(line: 296, column: 3, scope: !645)
!649 = !DILocation(line: 299, column: 6, scope: !650)
!650 = distinct !DILexicalBlock(scope: !610, file: !15, line: 299, column: 6)
!651 = !DILocation(line: 299, column: 23, scope: !650)
!652 = !DILocation(line: 299, column: 27, scope: !650)
!653 = !DILocation(line: 300, column: 3, scope: !650)
!654 = !DILocation(line: 300, column: 13, scope: !650)
!655 = !DILocation(line: 300, column: 18, scope: !650)
!656 = !DILocation(line: 302, column: 2, scope: !610)
!657 = !DILocation(line: 302, column: 12, scope: !610)
!658 = !DILocation(line: 302, column: 18, scope: !610)
!659 = !DILocation(line: 303, column: 2, scope: !610)
!660 = !DILocation(line: 303, column: 12, scope: !610)
!661 = !DILocation(line: 303, column: 20, scope: !610)
!662 = !DILocation(line: 304, column: 27, scope: !610)
!663 = !DILocation(line: 304, column: 44, scope: !610)
!664 = !DILocation(line: 304, column: 23, scope: !610)
!665 = !DILocation(line: 304, column: 2, scope: !610)
!666 = !DILocation(line: 304, column: 12, scope: !610)
!667 = !DILocation(line: 304, column: 21, scope: !610)
!668 = !DILocation(line: 305, column: 27, scope: !610)
!669 = !DILocation(line: 305, column: 2, scope: !610)
!670 = !DILocation(line: 305, column: 12, scope: !610)
!671 = !DILocation(line: 305, column: 25, scope: !610)
!672 = !DILocation(line: 308, column: 8, scope: !610)
!673 = !DILocation(line: 308, column: 18, scope: !610)
!674 = !DILocation(line: 308, column: 6, scope: !610)
!675 = !DILocation(line: 309, column: 40, scope: !610)
!676 = !DILocation(line: 309, column: 31, scope: !610)
!677 = !DILocation(line: 309, column: 48, scope: !610)
!678 = !DILocation(line: 309, column: 22, scope: !610)
!679 = !DILocation(line: 309, column: 60, scope: !610)
!680 = !DILocation(line: 309, column: 70, scope: !610)
!681 = !DILocation(line: 309, column: 2, scope: !610)
!682 = !DILocation(line: 310, column: 2, scope: !610)
!683 = !DILocation(line: 311, column: 36, scope: !610)
!684 = !DILocation(line: 311, column: 11, scope: !610)
!685 = !DILocation(line: 311, column: 9, scope: !610)
!686 = !DILocation(line: 312, column: 6, scope: !687)
!687 = distinct !DILexicalBlock(scope: !610, file: !15, line: 312, column: 6)
!688 = !DILocation(line: 312, column: 13, scope: !687)
!689 = !DILocation(line: 313, column: 30, scope: !690)
!690 = distinct !DILexicalBlock(scope: !687, file: !15, line: 312, column: 20)
!691 = !DILocation(line: 313, column: 11, scope: !690)
!692 = !DILocation(line: 313, column: 3, scope: !690)
!693 = !DILocation(line: 313, column: 19, scope: !690)
!694 = !DILocation(line: 313, column: 28, scope: !690)
!695 = !DILocation(line: 314, column: 48, scope: !690)
!696 = !DILocation(line: 314, column: 11, scope: !690)
!697 = !DILocation(line: 314, column: 3, scope: !690)
!698 = !DILocation(line: 314, column: 19, scope: !690)
!699 = !DILocation(line: 314, column: 36, scope: !690)
!700 = !DILocation(line: 314, column: 46, scope: !690)
!701 = !DILocation(line: 315, column: 2, scope: !690)
!702 = !DILocation(line: 317, column: 3, scope: !703)
!703 = distinct !DILexicalBlock(scope: !687, file: !15, line: 316, column: 7)
!704 = !DILocation(line: 318, column: 3, scope: !703)
!705 = !DILocation(line: 321, column: 1, scope: !610)
!706 = distinct !DISubprogram(name: "create_morph_robot", linkageName: "_Z18create_morph_robotP7segmentP10vms_vectori", scope: !15, file: !15, line: 374, type: !707, scopeLine: 375, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!707 = !DISubroutineType(types: !708)
!708 = !{!709, !74, !841, !5}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !711, line: 259, baseType: !712)
!711 = !DIFile(filename: "main_d2/object.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "1f2325d356aae4b692933d2aae4f3afd")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !711, line: 210, size: 2144, flags: DIFlagTypePassByValue, elements: !713, identifier: "_ZTS6object")
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !733, !734, !735, !736, !737, !738, !739, !740, !741, !759, !813}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !712, file: !711, line: 212, baseType: !5, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !712, file: !711, line: 213, baseType: !86, size: 8, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !712, file: !711, line: 214, baseType: !86, size: 8, offset: 40)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !711, line: 215, baseType: !38, size: 16, offset: 48)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !712, file: !711, line: 215, baseType: !38, size: 16, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !712, file: !711, line: 216, baseType: !86, size: 8, offset: 80)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "movement_type", scope: !712, file: !711, line: 217, baseType: !86, size: 8, offset: 88)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "render_type", scope: !712, file: !711, line: 218, baseType: !86, size: 8, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !712, file: !711, line: 219, baseType: !86, size: 8, offset: 104)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !712, file: !711, line: 220, baseType: !38, size: 16, offset: 112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "attached_obj", scope: !712, file: !711, line: 221, baseType: !38, size: 16, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !712, file: !711, line: 222, baseType: !61, size: 96, offset: 160)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "orient", scope: !712, file: !711, line: 223, baseType: !727, size: 288, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_matrix", file: !62, line: 47, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_matrix", file: !62, line: 44, size: 288, flags: DIFlagTypePassByValue, elements: !729, identifier: "_ZTS10vms_matrix")
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "rvec", scope: !728, file: !62, line: 46, baseType: !61, size: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "uvec", scope: !728, file: !62, line: 46, baseType: !61, size: 96, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fvec", scope: !728, file: !62, line: 46, baseType: !61, size: 96, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !712, file: !711, line: 224, baseType: !16, size: 32, offset: 544)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "shields", scope: !712, file: !711, line: 225, baseType: !16, size: 32, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !712, file: !711, line: 226, baseType: !61, size: 96, offset: 608)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "contains_type", scope: !712, file: !711, line: 227, baseType: !6, size: 8, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "contains_id", scope: !712, file: !711, line: 228, baseType: !6, size: 8, offset: 712)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "contains_count", scope: !712, file: !711, line: 229, baseType: !6, size: 8, offset: 720)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "matcen_creator", scope: !712, file: !711, line: 230, baseType: !6, size: 8, offset: 728)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lifeleft", scope: !712, file: !711, line: 231, baseType: !16, size: 32, offset: 736)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mtype", scope: !712, file: !711, line: 240, baseType: !742, size: 512, offset: 768)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !712, file: !711, line: 236, size: 512, flags: DIFlagTypePassByValue, elements: !743, identifier: "_ZTSN6objectUt_E")
!743 = !{!744, !758}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "phys_info", scope: !742, file: !711, line: 238, baseType: !745, size: 512)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "physics_info", file: !711, line: 153, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "physics_info", file: !711, line: 142, size: 512, flags: DIFlagTypePassByValue, elements: !747, identifier: "_ZTS12physics_info")
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !757}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !746, file: !711, line: 144, baseType: !61, size: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "thrust", scope: !746, file: !711, line: 145, baseType: !61, size: 96, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !746, file: !711, line: 146, baseType: !16, size: 32, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "drag", scope: !746, file: !711, line: 147, baseType: !16, size: 32, offset: 224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "brakes", scope: !746, file: !711, line: 148, baseType: !16, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rotvel", scope: !746, file: !711, line: 149, baseType: !61, size: 96, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rotthrust", scope: !746, file: !711, line: 150, baseType: !61, size: 96, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "turnroll", scope: !746, file: !711, line: 151, baseType: !756, size: 16, offset: 480)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixang", file: !17, line: 21, baseType: !38)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !746, file: !711, line: 152, baseType: !253, size: 16, offset: 496)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "spin_rate", scope: !742, file: !711, line: 239, baseType: !61, size: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !712, file: !711, line: 250, baseType: !760, size: 256, offset: 1280)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !712, file: !711, line: 243, size: 256, flags: DIFlagTypePassByValue, elements: !761, identifier: "_ZTSN6objectUt0_E")
!761 = !{!762, !773, !783, !801, !806}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "laser_info", scope: !760, file: !711, line: 245, baseType: !763, size: 160)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "laser_info_t", file: !711, line: 166, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "laser_info_s", file: !711, line: 157, size: 160, flags: DIFlagTypePassByValue, elements: !765, identifier: "_ZTS12laser_info_s")
!765 = !{!766, !767, !768, !769, !770, !771, !772}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "parent_type", scope: !764, file: !711, line: 159, baseType: !38, size: 16)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "parent_num", scope: !764, file: !711, line: 160, baseType: !38, size: 16, offset: 16)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "parent_signature", scope: !764, file: !711, line: 161, baseType: !5, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !764, file: !711, line: 162, baseType: !16, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "last_hitobj", scope: !764, file: !711, line: 163, baseType: !38, size: 16, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "track_goal", scope: !764, file: !711, line: 164, baseType: !38, size: 16, offset: 112)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !764, file: !711, line: 165, baseType: !16, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "expl_info", scope: !760, file: !711, line: 246, baseType: !774, size: 128)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "explosion_info", file: !711, line: 176, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "explosion_info", file: !711, line: 168, size: 128, flags: DIFlagTypePassByValue, elements: !776, identifier: "_ZTS14explosion_info")
!776 = !{!777, !778, !779, !780, !781, !782}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "spawn_time", scope: !775, file: !711, line: 170, baseType: !16, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "delete_time", scope: !775, file: !711, line: 171, baseType: !16, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "delete_objnum", scope: !775, file: !711, line: 172, baseType: !38, size: 16, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "attach_parent", scope: !775, file: !711, line: 173, baseType: !38, size: 16, offset: 80)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "prev_attach", scope: !775, file: !711, line: 174, baseType: !38, size: 16, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "next_attach", scope: !775, file: !711, line: 175, baseType: !38, size: 16, offset: 112)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ai_info", scope: !760, file: !711, line: 247, baseType: !784, size: 256)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ai_static", file: !785, line: 144, baseType: !786)
!785 = !DIFile(filename: "main_d2/aistruct.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d122430e792a0ddc0f9eaa08ad217628")
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ai_static", file: !785, line: 127, size: 256, flags: DIFlagTypePassByValue, elements: !787, identifier: "_ZTS9ai_static")
!787 = !{!788, !789, !793, !794, !795, !796, !797, !798, !799, !800}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "behavior", scope: !786, file: !785, line: 128, baseType: !86, size: 8)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !786, file: !785, line: 129, baseType: !790, size: 88, offset: 8)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 88, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 11)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "hide_segment", scope: !786, file: !785, line: 130, baseType: !38, size: 16, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "hide_index", scope: !786, file: !785, line: 131, baseType: !38, size: 16, offset: 112)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !786, file: !785, line: 132, baseType: !38, size: 16, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cur_path_index", scope: !786, file: !785, line: 133, baseType: !6, size: 8, offset: 144)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "dying_sound_playing", scope: !786, file: !785, line: 134, baseType: !6, size: 8, offset: 152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_num", scope: !786, file: !785, line: 139, baseType: !38, size: 16, offset: 160)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_signature", scope: !786, file: !785, line: 140, baseType: !5, size: 32, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dying_start_time", scope: !786, file: !785, line: 141, baseType: !16, size: 32, offset: 224)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "light_info", scope: !760, file: !711, line: 248, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "light_info_t", file: !711, line: 181, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "light_info_s", file: !711, line: 178, size: 32, flags: DIFlagTypePassByValue, elements: !804, identifier: "_ZTS12light_info_s")
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !803, file: !711, line: 180, baseType: !16, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "powerup_info", scope: !760, file: !711, line: 249, baseType: !807, size: 96)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "powerup_info_t", file: !711, line: 190, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "powerup_info_s", file: !711, line: 185, size: 96, flags: DIFlagTypePassByValue, elements: !809, identifier: "_ZTS14powerup_info_s")
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !808, file: !711, line: 187, baseType: !5, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !808, file: !711, line: 188, baseType: !16, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !808, file: !711, line: 189, baseType: !5, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !712, file: !711, line: 257, baseType: !814, size: 608, offset: 1536)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !712, file: !711, line: 253, size: 608, flags: DIFlagTypePassByValue, elements: !815, identifier: "_ZTSN6objectUt1_E")
!815 = !{!816, !834}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pobj_info", scope: !814, file: !711, line: 255, baseType: !817, size: 608)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "polyobj_info", file: !711, line: 208, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "polyobj_info", file: !711, line: 201, size: 608, flags: DIFlagTypePassByValue, elements: !819, identifier: "_ZTS12polyobj_info")
!819 = !{!820, !821, !831, !832, !833}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "model_num", scope: !818, file: !711, line: 203, baseType: !5, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "anim_angles", scope: !818, file: !711, line: 204, baseType: !822, size: 480, offset: 32)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 480, elements: !829)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_angvec", file: !62, line: 40, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_angvec", file: !62, line: 37, size: 48, flags: DIFlagTypePassByValue, elements: !825, identifier: "_ZTS10vms_angvec")
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !824, file: !62, line: 39, baseType: !756, size: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !824, file: !62, line: 39, baseType: !756, size: 16, offset: 16)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !824, file: !62, line: 39, baseType: !756, size: 16, offset: 32)
!829 = !{!830}
!830 = !DISubrange(count: 10)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "subobj_flags", scope: !818, file: !711, line: 205, baseType: !5, size: 32, offset: 512)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_override", scope: !818, file: !711, line: 206, baseType: !5, size: 32, offset: 544)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "alt_textures", scope: !818, file: !711, line: 207, baseType: !5, size: 32, offset: 576)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_info", scope: !814, file: !711, line: 256, baseType: !835, size: 96)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "vclip_info_t", file: !711, line: 197, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vclip_info_s", file: !711, line: 192, size: 96, flags: DIFlagTypePassByValue, elements: !837, identifier: "_ZTS12vclip_info_s")
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_num", scope: !836, file: !711, line: 194, baseType: !5, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "frametime", scope: !836, file: !711, line: 195, baseType: !16, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !836, file: !711, line: 196, baseType: !6, size: 8, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!842 = !DILocalVariable(name: "segp", arg: 1, scope: !706, file: !15, line: 374, type: !74)
!843 = !DILocation(line: 374, column: 37, scope: !706)
!844 = !DILocalVariable(name: "object_pos", arg: 2, scope: !706, file: !15, line: 374, type: !841)
!845 = !DILocation(line: 374, column: 55, scope: !706)
!846 = !DILocalVariable(name: "object_id", arg: 3, scope: !706, file: !15, line: 374, type: !5)
!847 = !DILocation(line: 374, column: 71, scope: !706)
!848 = !DILocalVariable(name: "objnum", scope: !706, file: !15, line: 376, type: !38)
!849 = !DILocation(line: 376, column: 9, scope: !706)
!850 = !DILocalVariable(name: "obj", scope: !706, file: !15, line: 377, type: !709)
!851 = !DILocation(line: 377, column: 10, scope: !706)
!852 = !DILocalVariable(name: "default_behavior", scope: !706, file: !15, line: 378, type: !5)
!853 = !DILocation(line: 378, column: 7, scope: !706)
!854 = !DILocation(line: 380, column: 10, scope: !706)
!855 = !DILocation(line: 380, column: 2, scope: !706)
!856 = !DILocation(line: 380, column: 22, scope: !706)
!857 = !DILocation(line: 380, column: 38, scope: !706)
!858 = !DILocation(line: 381, column: 10, scope: !706)
!859 = !DILocation(line: 381, column: 2, scope: !706)
!860 = !DILocation(line: 381, column: 22, scope: !706)
!861 = !DILocation(line: 381, column: 38, scope: !706)
!862 = !DILocation(line: 383, column: 33, scope: !706)
!863 = !DILocation(line: 383, column: 44, scope: !706)
!864 = !DILocation(line: 383, column: 49, scope: !706)
!865 = !DILocation(line: 383, column: 61, scope: !706)
!866 = !DILocation(line: 384, column: 51, scope: !706)
!867 = !DILocation(line: 384, column: 40, scope: !706)
!868 = !DILocation(line: 384, column: 62, scope: !706)
!869 = !DILocation(line: 384, column: 25, scope: !706)
!870 = !DILocation(line: 384, column: 73, scope: !706)
!871 = !DILocation(line: 383, column: 11, scope: !706)
!872 = !DILocation(line: 383, column: 9, scope: !706)
!873 = !DILocation(line: 387, column: 6, scope: !874)
!874 = distinct !DILexicalBlock(scope: !706, file: !15, line: 387, column: 6)
!875 = !DILocation(line: 387, column: 13, scope: !874)
!876 = !DILocation(line: 388, column: 3, scope: !877)
!877 = distinct !DILexicalBlock(scope: !874, file: !15, line: 387, column: 18)
!878 = !DILocation(line: 389, column: 3, scope: !877)
!879 = !DILocation(line: 390, column: 3, scope: !877)
!880 = !DILocation(line: 393, column: 17, scope: !706)
!881 = !DILocation(line: 393, column: 9, scope: !706)
!882 = !DILocation(line: 393, column: 6, scope: !706)
!883 = !DILocation(line: 397, column: 46, scope: !706)
!884 = !DILocation(line: 397, column: 51, scope: !706)
!885 = !DILocation(line: 397, column: 35, scope: !706)
!886 = !DILocation(line: 397, column: 55, scope: !706)
!887 = !DILocation(line: 397, column: 2, scope: !706)
!888 = !DILocation(line: 397, column: 7, scope: !706)
!889 = !DILocation(line: 397, column: 23, scope: !706)
!890 = !DILocation(line: 397, column: 33, scope: !706)
!891 = !DILocation(line: 398, column: 2, scope: !706)
!892 = !DILocation(line: 398, column: 7, scope: !706)
!893 = !DILocation(line: 398, column: 23, scope: !706)
!894 = !DILocation(line: 398, column: 36, scope: !706)
!895 = !DILocation(line: 402, column: 41, scope: !706)
!896 = !DILocation(line: 402, column: 46, scope: !706)
!897 = !DILocation(line: 402, column: 30, scope: !706)
!898 = !DILocation(line: 402, column: 50, scope: !706)
!899 = !DILocation(line: 402, column: 2, scope: !706)
!900 = !DILocation(line: 402, column: 7, scope: !706)
!901 = !DILocation(line: 402, column: 23, scope: !706)
!902 = !DILocation(line: 402, column: 28, scope: !706)
!903 = !DILocation(line: 403, column: 41, scope: !706)
!904 = !DILocation(line: 403, column: 46, scope: !706)
!905 = !DILocation(line: 403, column: 30, scope: !706)
!906 = !DILocation(line: 403, column: 50, scope: !706)
!907 = !DILocation(line: 403, column: 2, scope: !706)
!908 = !DILocation(line: 403, column: 7, scope: !706)
!909 = !DILocation(line: 403, column: 23, scope: !706)
!910 = !DILocation(line: 403, column: 28, scope: !706)
!911 = !DILocation(line: 405, column: 2, scope: !706)
!912 = !DILocation(line: 405, column: 7, scope: !706)
!913 = !DILocation(line: 405, column: 23, scope: !706)
!914 = !DILocation(line: 405, column: 29, scope: !706)
!915 = !DILocation(line: 407, column: 28, scope: !706)
!916 = !DILocation(line: 407, column: 33, scope: !706)
!917 = !DILocation(line: 407, column: 17, scope: !706)
!918 = !DILocation(line: 407, column: 37, scope: !706)
!919 = !DILocation(line: 407, column: 2, scope: !706)
!920 = !DILocation(line: 407, column: 7, scope: !706)
!921 = !DILocation(line: 407, column: 15, scope: !706)
!922 = !DILocation(line: 409, column: 32, scope: !706)
!923 = !DILocation(line: 409, column: 37, scope: !706)
!924 = !DILocation(line: 409, column: 21, scope: !706)
!925 = !DILocation(line: 409, column: 41, scope: !706)
!926 = !DILocation(line: 409, column: 19, scope: !706)
!927 = !DILocation(line: 411, column: 17, scope: !706)
!928 = !DILocation(line: 411, column: 21, scope: !706)
!929 = !DILocation(line: 411, column: 32, scope: !706)
!930 = !DILocation(line: 411, column: 2, scope: !706)
!931 = !DILocation(line: 413, column: 24, scope: !706)
!932 = !DILocation(line: 413, column: 2, scope: !706)
!933 = !DILocation(line: 415, column: 51, scope: !706)
!934 = !DILocation(line: 415, column: 31, scope: !706)
!935 = !DILocation(line: 415, column: 16, scope: !706)
!936 = !DILocation(line: 415, column: 2, scope: !706)
!937 = !DILocation(line: 415, column: 24, scope: !706)
!938 = !DILocation(line: 415, column: 29, scope: !706)
!939 = !DILocation(line: 417, column: 9, scope: !706)
!940 = !DILocation(line: 417, column: 2, scope: !706)
!941 = !DILocation(line: 418, column: 1, scope: !706)
!942 = distinct !DISubprogram(name: "robotmaker_proc", linkageName: "_Z15robotmaker_procP10FuelCenter", scope: !15, file: !15, line: 427, type: !943, scopeLine: 428, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !624}
!945 = !DILocalVariable(name: "robotcen", arg: 1, scope: !942, file: !15, line: 427, type: !624)
!946 = !DILocation(line: 427, column: 34, scope: !942)
!947 = !DILocalVariable(name: "dist_to_player", scope: !942, file: !15, line: 429, type: !16)
!948 = !DILocation(line: 429, column: 7, scope: !942)
!949 = !DILocalVariable(name: "cur_object_loc", scope: !942, file: !15, line: 430, type: !61)
!950 = !DILocation(line: 430, column: 13, scope: !942)
!951 = !DILocalVariable(name: "matcen_num", scope: !942, file: !15, line: 431, type: !5)
!952 = !DILocation(line: 431, column: 7, scope: !942)
!953 = !DILocalVariable(name: "segnum", scope: !942, file: !15, line: 431, type: !5)
!954 = !DILocation(line: 431, column: 19, scope: !942)
!955 = !DILocalVariable(name: "objnum", scope: !942, file: !15, line: 431, type: !5)
!956 = !DILocation(line: 431, column: 27, scope: !942)
!957 = !DILocalVariable(name: "obj", scope: !942, file: !15, line: 432, type: !709)
!958 = !DILocation(line: 432, column: 10, scope: !942)
!959 = !DILocalVariable(name: "top_time", scope: !942, file: !15, line: 433, type: !16)
!960 = !DILocation(line: 433, column: 7, scope: !942)
!961 = !DILocalVariable(name: "direction", scope: !942, file: !15, line: 434, type: !61)
!962 = !DILocation(line: 434, column: 13, scope: !942)
!963 = !DILocation(line: 436, column: 6, scope: !964)
!964 = distinct !DILexicalBlock(scope: !942, file: !15, line: 436, column: 6)
!965 = !DILocation(line: 436, column: 16, scope: !964)
!966 = !DILocation(line: 436, column: 24, scope: !964)
!967 = !DILocation(line: 437, column: 3, scope: !964)
!968 = !DILocation(line: 439, column: 6, scope: !969)
!969 = distinct !DILexicalBlock(scope: !942, file: !15, line: 439, column: 6)
!970 = !DILocation(line: 439, column: 16, scope: !969)
!971 = !DILocation(line: 439, column: 29, scope: !969)
!972 = !DILocation(line: 441, column: 29, scope: !973)
!973 = distinct !DILexicalBlock(scope: !969, file: !15, line: 440, column: 2)
!974 = !DILocation(line: 441, column: 3, scope: !973)
!975 = !DILocation(line: 441, column: 13, scope: !973)
!976 = !DILocation(line: 441, column: 26, scope: !973)
!977 = !DILocation(line: 442, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !973, file: !15, line: 442, column: 7)
!979 = !DILocation(line: 442, column: 17, scope: !978)
!980 = !DILocation(line: 442, column: 30, scope: !978)
!981 = !DILocation(line: 444, column: 4, scope: !982)
!982 = distinct !DILexicalBlock(scope: !978, file: !15, line: 443, column: 3)
!983 = !DILocation(line: 445, column: 4, scope: !982)
!984 = !DILocation(line: 445, column: 14, scope: !982)
!985 = !DILocation(line: 445, column: 22, scope: !982)
!986 = !DILocation(line: 446, column: 3, scope: !982)
!987 = !DILocation(line: 447, column: 2, scope: !973)
!988 = !DILocation(line: 463, column: 6, scope: !989)
!989 = distinct !DILexicalBlock(scope: !942, file: !15, line: 463, column: 6)
!990 = !DILocation(line: 463, column: 16, scope: !989)
!991 = !DILocation(line: 463, column: 25, scope: !989)
!992 = !DILocation(line: 465, column: 3, scope: !993)
!993 = distinct !DILexicalBlock(scope: !989, file: !15, line: 464, column: 2)
!994 = !DILocation(line: 468, column: 25, scope: !942)
!995 = !DILocation(line: 468, column: 35, scope: !942)
!996 = !DILocation(line: 468, column: 15, scope: !942)
!997 = !DILocation(line: 468, column: 43, scope: !942)
!998 = !DILocation(line: 468, column: 13, scope: !942)
!999 = !DILocation(line: 471, column: 6, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !942, file: !15, line: 471, column: 6)
!1001 = !DILocation(line: 471, column: 17, scope: !1000)
!1002 = !DILocation(line: 473, column: 3, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1000, file: !15, line: 472, column: 2)
!1004 = !DILocation(line: 474, column: 3, scope: !1003)
!1005 = !DILocation(line: 477, column: 19, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !942, file: !15, line: 477, column: 6)
!1007 = !DILocation(line: 477, column: 6, scope: !1006)
!1008 = !DILocation(line: 477, column: 31, scope: !1006)
!1009 = !DILocation(line: 477, column: 46, scope: !1006)
!1010 = !DILocation(line: 477, column: 51, scope: !1006)
!1011 = !DILocation(line: 477, column: 67, scope: !1006)
!1012 = !DILocation(line: 477, column: 54, scope: !1006)
!1013 = !DILocation(line: 477, column: 79, scope: !1006)
!1014 = !DILocation(line: 477, column: 94, scope: !1006)
!1015 = !DILocation(line: 479, column: 3, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1006, file: !15, line: 477, column: 100)
!1017 = !DILocation(line: 484, column: 15, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !942, file: !15, line: 484, column: 6)
!1019 = !DILocation(line: 484, column: 7, scope: !1018)
!1020 = !DILocation(line: 484, column: 27, scope: !1018)
!1021 = !DILocation(line: 484, column: 54, scope: !1018)
!1022 = !DILocation(line: 484, column: 46, scope: !1018)
!1023 = !DILocation(line: 484, column: 66, scope: !1018)
!1024 = !DILocation(line: 484, column: 44, scope: !1018)
!1025 = !DILocation(line: 484, column: 87, scope: !1018)
!1026 = !DILocation(line: 484, column: 113, scope: !1018)
!1027 = !DILocation(line: 484, column: 111, scope: !1018)
!1028 = !DILocation(line: 484, column: 83, scope: !1018)
!1029 = !DILocation(line: 486, column: 7, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !15, line: 486, column: 7)
!1031 = distinct !DILexicalBlock(scope: !1018, file: !15, line: 484, column: 132)
!1032 = !DILocation(line: 486, column: 20, scope: !1030)
!1033 = !DILocation(line: 486, column: 40, scope: !1030)
!1034 = !DILocation(line: 486, column: 18, scope: !1030)
!1035 = !DILocation(line: 488, column: 4, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1030, file: !15, line: 487, column: 3)
!1037 = !DILocation(line: 489, column: 26, scope: !1036)
!1038 = !DILocation(line: 489, column: 24, scope: !1036)
!1039 = !DILocation(line: 490, column: 3, scope: !1036)
!1040 = !DILocation(line: 492, column: 3, scope: !1031)
!1041 = !DILocation(line: 495, column: 21, scope: !942)
!1042 = !DILocation(line: 495, column: 2, scope: !942)
!1043 = !DILocation(line: 495, column: 12, scope: !942)
!1044 = !DILocation(line: 495, column: 18, scope: !942)
!1045 = !DILocation(line: 497, column: 10, scope: !942)
!1046 = !DILocation(line: 497, column: 20, scope: !942)
!1047 = !DILocation(line: 497, column: 2, scope: !942)
!1048 = !DILocation(line: 500, column: 7, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !15, line: 500, column: 7)
!1050 = distinct !DILexicalBlock(scope: !942, file: !15, line: 498, column: 2)
!1051 = !DILocation(line: 500, column: 17, scope: !1049)
!1052 = !DILocation(line: 502, column: 15, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1049, file: !15, line: 501, column: 3)
!1054 = !DILocation(line: 502, column: 13, scope: !1053)
!1055 = !DILocation(line: 503, column: 3, scope: !1053)
!1056 = !DILocation(line: 506, column: 40, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1049, file: !15, line: 505, column: 3)
!1058 = !DILocation(line: 506, column: 55, scope: !1057)
!1059 = !DILocation(line: 506, column: 61, scope: !1057)
!1060 = !DILocation(line: 506, column: 71, scope: !1057)
!1061 = !DILocation(line: 506, column: 21, scope: !1057)
!1062 = !DILocation(line: 506, column: 19, scope: !1057)
!1063 = !DILocation(line: 507, column: 15, scope: !1057)
!1064 = !DILocation(line: 507, column: 30, scope: !1057)
!1065 = !DILocation(line: 507, column: 37, scope: !1057)
!1066 = !DILocation(line: 507, column: 46, scope: !1057)
!1067 = !DILocation(line: 507, column: 35, scope: !1057)
!1068 = !DILocation(line: 507, column: 50, scope: !1057)
!1069 = !DILocation(line: 507, column: 13, scope: !1057)
!1070 = !DILocation(line: 508, column: 8, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1057, file: !15, line: 508, column: 8)
!1072 = !DILocation(line: 508, column: 19, scope: !1071)
!1073 = !DILocation(line: 508, column: 17, scope: !1071)
!1074 = !DILocation(line: 509, column: 16, scope: !1071)
!1075 = !DILocation(line: 509, column: 33, scope: !1071)
!1076 = !DILocation(line: 509, column: 31, scope: !1071)
!1077 = !DILocation(line: 509, column: 14, scope: !1071)
!1078 = !DILocation(line: 509, column: 5, scope: !1071)
!1079 = !DILocation(line: 510, column: 8, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1057, file: !15, line: 510, column: 8)
!1081 = !DILocation(line: 510, column: 17, scope: !1080)
!1082 = !DILocation(line: 511, column: 31, scope: !1080)
!1083 = !DILocation(line: 511, column: 40, scope: !1080)
!1084 = !DILocation(line: 511, column: 29, scope: !1080)
!1085 = !DILocation(line: 511, column: 14, scope: !1080)
!1086 = !DILocation(line: 511, column: 5, scope: !1080)
!1087 = !DILocation(line: 516, column: 7, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1050, file: !15, line: 516, column: 7)
!1089 = !DILocation(line: 516, column: 17, scope: !1088)
!1090 = !DILocation(line: 516, column: 25, scope: !1088)
!1091 = !DILocation(line: 516, column: 23, scope: !1088)
!1092 = !DILocalVariable(name: "count", scope: !1093, file: !15, line: 518, type: !5)
!1093 = distinct !DILexicalBlock(scope: !1088, file: !15, line: 517, column: 3)
!1094 = !DILocation(line: 518, column: 8, scope: !1093)
!1095 = !DILocalVariable(name: "i", scope: !1093, file: !15, line: 519, type: !5)
!1096 = !DILocation(line: 519, column: 8, scope: !1093)
!1097 = !DILocalVariable(name: "my_station_num", scope: !1093, file: !15, line: 519, type: !5)
!1098 = !DILocation(line: 519, column: 11, scope: !1093)
!1099 = !DILocation(line: 519, column: 28, scope: !1093)
!1100 = !DILocation(line: 519, column: 37, scope: !1093)
!1101 = !DILocalVariable(name: "obj", scope: !1093, file: !15, line: 520, type: !709)
!1102 = !DILocation(line: 520, column: 12, scope: !1093)
!1103 = !DILocation(line: 523, column: 11, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1093, file: !15, line: 523, column: 4)
!1105 = !DILocation(line: 523, column: 9, scope: !1104)
!1106 = !DILocation(line: 523, column: 16, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1104, file: !15, line: 523, column: 4)
!1108 = !DILocation(line: 523, column: 21, scope: !1107)
!1109 = !DILocation(line: 523, column: 18, scope: !1107)
!1110 = !DILocation(line: 523, column: 4, scope: !1104)
!1111 = !DILocation(line: 524, column: 17, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1107, file: !15, line: 524, column: 9)
!1113 = !DILocation(line: 524, column: 9, scope: !1112)
!1114 = !DILocation(line: 524, column: 20, scope: !1112)
!1115 = !DILocation(line: 524, column: 25, scope: !1112)
!1116 = !DILocation(line: 527, column: 27, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1112, file: !15, line: 527, column: 10)
!1118 = !DILocation(line: 527, column: 19, scope: !1117)
!1119 = !DILocation(line: 527, column: 30, scope: !1117)
!1120 = !DILocation(line: 527, column: 45, scope: !1117)
!1121 = !DILocation(line: 527, column: 18, scope: !1117)
!1122 = !DILocation(line: 527, column: 10, scope: !1117)
!1123 = !DILocation(line: 527, column: 56, scope: !1117)
!1124 = !DILocation(line: 527, column: 53, scope: !1117)
!1125 = !DILocation(line: 528, column: 12, scope: !1117)
!1126 = !DILocation(line: 528, column: 7, scope: !1117)
!1127 = !DILocation(line: 524, column: 28, scope: !1112)
!1128 = !DILocation(line: 523, column: 44, scope: !1107)
!1129 = !DILocation(line: 523, column: 4, scope: !1107)
!1130 = distinct !{!1130, !1110, !1131, !363}
!1131 = !DILocation(line: 528, column: 12, scope: !1104)
!1132 = !DILocation(line: 529, column: 8, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1093, file: !15, line: 529, column: 8)
!1134 = !DILocation(line: 529, column: 16, scope: !1133)
!1135 = !DILocation(line: 529, column: 33, scope: !1133)
!1136 = !DILocation(line: 529, column: 14, scope: !1133)
!1137 = !DILocation(line: 531, column: 5, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1133, file: !15, line: 530, column: 4)
!1139 = !DILocation(line: 532, column: 5, scope: !1138)
!1140 = !DILocation(line: 532, column: 15, scope: !1138)
!1141 = !DILocation(line: 532, column: 21, scope: !1138)
!1142 = !DILocation(line: 533, column: 5, scope: !1138)
!1143 = !DILocation(line: 537, column: 10, scope: !1093)
!1144 = !DILocation(line: 538, column: 13, scope: !1093)
!1145 = !DILocation(line: 538, column: 23, scope: !1093)
!1146 = !DILocation(line: 538, column: 11, scope: !1093)
!1147 = !DILocation(line: 539, column: 27, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1093, file: !15, line: 539, column: 4)
!1149 = !DILocation(line: 539, column: 18, scope: !1148)
!1150 = !DILocation(line: 539, column: 35, scope: !1148)
!1151 = !DILocation(line: 539, column: 16, scope: !1148)
!1152 = !DILocation(line: 539, column: 9, scope: !1148)
!1153 = !DILocation(line: 539, column: 44, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1148, file: !15, line: 539, column: 4)
!1155 = !DILocation(line: 539, column: 51, scope: !1154)
!1156 = !DILocation(line: 539, column: 4, scope: !1148)
!1157 = !DILocation(line: 541, column: 10, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1154, file: !15, line: 540, column: 4)
!1159 = !DILocation(line: 542, column: 9, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1158, file: !15, line: 542, column: 9)
!1161 = !DILocation(line: 542, column: 15, scope: !1160)
!1162 = !DILocation(line: 544, column: 6, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1160, file: !15, line: 543, column: 5)
!1164 = !DILocation(line: 545, column: 6, scope: !1163)
!1165 = !DILocation(line: 546, column: 6, scope: !1163)
!1166 = !DILocation(line: 548, column: 17, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1158, file: !15, line: 548, column: 9)
!1168 = !DILocation(line: 548, column: 9, scope: !1167)
!1169 = !DILocation(line: 548, column: 25, scope: !1167)
!1170 = !DILocation(line: 548, column: 30, scope: !1167)
!1171 = !DILocation(line: 550, column: 56, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1167, file: !15, line: 549, column: 5)
!1173 = !DILocation(line: 550, column: 48, scope: !1172)
!1174 = !DILocation(line: 550, column: 6, scope: !1172)
!1175 = !DILocation(line: 551, column: 24, scope: !1172)
!1176 = !DILocation(line: 551, column: 33, scope: !1172)
!1177 = !DILocation(line: 551, column: 6, scope: !1172)
!1178 = !DILocation(line: 551, column: 16, scope: !1172)
!1179 = !DILocation(line: 551, column: 22, scope: !1172)
!1180 = !DILocation(line: 552, column: 6, scope: !1172)
!1181 = !DILocation(line: 554, column: 22, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1167, file: !15, line: 554, column: 14)
!1183 = !DILocation(line: 554, column: 14, scope: !1182)
!1184 = !DILocation(line: 554, column: 30, scope: !1182)
!1185 = !DILocation(line: 554, column: 35, scope: !1182)
!1186 = !DILocation(line: 556, column: 57, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1182, file: !15, line: 555, column: 5)
!1188 = !DILocation(line: 556, column: 49, scope: !1187)
!1189 = !DILocation(line: 556, column: 6, scope: !1187)
!1190 = !DILocation(line: 557, column: 24, scope: !1187)
!1191 = !DILocation(line: 557, column: 33, scope: !1187)
!1192 = !DILocation(line: 557, column: 6, scope: !1187)
!1193 = !DILocation(line: 557, column: 16, scope: !1187)
!1194 = !DILocation(line: 557, column: 22, scope: !1187)
!1195 = !DILocation(line: 558, column: 6, scope: !1187)
!1196 = !DILocation(line: 560, column: 4, scope: !1158)
!1197 = !DILocation(line: 539, column: 75, scope: !1154)
!1198 = !DILocation(line: 539, column: 67, scope: !1154)
!1199 = !DILocation(line: 539, column: 83, scope: !1154)
!1200 = !DILocation(line: 539, column: 65, scope: !1154)
!1201 = !DILocation(line: 539, column: 4, scope: !1154)
!1202 = distinct !{!1202, !1156, !1203, !363}
!1203 = !DILocation(line: 560, column: 4, scope: !1148)
!1204 = !DILocation(line: 562, column: 54, scope: !1093)
!1205 = !DILocation(line: 562, column: 64, scope: !1093)
!1206 = !DILocation(line: 562, column: 45, scope: !1093)
!1207 = !DILocation(line: 562, column: 4, scope: !1093)
!1208 = !DILocation(line: 564, column: 34, scope: !1093)
!1209 = !DILocation(line: 564, column: 44, scope: !1093)
!1210 = !DILocation(line: 564, column: 69, scope: !1093)
!1211 = !DILocation(line: 564, column: 10, scope: !1093)
!1212 = !DILocation(line: 564, column: 8, scope: !1093)
!1213 = !DILocation(line: 566, column: 8, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1093, file: !15, line: 566, column: 8)
!1215 = !DILocation(line: 567, column: 34, scope: !1214)
!1216 = !DILocation(line: 567, column: 39, scope: !1214)
!1217 = !DILocation(line: 567, column: 57, scope: !1214)
!1218 = !DILocation(line: 567, column: 67, scope: !1214)
!1219 = !DILocation(line: 567, column: 48, scope: !1214)
!1220 = !DILocation(line: 567, column: 5, scope: !1214)
!1221 = !DILocation(line: 569, column: 36, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1093, file: !15, line: 569, column: 8)
!1223 = !DILocation(line: 569, column: 8, scope: !1222)
!1224 = !DILocation(line: 569, column: 46, scope: !1222)
!1225 = !DILocation(line: 571, column: 56, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1222, file: !15, line: 570, column: 4)
!1227 = !DILocation(line: 571, column: 28, scope: !1226)
!1228 = !DILocation(line: 571, column: 67, scope: !1226)
!1229 = !DILocation(line: 571, column: 77, scope: !1226)
!1230 = !DILocation(line: 571, column: 5, scope: !1226)
!1231 = !DILocation(line: 572, column: 4, scope: !1226)
!1232 = !DILocation(line: 573, column: 4, scope: !1093)
!1233 = !DILocation(line: 573, column: 14, scope: !1093)
!1234 = !DILocation(line: 573, column: 19, scope: !1093)
!1235 = !DILocation(line: 574, column: 4, scope: !1093)
!1236 = !DILocation(line: 574, column: 14, scope: !1093)
!1237 = !DILocation(line: 574, column: 20, scope: !1093)
!1238 = !DILocation(line: 576, column: 3, scope: !1093)
!1239 = !DILocation(line: 577, column: 3, scope: !1050)
!1240 = !DILocation(line: 579, column: 7, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1050, file: !15, line: 579, column: 7)
!1242 = !DILocation(line: 579, column: 17, scope: !1241)
!1243 = !DILocation(line: 579, column: 54, scope: !1241)
!1244 = !DILocation(line: 579, column: 64, scope: !1241)
!1245 = !DILocation(line: 579, column: 23, scope: !1241)
!1246 = !DILocation(line: 581, column: 26, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1241, file: !15, line: 579, column: 70)
!1248 = !DILocation(line: 581, column: 4, scope: !1247)
!1249 = !DILocation(line: 581, column: 14, scope: !1247)
!1250 = !DILocation(line: 581, column: 23, scope: !1247)
!1251 = !DILocation(line: 582, column: 4, scope: !1247)
!1252 = !DILocation(line: 582, column: 14, scope: !1247)
!1253 = !DILocation(line: 582, column: 19, scope: !1247)
!1254 = !DILocation(line: 584, column: 4, scope: !1247)
!1255 = !DILocation(line: 584, column: 14, scope: !1247)
!1256 = !DILocation(line: 584, column: 20, scope: !1247)
!1257 = !DILocation(line: 585, column: 54, scope: !1247)
!1258 = !DILocation(line: 585, column: 64, scope: !1247)
!1259 = !DILocation(line: 585, column: 45, scope: !1247)
!1260 = !DILocation(line: 585, column: 4, scope: !1247)
!1261 = !DILocation(line: 588, column: 21, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1247, file: !15, line: 588, column: 8)
!1263 = !DILocation(line: 588, column: 8, scope: !1262)
!1264 = !DILocation(line: 588, column: 33, scope: !1262)
!1265 = !DILocation(line: 588, column: 48, scope: !1262)
!1266 = !DILocation(line: 588, column: 53, scope: !1262)
!1267 = !DILocation(line: 588, column: 69, scope: !1262)
!1268 = !DILocation(line: 588, column: 56, scope: !1262)
!1269 = !DILocation(line: 588, column: 81, scope: !1262)
!1270 = !DILocation(line: 588, column: 96, scope: !1262)
!1271 = !DILocalVariable(name: "type", scope: !1272, file: !15, line: 589, type: !5)
!1272 = distinct !DILexicalBlock(scope: !1262, file: !15, line: 588, column: 102)
!1273 = !DILocation(line: 589, column: 9, scope: !1272)
!1274 = !DILocalVariable(name: "flags", scope: !1272, file: !15, line: 590, type: !257)
!1275 = !DILocation(line: 590, column: 14, scope: !1272)
!1276 = !DILocalVariable(name: "legal_types", scope: !1272, file: !15, line: 591, type: !1277)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, elements: !1278)
!1278 = !{!1279}
!1279 = !DISubrange(count: 64)
!1280 = !DILocation(line: 591, column: 12, scope: !1272)
!1281 = !DILocalVariable(name: "num_types", scope: !1272, file: !15, line: 592, type: !5)
!1282 = !DILocation(line: 592, column: 9, scope: !1272)
!1283 = !DILocalVariable(name: "robot_index", scope: !1272, file: !15, line: 592, type: !5)
!1284 = !DILocation(line: 592, column: 20, scope: !1272)
!1285 = !DILocalVariable(name: "i", scope: !1272, file: !15, line: 592, type: !5)
!1286 = !DILocation(line: 592, column: 33, scope: !1272)
!1287 = !DILocation(line: 594, column: 15, scope: !1272)
!1288 = !DILocation(line: 595, column: 12, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1272, file: !15, line: 595, column: 5)
!1290 = !DILocation(line: 595, column: 10, scope: !1289)
!1291 = !DILocation(line: 595, column: 17, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1289, file: !15, line: 595, column: 5)
!1293 = !DILocation(line: 595, column: 19, scope: !1292)
!1294 = !DILocation(line: 595, column: 5, scope: !1289)
!1295 = !DILocation(line: 596, column: 20, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1292, file: !15, line: 595, column: 29)
!1297 = !DILocation(line: 596, column: 22, scope: !1296)
