; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/lighting.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/lighting.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.object = type { i32, i8, i8, i16, i16, i8, i8, i8, i8, i16, i16, %struct.vms_vector, %struct.vms_matrix, i32, i32, %struct.vms_vector, i8, i8, i8, i8, i32, %union.anon, %union.anon.0, %union.anon.1 }
%struct.vms_matrix = type { %struct.vms_vector, %struct.vms_vector, %struct.vms_vector }
%struct.vms_vector = type { i32, i32, i32 }
%union.anon = type { %struct.physics_info }
%struct.physics_info = type { %struct.vms_vector, %struct.vms_vector, i32, i32, i32, %struct.vms_vector, %struct.vms_vector, i16, i16 }
%union.anon.0 = type { %struct.ai_static }
%struct.ai_static = type { i8, [11 x i8], i16, i16, i16, i8, i8, i16, i32, i32 }
%union.anon.1 = type { %struct.polyobj_info }
%struct.polyobj_info = type { i32, [10 x %struct.vms_angvec], i32, i32, i32 }
%struct.vms_angvec = type { i16, i16, i16 }
%struct.segment = type { [6 x %struct.side], [6 x i16], [8 x i16], i32 }
%struct.side = type { i8, i8, i16, i16, i16, [4 x %struct.uvl], [2 x %struct.vms_vector] }
%struct.uvl = type { i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Do_dynamic_light", scope: !2, file: !24, line: 39, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !21, imports: !237, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "/Users/richard/code/ChocolateDescent/main_d2/lighting.cpp", directory: "/Users/richard/code/ChocolateDescent/build-c-ref", checksumkind: CSK_MD5, checksum: "3b1a75cc9164955a6e963098f4edea7e")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LogicVer", file: !6, line: 56, baseType: !7, size: 32, flags: DIFlagEnumClass, elements: !8, identifier: "_ZTS8LogicVer")
!6 = !DIFile(filename: "main_d2/inferno.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "f9bd7760bcc54609c0547a3a7ca7ee90")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "SHAREWARE", value: 0)
!10 = !DIEnumerator(name: "FULL_1_0", value: 1)
!11 = !DIEnumerator(name: "FULL_1_1", value: 2)
!12 = !DIEnumerator(name: "FULL_1_2", value: 3)
!13 = !{!14, !18}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "fix", file: !15, line: 20, baseType: !16)
!15 = !DIFile(filename: "./fix/fix.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c5006a11bf8b4cb7d963898499eda13a")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !17, line: 30, baseType: !7)
!17 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !19, line: 30, baseType: !20)
!19 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!20 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!21 = !{!0, !22, !28, !30, !35, !37, !39, !44, !52, !203, !205, !212, !217, !222, !224, !227, !230, !232, !234}
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "Dynamic_light", scope: !2, file: !24, line: 42, type: !25, isLocal: false, isDefinition: true)
!24 = !DIFile(filename: "main_d2/lighting.cpp", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "3b1a75cc9164955a6e963098f4edea7e")
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 115200, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 3600)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "Lighting_frame_delta", scope: !2, file: !24, line: 48, type: !7, isLocal: false, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "Lighting_cache", scope: !2, file: !24, line: 50, type: !32, isLocal: false, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 131072, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 4096)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "Cache_hits", scope: !2, file: !24, line: 52, type: !7, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "Cache_lookups", scope: !2, file: !24, line: 52, type: !7, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "Obj_light_xlate", scope: !2, file: !24, line: 356, type: !41, isLocal: false, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 16)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "Lighting_objects", scope: !2, file: !24, line: 363, type: !46, isLocal: false, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2800, elements: !50)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !48, line: 30, baseType: !49)
!48 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!49 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!50 = !{!51}
!51 = !DISubrange(count: 350)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "Headlights", scope: !2, file: !24, line: 366, type: !54, isLocal: false, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 512, elements: !201)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !57, line: 259, baseType: !58)
!57 = !DIFile(filename: "main_d2/object.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "1f2325d356aae4b692933d2aae4f3afd")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !57, line: 210, size: 2144, flags: DIFlagTypePassByValue, elements: !59, identifier: "_ZTS6object")
!59 = !{!60, !61, !65, !66, !68, !69, !70, !71, !72, !73, !74, !75, !83, !90, !91, !92, !93, !94, !95, !96, !97, !98, !119, !173}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !58, file: !57, line: 212, baseType: !7, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !57, line: 213, baseType: !62, size: 8, offset: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !63, line: 31, baseType: !64)
!63 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!64 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !58, file: !57, line: 214, baseType: !62, size: 8, offset: 40)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !57, line: 215, baseType: !67, size: 16, offset: 48)
!67 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !58, file: !57, line: 215, baseType: !67, size: 16, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !58, file: !57, line: 216, baseType: !62, size: 8, offset: 80)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "movement_type", scope: !58, file: !57, line: 217, baseType: !62, size: 8, offset: 88)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "render_type", scope: !58, file: !57, line: 218, baseType: !62, size: 8, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !57, line: 219, baseType: !62, size: 8, offset: 104)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !58, file: !57, line: 220, baseType: !67, size: 16, offset: 112)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "attached_obj", scope: !58, file: !57, line: 221, baseType: !67, size: 16, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !58, file: !57, line: 222, baseType: !76, size: 96, offset: 160)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_vector", file: !77, line: 22, baseType: !78)
!77 = !DIFile(filename: "./vecmat/vecmat.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "dfa84e3325c1ea4f5f74699fff5ef2bf")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_vector", file: !77, line: 19, size: 96, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTS10vms_vector")
!79 = !{!80, !81, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !78, file: !77, line: 21, baseType: !14, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !78, file: !77, line: 21, baseType: !14, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !78, file: !77, line: 21, baseType: !14, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "orient", scope: !58, file: !57, line: 223, baseType: !84, size: 288, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_matrix", file: !77, line: 47, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_matrix", file: !77, line: 44, size: 288, flags: DIFlagTypePassByValue, elements: !86, identifier: "_ZTS10vms_matrix")
!86 = !{!87, !88, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "rvec", scope: !85, file: !77, line: 46, baseType: !76, size: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "uvec", scope: !85, file: !77, line: 46, baseType: !76, size: 96, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "fvec", scope: !85, file: !77, line: 46, baseType: !76, size: 96, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !58, file: !57, line: 224, baseType: !14, size: 32, offset: 544)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "shields", scope: !58, file: !57, line: 225, baseType: !14, size: 32, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !58, file: !57, line: 226, baseType: !76, size: 96, offset: 608)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "contains_type", scope: !58, file: !57, line: 227, baseType: !47, size: 8, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "contains_id", scope: !58, file: !57, line: 228, baseType: !47, size: 8, offset: 712)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "contains_count", scope: !58, file: !57, line: 229, baseType: !47, size: 8, offset: 720)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "matcen_creator", scope: !58, file: !57, line: 230, baseType: !47, size: 8, offset: 728)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "lifeleft", scope: !58, file: !57, line: 231, baseType: !14, size: 32, offset: 736)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mtype", scope: !58, file: !57, line: 240, baseType: !99, size: 512, offset: 768)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !58, file: !57, line: 236, size: 512, flags: DIFlagTypePassByValue, elements: !100, identifier: "_ZTSN6objectUt_E")
!100 = !{!101, !118}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "phys_info", scope: !99, file: !57, line: 238, baseType: !102, size: 512)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "physics_info", file: !57, line: 153, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "physics_info", file: !57, line: 142, size: 512, flags: DIFlagTypePassByValue, elements: !104, identifier: "_ZTS12physics_info")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !114}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !103, file: !57, line: 144, baseType: !76, size: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "thrust", scope: !103, file: !57, line: 145, baseType: !76, size: 96, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !103, file: !57, line: 146, baseType: !14, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "drag", scope: !103, file: !57, line: 147, baseType: !14, size: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "brakes", scope: !103, file: !57, line: 148, baseType: !14, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rotvel", scope: !103, file: !57, line: 149, baseType: !76, size: 96, offset: 288)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rotthrust", scope: !103, file: !57, line: 150, baseType: !76, size: 96, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "turnroll", scope: !103, file: !57, line: 151, baseType: !113, size: 16, offset: 480)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixang", file: !15, line: 21, baseType: !67)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !103, file: !57, line: 152, baseType: !115, size: 16, offset: 496)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !116, line: 31, baseType: !117)
!116 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!117 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "spin_rate", scope: !99, file: !57, line: 239, baseType: !76, size: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !58, file: !57, line: 250, baseType: !120, size: 256, offset: 1280)
!120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !58, file: !57, line: 243, size: 256, flags: DIFlagTypePassByValue, elements: !121, identifier: "_ZTSN6objectUt0_E")
!121 = !{!122, !133, !143, !161, !166}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "laser_info", scope: !120, file: !57, line: 245, baseType: !123, size: 160)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "laser_info_t", file: !57, line: 166, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "laser_info_s", file: !57, line: 157, size: 160, flags: DIFlagTypePassByValue, elements: !125, identifier: "_ZTS12laser_info_s")
!125 = !{!126, !127, !128, !129, !130, !131, !132}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "parent_type", scope: !124, file: !57, line: 159, baseType: !67, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "parent_num", scope: !124, file: !57, line: 160, baseType: !67, size: 16, offset: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "parent_signature", scope: !124, file: !57, line: 161, baseType: !7, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !124, file: !57, line: 162, baseType: !14, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "last_hitobj", scope: !124, file: !57, line: 163, baseType: !67, size: 16, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "track_goal", scope: !124, file: !57, line: 164, baseType: !67, size: 16, offset: 112)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !124, file: !57, line: 165, baseType: !14, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "expl_info", scope: !120, file: !57, line: 246, baseType: !134, size: 128)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "explosion_info", file: !57, line: 176, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "explosion_info", file: !57, line: 168, size: 128, flags: DIFlagTypePassByValue, elements: !136, identifier: "_ZTS14explosion_info")
!136 = !{!137, !138, !139, !140, !141, !142}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "spawn_time", scope: !135, file: !57, line: 170, baseType: !14, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "delete_time", scope: !135, file: !57, line: 171, baseType: !14, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "delete_objnum", scope: !135, file: !57, line: 172, baseType: !67, size: 16, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "attach_parent", scope: !135, file: !57, line: 173, baseType: !67, size: 16, offset: 80)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prev_attach", scope: !135, file: !57, line: 174, baseType: !67, size: 16, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next_attach", scope: !135, file: !57, line: 175, baseType: !67, size: 16, offset: 112)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ai_info", scope: !120, file: !57, line: 247, baseType: !144, size: 256)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ai_static", file: !145, line: 144, baseType: !146)
!145 = !DIFile(filename: "main_d2/aistruct.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d122430e792a0ddc0f9eaa08ad217628")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ai_static", file: !145, line: 127, size: 256, flags: DIFlagTypePassByValue, elements: !147, identifier: "_ZTS9ai_static")
!147 = !{!148, !149, !153, !154, !155, !156, !157, !158, !159, !160}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "behavior", scope: !146, file: !145, line: 128, baseType: !62, size: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !145, line: 129, baseType: !150, size: 88, offset: 8)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 88, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 11)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "hide_segment", scope: !146, file: !145, line: 130, baseType: !67, size: 16, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "hide_index", scope: !146, file: !145, line: 131, baseType: !67, size: 16, offset: 112)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !146, file: !145, line: 132, baseType: !67, size: 16, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cur_path_index", scope: !146, file: !145, line: 133, baseType: !47, size: 8, offset: 144)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dying_sound_playing", scope: !146, file: !145, line: 134, baseType: !47, size: 8, offset: 152)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_num", scope: !146, file: !145, line: 139, baseType: !67, size: 16, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_signature", scope: !146, file: !145, line: 140, baseType: !7, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dying_start_time", scope: !146, file: !145, line: 141, baseType: !14, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "light_info", scope: !120, file: !57, line: 248, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "light_info_t", file: !57, line: 181, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "light_info_s", file: !57, line: 178, size: 32, flags: DIFlagTypePassByValue, elements: !164, identifier: "_ZTS12light_info_s")
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !163, file: !57, line: 180, baseType: !14, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "powerup_info", scope: !120, file: !57, line: 249, baseType: !167, size: 96)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "powerup_info_t", file: !57, line: 190, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "powerup_info_s", file: !57, line: 185, size: 96, flags: DIFlagTypePassByValue, elements: !169, identifier: "_ZTS14powerup_info_s")
!169 = !{!170, !171, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !168, file: !57, line: 187, baseType: !7, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !168, file: !57, line: 188, baseType: !14, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !168, file: !57, line: 189, baseType: !7, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !58, file: !57, line: 257, baseType: !174, size: 608, offset: 1536)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !58, file: !57, line: 253, size: 608, flags: DIFlagTypePassByValue, elements: !175, identifier: "_ZTSN6objectUt1_E")
!175 = !{!176, !194}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pobj_info", scope: !174, file: !57, line: 255, baseType: !177, size: 608)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "polyobj_info", file: !57, line: 208, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "polyobj_info", file: !57, line: 201, size: 608, flags: DIFlagTypePassByValue, elements: !179, identifier: "_ZTS12polyobj_info")
!179 = !{!180, !181, !191, !192, !193}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "model_num", scope: !178, file: !57, line: 203, baseType: !7, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "anim_angles", scope: !178, file: !57, line: 204, baseType: !182, size: 480, offset: 32)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 480, elements: !189)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_angvec", file: !77, line: 40, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_angvec", file: !77, line: 37, size: 48, flags: DIFlagTypePassByValue, elements: !185, identifier: "_ZTS10vms_angvec")
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !184, file: !77, line: 39, baseType: !113, size: 16)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !184, file: !77, line: 39, baseType: !113, size: 16, offset: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !184, file: !77, line: 39, baseType: !113, size: 16, offset: 32)
!189 = !{!190}
!190 = !DISubrange(count: 10)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "subobj_flags", scope: !178, file: !57, line: 205, baseType: !7, size: 32, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_override", scope: !178, file: !57, line: 206, baseType: !7, size: 32, offset: 544)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "alt_textures", scope: !178, file: !57, line: 207, baseType: !7, size: 32, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_info", scope: !174, file: !57, line: 256, baseType: !195, size: 96)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "vclip_info_t", file: !57, line: 197, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vclip_info_s", file: !57, line: 192, size: 96, flags: DIFlagTypePassByValue, elements: !197, identifier: "_ZTS12vclip_info_s")
!197 = !{!198, !199, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_num", scope: !196, file: !57, line: 194, baseType: !7, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "frametime", scope: !196, file: !57, line: 195, baseType: !14, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !196, file: !57, line: 196, baseType: !47, size: 8, offset: 64)
!201 = !{!202}
!202 = !DISubrange(count: 8)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "Num_headlights", scope: !2, file: !24, line: 367, type: !7, isLocal: false, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !24, line: 535, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 384, elements: !210)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!210 = !{!211}
!211 = !DISubrange(count: 48)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !24, line: 535, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 464, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 58)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !24, line: 544, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 576, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 72)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "Beam_brightness", scope: !2, file: !24, line: 631, type: !14, isLocal: false, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "object_light", scope: !2, file: !24, line: 695, type: !226, isLocal: false, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 11200, elements: !50)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "object_sig", scope: !2, file: !24, line: 696, type: !229, isLocal: false, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 11200, elements: !50)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "old_viewer", scope: !2, file: !24, line: 697, type: !55, isLocal: false, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "reset_lighting_hack", scope: !2, file: !24, line: 698, type: !7, isLocal: false, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!235 = distinct !DIGlobalVariable(name: "FRACBITS", scope: !2, file: !15, line: 18, type: !236, isLocal: true, isDefinition: true)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!237 = !{!238, !242, !245, !246, !247, !248, !249, !253, !257, !260, !262, !264, !266, !268, !270, !272, !274, !276, !278, !280, !282, !284, !286, !288, !290, !296, !300, !303, !306, !311, !317, !319, !321, !323, !325, !327, !329, !331, !333, !335, !337, !339, !341, !343, !348, !353, !358, !363, !365, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !390, !395, !399, !401, !405, !409, !422, !438, !439, !494, !503, !505, !513, !519, !523, !527, !529, !533, !537, !541, !545, !549, !553, !555, !557, !561, !567, !572, !576, !580, !584, !588, !592, !596, !600, !602, !604, !608, !610, !614, !618, !623, !625, !627, !629, !633, !637, !641, !643, !647, !649, !651, !653, !655, !661, !665, !667, !673, !678, !682, !686, !691, !696, !700, !704, !708, !712, !714, !716, !724, !726, !730, !734, !736, !738, !742, !746, !750, !752, !756, !761, !765, !769, !771, !773, !775, !777, !779, !781, !785, !789, !797, !799, !801, !803, !809, !811, !812, !813, !814, !817, !819, !824, !828, !830, !832, !836, !838, !840, !842, !844, !846, !848, !850, !855, !859, !861, !863, !864, !869, !871, !873, !875, !877, !879, !881, !883, !885, !887, !889, !891, !893, !895, !897, !899, !901, !905, !907, !909, !911, !915, !917, !921, !923, !925, !927, !929, !933, !935, !939, !943, !945, !947, !951, !953, !957, !959, !961, !965, !967, !969, !971, !973, !975, !977, !981, !983, !985, !987, !989, !991, !993, !995, !999, !1003, !1005, !1007, !1009, !1011, !1013, !1015, !1017, !1019, !1021, !1023, !1025, !1027, !1029, !1031, !1033, !1035, !1037, !1039, !1041, !1045, !1047, !1049, !1051, !1055, !1057, !1061, !1063, !1065, !1067, !1069, !1073, !1075, !1079, !1081, !1083, !1085, !1087, !1091, !1093, !1095, !1099, !1101, !1103, !1105, !1110, !1115, !1119, !1120, !1124, !1128, !1133, !1138, !1142, !1148, !1152, !1154, !1158, !1166, !1172, !1178, !1180, !1184, !1188, !1192, !1197, !1201, !1205, !1209, !1213, !1217, !1221, !1225, !1229, !1234, !1238, !1242, !1246, !1251, !1256, !1260, !1262, !1266, !1268, !1275, !1279, !1280, !1284, !1288, !1292, !1296, !1298, !1302, !1306, !1310, !1314, !1318, !1320, !1322, !1324, !1326, !1327, !1331, !1333, !1337, !1341, !1345, !1347, !1351, !1355, !1359, !1365, !1367, !1371, !1375, !1379, !1381, !1385, !1389, !1393, !1395, !1397, !1399, !1403, !1407, !1412, !1416, !1422, !1426, !1430, !1432, !1434, !1436, !1440, !1444, !1448, !1450, !1452, !1456, !1460, !1462, !1466, !1470, !1473, !1475, !1477}
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !47, file: !241, line: 158)
!239 = !DINamespace(name: "__1", scope: !240, exportSymbols: true)
!240 = !DINamespace(name: "std", scope: null)
!241 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdint", directory: "")
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !243, file: !241, line: 159)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !244, line: 30, baseType: !67)
!244 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !16, file: !241, line: 160)
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !18, file: !241, line: 161)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !62, file: !241, line: 163)
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !115, file: !241, line: 164)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !250, file: !241, line: 165)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !251, line: 31, baseType: !252)
!251 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!252 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !254, file: !241, line: 166)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !255, line: 31, baseType: !256)
!255 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!256 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !258, file: !241, line: 168)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !259, line: 29, baseType: !47)
!259 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !261, file: !241, line: 169)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !259, line: 30, baseType: !243)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !263, file: !241, line: 170)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !259, line: 31, baseType: !16)
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !265, file: !241, line: 171)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !259, line: 32, baseType: !18)
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !267, file: !241, line: 173)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !259, line: 33, baseType: !62)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !269, file: !241, line: 174)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !259, line: 34, baseType: !115)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !271, file: !241, line: 175)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !259, line: 35, baseType: !250)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !273, file: !241, line: 176)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !259, line: 36, baseType: !254)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !275, file: !241, line: 178)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !259, line: 40, baseType: !47)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !277, file: !241, line: 179)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !259, line: 41, baseType: !243)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !279, file: !241, line: 180)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !259, line: 42, baseType: !16)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !281, file: !241, line: 181)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !259, line: 43, baseType: !18)
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !283, file: !241, line: 183)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !259, line: 44, baseType: !62)
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !285, file: !241, line: 184)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !259, line: 45, baseType: !115)
!286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !287, file: !241, line: 185)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !259, line: 46, baseType: !250)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !289, file: !241, line: 186)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !259, line: 47, baseType: !254)
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !291, file: !241, line: 188)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !292, line: 32, baseType: !293)
!292 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !294, line: 40, baseType: !295)
!294 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!295 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !297, file: !241, line: 189)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !298, line: 34, baseType: !299)
!298 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!299 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !301, file: !241, line: 191)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !302, line: 32, baseType: !295)
!302 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !304, file: !241, line: 192)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !305, line: 32, baseType: !299)
!305 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !307, file: !310, line: 22)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !308, line: 16, baseType: !309)
!308 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/lib/clang/20/include/__stddef_max_align_t.h", directory: "", checksumkind: CSK_MD5, checksum: "3c0a2f19d136d39aa835c737c7105def")
!309 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!310 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__cstddef/max_align_t.h", directory: "")
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !312, file: !316, line: 113)
!312 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !313, file: !313, line: 217, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!313 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "b10215117a277691ffc4168ac4505796")
!314 = !DISubroutineType(types: !315)
!315 = !{!7, !7}
!316 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cctype", directory: "")
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !318, file: !316, line: 114)
!318 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !313, file: !313, line: 223, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !320, file: !316, line: 115)
!320 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !313, file: !313, line: 229, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !322, file: !316, line: 116)
!322 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !313, file: !313, line: 235, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !324, file: !316, line: 117)
!324 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !313, file: !313, line: 242, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !326, file: !316, line: 118)
!326 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !313, file: !313, line: 248, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !328, file: !316, line: 119)
!328 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !313, file: !313, line: 254, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !330, file: !316, line: 120)
!330 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !313, file: !313, line: 260, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !332, file: !316, line: 121)
!332 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !313, file: !313, line: 266, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !334, file: !316, line: 122)
!334 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !313, file: !313, line: 272, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !336, file: !316, line: 123)
!336 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !313, file: !313, line: 278, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !338, file: !316, line: 124)
!338 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !313, file: !313, line: 285, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !340, file: !316, line: 125)
!340 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !313, file: !313, line: 297, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !342, file: !316, line: 126)
!342 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !313, file: !313, line: 303, type: !314, flags: DIFlagPrototyped, spFlags: 0)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !344, file: !347, line: 75)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !345, line: 32, baseType: !346)
!345 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "6dfd3a3d5009054224653c03b2c2b6ac")
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !294, line: 111, baseType: !7)
!347 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwctype", directory: "")
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !349, file: !347, line: 76)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !350, line: 32, baseType: !351)
!350 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctrans_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70040c8494301cc74e19df26f4c1d76")
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !352, line: 44, baseType: !7)
!352 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "c789da493a5b476a3618b20a8fcff3c3")
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !354, file: !347, line: 77)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !355, line: 32, baseType: !356)
!355 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctype_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8d1720b82a490c742e6a297f971be2a2")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !352, line: 46, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !294, line: 36, baseType: !252)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !359, file: !347, line: 78)
!359 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !360, file: !360, line: 84, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/___wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "d5a8bf0b4062c20bda4d49376e5b44d9")
!361 = !DISubroutineType(types: !362)
!362 = !{!7, !344}
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !364, file: !347, line: 79)
!364 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !360, file: !360, line: 90, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !366, file: !347, line: 80)
!366 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !367, file: !367, line: 53, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "6bc93063cb32b00d3df790305c546a93")
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !369, file: !347, line: 81)
!369 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !360, file: !360, line: 96, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !371, file: !347, line: 82)
!371 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !360, file: !360, line: 108, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !373, file: !347, line: 83)
!373 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !360, file: !360, line: 114, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !375, file: !347, line: 84)
!375 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !360, file: !360, line: 120, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !377, file: !347, line: 85)
!377 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !360, file: !360, line: 126, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !379, file: !347, line: 86)
!379 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !360, file: !360, line: 132, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !381, file: !347, line: 87)
!381 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !360, file: !360, line: 138, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !383, file: !347, line: 88)
!383 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !360, file: !360, line: 144, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !385, file: !347, line: 89)
!385 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !360, file: !360, line: 150, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !387, file: !347, line: 90)
!387 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !360, file: !360, line: 102, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DISubroutineType(types: !389)
!389 = !{!7, !344, !354}
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !391, file: !347, line: 91)
!391 = !DISubprogram(name: "wctype", scope: !360, file: !360, line: 190, type: !392, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DISubroutineType(types: !393)
!393 = !{!354, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !396, file: !347, line: 92)
!396 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !360, file: !360, line: 156, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!397 = !DISubroutineType(types: !398)
!398 = !{!344, !344}
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !400, file: !347, line: 93)
!400 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !360, file: !360, line: 162, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !402, file: !347, line: 94)
!402 = !DISubprogram(name: "towctrans", scope: !367, file: !367, line: 124, type: !403, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DISubroutineType(types: !404)
!404 = !{!344, !344, !349}
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !406, file: !347, line: 95)
!406 = !DISubprogram(name: "wctrans", scope: !367, file: !367, line: 126, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DISubroutineType(types: !408)
!408 = !{!349, !394}
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !410, file: !421, line: 133)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !411, line: 32, baseType: !412)
!411 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8f920c8f4b68eb07504db5a6777c5466")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !294, line: 72, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !294, line: 70, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !294, line: 67, size: 1024, flags: DIFlagTypePassByValue, elements: !415, identifier: "_ZTS11__mbstate_t")
!415 = !{!416, !420}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !414, file: !294, line: 68, baseType: !417, size: 1024)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 1024, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !414, file: !294, line: 69, baseType: !20, size: 64)
!421 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwchar", directory: "")
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !423, file: !421, line: 134)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !424, line: 78, size: 448, flags: DIFlagTypePassByValue, elements: !425, identifier: "_ZTS2tm")
!424 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_time.h", directory: "", checksumkind: CSK_MD5, checksum: "e65eafd533c28a52a9094e430476b03e")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !423, file: !424, line: 79, baseType: !7, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !423, file: !424, line: 80, baseType: !7, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !423, file: !424, line: 81, baseType: !7, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !423, file: !424, line: 82, baseType: !7, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !423, file: !424, line: 83, baseType: !7, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !423, file: !424, line: 84, baseType: !7, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !423, file: !424, line: 85, baseType: !7, size: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !423, file: !424, line: 86, baseType: !7, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !423, file: !424, line: 87, baseType: !7, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !423, file: !424, line: 88, baseType: !295, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !423, file: !424, line: 89, baseType: !437, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !344, file: !421, line: 135)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !440, file: !421, line: 136)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !441, line: 162, baseType: !442)
!441 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "d91ebd7d161d9196cc100822ef0e5cdf")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !441, line: 131, size: 1216, flags: DIFlagTypePassByValue, elements: !443, identifier: "_ZTS7__sFILE")
!443 = !{!444, !446, !447, !448, !449, !450, !455, !456, !458, !462, !466, !474, !478, !479, !482, !483, !487, !491, !492, !493}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !442, file: !441, line: 132, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !442, file: !441, line: 133, baseType: !7, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !442, file: !441, line: 134, baseType: !7, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !442, file: !441, line: 135, baseType: !67, size: 16, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !442, file: !441, line: 136, baseType: !67, size: 16, offset: 144)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !442, file: !441, line: 137, baseType: !451, size: 128, offset: 192)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !441, line: 97, size: 128, flags: DIFlagTypePassByValue, elements: !452, identifier: "_ZTS6__sbuf")
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !451, file: !441, line: 98, baseType: !445, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !451, file: !441, line: 99, baseType: !7, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !442, file: !441, line: 138, baseType: !7, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !442, file: !441, line: 141, baseType: !457, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !442, file: !441, line: 142, baseType: !459, size: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!7, !457}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !442, file: !441, line: 143, baseType: !463, size: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!7, !457, !437, !7}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !442, file: !441, line: 144, baseType: !467, size: 64, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!470, !457, !470, !7}
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !441, line: 86, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !472, line: 83, baseType: !473)
!472 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !294, line: 37, baseType: !20)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !442, file: !441, line: 145, baseType: !475, size: 64, offset: 640)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!7, !457, !394, !7}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !442, file: !441, line: 148, baseType: !451, size: 128, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !442, file: !441, line: 149, baseType: !480, size: 64, offset: 832)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !441, line: 103, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS8__sFILEX")
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !442, file: !441, line: 150, baseType: !7, size: 32, offset: 896)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !442, file: !441, line: 153, baseType: !484, size: 24, offset: 928)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 24, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 3)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !442, file: !441, line: 154, baseType: !488, size: 8, offset: 952)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 1)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !442, file: !441, line: 157, baseType: !451, size: 128, offset: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !442, file: !441, line: 160, baseType: !7, size: 32, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !442, file: !441, line: 161, baseType: !470, size: 64, offset: 1152)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !495, file: !421, line: 137)
!495 = !DISubprogram(name: "fwprintf", scope: !496, file: !496, line: 107, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c0db33314388059ce7a1663adf1bfda0")
!497 = !DISubroutineType(types: !498)
!498 = !{!7, !499, !500, null}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!502 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !504, file: !421, line: 138)
!504 = !DISubprogram(name: "fwscanf", scope: !496, file: !496, line: 108, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !506, file: !421, line: 139)
!506 = !DISubprogram(name: "swprintf", scope: !496, file: !496, line: 120, type: !507, flags: DIFlagPrototyped, spFlags: 0)
!507 = !DISubroutineType(types: !508)
!508 = !{!7, !509, !510, !500, null}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !511, line: 50, baseType: !512)
!511 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !294, line: 87, baseType: !299)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !514, file: !421, line: 140)
!514 = !DISubprogram(name: "vfwprintf", scope: !496, file: !496, line: 124, type: !515, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DISubroutineType(types: !516)
!516 = !{!7, !499, !500, !517}
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !294, line: 95, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !24, baseType: !437)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !520, file: !421, line: 141)
!520 = !DISubprogram(name: "vswprintf", scope: !496, file: !496, line: 126, type: !521, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DISubroutineType(types: !522)
!522 = !{!7, !509, !510, !500, !517}
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !524, file: !421, line: 142)
!524 = !DISubprogram(name: "swscanf", scope: !496, file: !496, line: 122, type: !525, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DISubroutineType(types: !526)
!526 = !{!7, !500, !500, null}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !528, file: !421, line: 143)
!528 = !DISubprogram(name: "vfwscanf", scope: !496, file: !496, line: 195, type: !515, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !530, file: !421, line: 144)
!530 = !DISubprogram(name: "vswscanf", scope: !496, file: !496, line: 197, type: !531, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DISubroutineType(types: !532)
!532 = !{!7, !500, !500, !517}
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !534, file: !421, line: 145)
!534 = !DISubprogram(name: "fgetwc", scope: !496, file: !496, line: 100, type: !535, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DISubroutineType(types: !536)
!536 = !{!344, !499}
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !538, file: !421, line: 146)
!538 = !DISubprogram(name: "fgetws", scope: !496, file: !496, line: 102, type: !539, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DISubroutineType(types: !540)
!540 = !{!509, !509, !7, !499}
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !542, file: !421, line: 147)
!542 = !DISubprogram(name: "fputwc", scope: !496, file: !496, line: 104, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!344, !502, !499}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !546, file: !421, line: 148)
!546 = !DISubprogram(name: "fputws", scope: !496, file: !496, line: 105, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!7, !500, !499}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !550, file: !421, line: 149)
!550 = !DISubprogram(name: "fwide", scope: !496, file: !496, line: 106, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{!7, !499, !7}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !554, file: !421, line: 150)
!554 = !DISubprogram(name: "getwc", scope: !496, file: !496, line: 109, type: !535, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !556, file: !421, line: 151)
!556 = !DISubprogram(name: "putwc", scope: !496, file: !496, line: 118, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !558, file: !421, line: 152)
!558 = !DISubprogram(name: "ungetwc", scope: !496, file: !496, line: 123, type: !559, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DISubroutineType(types: !560)
!560 = !{!344, !344, !499}
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !562, file: !421, line: 153)
!562 = !DISubprogram(name: "wcstod", scope: !496, file: !496, line: 160, type: !563, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DISubroutineType(types: !564)
!564 = !{!565, !500, !566}
!565 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !568, file: !421, line: 154)
!568 = !DISubprogram(name: "wcstof", scope: !496, file: !496, line: 200, type: !569, flags: DIFlagPrototyped, spFlags: 0)
!569 = !DISubroutineType(types: !570)
!570 = !{!571, !500, !566}
!571 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !573, file: !421, line: 155)
!573 = !DISubprogram(name: "wcstold", scope: !496, file: !496, line: 202, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DISubroutineType(types: !575)
!575 = !{!309, !500, !566}
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !577, file: !421, line: 156)
!577 = !DISubprogram(name: "wcstol", scope: !496, file: !496, line: 164, type: !578, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DISubroutineType(types: !579)
!579 = !{!295, !500, !566, !7}
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !581, file: !421, line: 157)
!581 = !DISubprogram(name: "wcstoll", scope: !496, file: !496, line: 205, type: !582, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DISubroutineType(types: !583)
!583 = !{!20, !500, !566, !7}
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !585, file: !421, line: 158)
!585 = !DISubprogram(name: "wcstoul", scope: !496, file: !496, line: 167, type: !586, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{!299, !500, !566, !7}
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !589, file: !421, line: 159)
!589 = !DISubprogram(name: "wcstoull", scope: !496, file: !496, line: 207, type: !590, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DISubroutineType(types: !591)
!591 = !{!256, !500, !566, !7}
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !593, file: !421, line: 160)
!593 = !DISubprogram(name: "wcscpy", scope: !496, file: !496, line: 134, type: !594, flags: DIFlagPrototyped, spFlags: 0)
!594 = !DISubroutineType(types: !595)
!595 = !{!509, !509, !500}
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !597, file: !421, line: 161)
!597 = !DISubprogram(name: "wcsncpy", scope: !496, file: !496, line: 148, type: !598, flags: DIFlagPrototyped, spFlags: 0)
!598 = !DISubroutineType(types: !599)
!599 = !{!509, !509, !500, !510}
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !601, file: !421, line: 162)
!601 = !DISubprogram(name: "wcscat", scope: !496, file: !496, line: 130, type: !594, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !603, file: !421, line: 163)
!603 = !DISubprogram(name: "wcsncat", scope: !496, file: !496, line: 142, type: !598, flags: DIFlagPrototyped, spFlags: 0)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !605, file: !421, line: 164)
!605 = !DISubprogram(name: "wcscmp", scope: !496, file: !496, line: 132, type: !606, flags: DIFlagPrototyped, spFlags: 0)
!606 = !DISubroutineType(types: !607)
!607 = !{!7, !500, !500}
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !609, file: !421, line: 165)
!609 = !DISubprogram(name: "wcscoll", scope: !496, file: !496, line: 133, type: !606, flags: DIFlagPrototyped, spFlags: 0)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !611, file: !421, line: 166)
!611 = !DISubprogram(name: "wcsncmp", scope: !496, file: !496, line: 145, type: !612, flags: DIFlagPrototyped, spFlags: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{!7, !500, !500, !510}
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !615, file: !421, line: 167)
!615 = !DISubprogram(name: "wcsxfrm", scope: !496, file: !496, line: 157, type: !616, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DISubroutineType(types: !617)
!617 = !{!510, !509, !500, !510}
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !619, file: !421, line: 168)
!619 = !DISubprogram(name: "wcschr", linkageName: "_Z6wcschrB8ne200100Ua9enable_ifILb1EEPww", scope: !620, file: !620, line: 147, type: !621, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/wchar.h", directory: "")
!621 = !DISubroutineType(types: !622)
!622 = !{!509, !509, !502}
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !624, file: !421, line: 169)
!624 = !DISubprogram(name: "wcspbrk", linkageName: "_Z7wcspbrkB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !620, file: !620, line: 158, type: !594, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !626, file: !421, line: 170)
!626 = !DISubprogram(name: "wcsrchr", linkageName: "_Z7wcsrchrB8ne200100Ua9enable_ifILb1EEPww", scope: !620, file: !620, line: 168, type: !621, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !628, file: !421, line: 171)
!628 = !DISubprogram(name: "wcsstr", linkageName: "_Z6wcsstrB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !620, file: !620, line: 179, type: !594, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !630, file: !421, line: 172)
!630 = !DISubprogram(name: "wmemchr", linkageName: "_Z7wmemchrB8ne200100Ua9enable_ifILb1EEPwwm", scope: !620, file: !620, line: 190, type: !631, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DISubroutineType(types: !632)
!632 = !{!509, !509, !502, !510}
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !634, file: !421, line: 173)
!634 = !DISubprogram(name: "wcscspn", scope: !496, file: !496, line: 136, type: !635, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DISubroutineType(types: !636)
!636 = !{!510, !500, !500}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !638, file: !421, line: 174)
!638 = !DISubprogram(name: "wcslen", scope: !496, file: !496, line: 140, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DISubroutineType(types: !640)
!640 = !{!510, !500}
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !642, file: !421, line: 175)
!642 = !DISubprogram(name: "wcsspn", scope: !496, file: !496, line: 155, type: !635, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !644, file: !421, line: 176)
!644 = !DISubprogram(name: "wcstok", scope: !496, file: !496, line: 162, type: !645, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DISubroutineType(types: !646)
!646 = !{!509, !509, !500, !566}
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !648, file: !421, line: 177)
!648 = !DISubprogram(name: "wmemcmp", scope: !496, file: !496, line: 170, type: !612, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !650, file: !421, line: 178)
!650 = !DISubprogram(name: "wmemcpy", scope: !496, file: !496, line: 173, type: !598, flags: DIFlagPrototyped, spFlags: 0)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !652, file: !421, line: 179)
!652 = !DISubprogram(name: "wmemmove", scope: !496, file: !496, line: 176, type: !598, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !654, file: !421, line: 180)
!654 = !DISubprogram(name: "wmemset", scope: !496, file: !496, line: 179, type: !631, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !656, file: !421, line: 181)
!656 = !DISubprogram(name: "wcsftime", linkageName: "\01_wcsftime", scope: !496, file: !496, line: 137, type: !657, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DISubroutineType(types: !658)
!658 = !{!510, !509, !510, !500, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !662, file: !421, line: 182)
!662 = !DISubprogram(name: "btowc", scope: !496, file: !496, line: 99, type: !663, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DISubroutineType(types: !664)
!664 = !{!344, !7}
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !666, file: !421, line: 183)
!666 = !DISubprogram(name: "wctob", scope: !496, file: !496, line: 159, type: !361, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !668, file: !421, line: 184)
!668 = !DISubprogram(name: "mbsinit", scope: !496, file: !496, line: 115, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!7, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !674, file: !421, line: 185)
!674 = !DISubprogram(name: "mbrlen", scope: !496, file: !496, line: 111, type: !675, flags: DIFlagPrototyped, spFlags: 0)
!675 = !DISubroutineType(types: !676)
!676 = !{!510, !394, !510, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !679, file: !421, line: 186)
!679 = !DISubprogram(name: "mbrtowc", scope: !496, file: !496, line: 113, type: !680, flags: DIFlagPrototyped, spFlags: 0)
!680 = !DISubroutineType(types: !681)
!681 = !{!510, !509, !394, !510, !677}
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !683, file: !421, line: 187)
!683 = !DISubprogram(name: "wcrtomb", scope: !496, file: !496, line: 129, type: !684, flags: DIFlagPrototyped, spFlags: 0)
!684 = !DISubroutineType(types: !685)
!685 = !{!510, !437, !502, !677}
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !687, file: !421, line: 188)
!687 = !DISubprogram(name: "mbsrtowcs", scope: !496, file: !496, line: 116, type: !688, flags: DIFlagPrototyped, spFlags: 0)
!688 = !DISubroutineType(types: !689)
!689 = !{!510, !509, !690, !510, !677}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !692, file: !421, line: 189)
!692 = !DISubprogram(name: "wcsrtombs", scope: !496, file: !496, line: 153, type: !693, flags: DIFlagPrototyped, spFlags: 0)
!693 = !DISubroutineType(types: !694)
!694 = !{!510, !437, !695, !510, !677}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !697, file: !421, line: 191)
!697 = !DISubprogram(name: "getwchar", scope: !496, file: !496, line: 110, type: !698, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DISubroutineType(types: !699)
!699 = !{!344}
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !701, file: !421, line: 192)
!701 = !DISubprogram(name: "vwscanf", scope: !496, file: !496, line: 199, type: !702, flags: DIFlagPrototyped, spFlags: 0)
!702 = !DISubroutineType(types: !703)
!703 = !{!7, !500, !517}
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !705, file: !421, line: 193)
!705 = !DISubprogram(name: "wscanf", scope: !496, file: !496, line: 181, type: !706, flags: DIFlagPrototyped, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{!7, !500, null}
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !709, file: !421, line: 195)
!709 = !DISubprogram(name: "putwchar", scope: !496, file: !496, line: 119, type: !710, flags: DIFlagPrototyped, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{!344, !502}
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !713, file: !421, line: 196)
!713 = !DISubprogram(name: "vwprintf", scope: !496, file: !496, line: 128, type: !702, flags: DIFlagPrototyped, spFlags: 0)
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !715, file: !421, line: 197)
!715 = !DISubprogram(name: "wprintf", scope: !496, file: !496, line: 180, type: !706, flags: DIFlagPrototyped, spFlags: 0)
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !717, file: !723, line: 82)
!717 = !DISubprogram(name: "memcpy", scope: !718, file: !718, line: 78, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!718 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_string.h", directory: "", checksumkind: CSK_MD5, checksum: "c67be38c725261ca8572072ee1574b87")
!719 = !DISubroutineType(types: !720)
!720 = !{!457, !457, !721, !510}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!723 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstring", directory: "")
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !725, file: !723, line: 83)
!725 = !DISubprogram(name: "memmove", scope: !718, file: !718, line: 81, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !727, file: !723, line: 84)
!727 = !DISubprogram(name: "strcpy", scope: !718, file: !718, line: 92, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!728 = !DISubroutineType(types: !729)
!729 = !{!437, !437, !394}
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !731, file: !723, line: 85)
!731 = !DISubprogram(name: "strncpy", scope: !718, file: !718, line: 104, type: !732, flags: DIFlagPrototyped, spFlags: 0)
!732 = !DISubroutineType(types: !733)
!733 = !{!437, !437, !394, !510}
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !735, file: !723, line: 86)
!735 = !DISubprogram(name: "strcat", scope: !718, file: !718, line: 86, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !737, file: !723, line: 87)
!737 = !DISubprogram(name: "strncat", scope: !718, file: !718, line: 98, type: !732, flags: DIFlagPrototyped, spFlags: 0)
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !739, file: !723, line: 88)
!739 = !DISubprogram(name: "memcmp", scope: !718, file: !718, line: 75, type: !740, flags: DIFlagPrototyped, spFlags: 0)
!740 = !DISubroutineType(types: !741)
!741 = !{!7, !721, !721, !510}
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !743, file: !723, line: 89)
!743 = !DISubprogram(name: "strcmp", scope: !718, file: !718, line: 89, type: !744, flags: DIFlagPrototyped, spFlags: 0)
!744 = !DISubroutineType(types: !745)
!745 = !{!7, !394, !394}
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !747, file: !723, line: 90)
!747 = !DISubprogram(name: "strncmp", scope: !718, file: !718, line: 101, type: !748, flags: DIFlagPrototyped, spFlags: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{!7, !394, !394, !510}
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !751, file: !723, line: 91)
!751 = !DISubprogram(name: "strcoll", scope: !718, file: !718, line: 90, type: !744, flags: DIFlagPrototyped, spFlags: 0)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !753, file: !723, line: 92)
!753 = !DISubprogram(name: "strxfrm", scope: !718, file: !718, line: 112, type: !754, flags: DIFlagPrototyped, spFlags: 0)
!754 = !DISubroutineType(types: !755)
!755 = !{!510, !437, !394, !510}
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !757, file: !723, line: 93)
!757 = !DISubprogram(name: "memchr", linkageName: "_Z6memchrB8ne200100Ua9enable_ifILb1EEPvim", scope: !758, file: !758, line: 101, type: !759, flags: DIFlagPrototyped, spFlags: 0)
!758 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/string.h", directory: "")
!759 = !DISubroutineType(types: !760)
!760 = !{!457, !457, !7, !510}
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !762, file: !723, line: 94)
!762 = !DISubprogram(name: "strchr", linkageName: "_Z6strchrB8ne200100Ua9enable_ifILb1EEPci", scope: !758, file: !758, line: 80, type: !763, flags: DIFlagPrototyped, spFlags: 0)
!763 = !DISubroutineType(types: !764)
!764 = !{!437, !437, !7}
!765 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !766, file: !723, line: 95)
!766 = !DISubprogram(name: "strcspn", scope: !718, file: !718, line: 94, type: !767, flags: DIFlagPrototyped, spFlags: 0)
!767 = !DISubroutineType(types: !768)
!768 = !{!510, !394, !394}
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !770, file: !723, line: 96)
!770 = !DISubprogram(name: "strpbrk", linkageName: "_Z7strpbrkB8ne200100Ua9enable_ifILb1EEPcPKc", scope: !758, file: !758, line: 87, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !772, file: !723, line: 97)
!772 = !DISubprogram(name: "strrchr", linkageName: "_Z7strrchrB8ne200100Ua9enable_ifILb1EEPci", scope: !758, file: !758, line: 94, type: !763, flags: DIFlagPrototyped, spFlags: 0)
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !774, file: !723, line: 98)
!774 = !DISubprogram(name: "strspn", scope: !718, file: !718, line: 109, type: !767, flags: DIFlagPrototyped, spFlags: 0)
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !776, file: !723, line: 99)
!776 = !DISubprogram(name: "strstr", linkageName: "_Z6strstrB8ne200100Ua9enable_ifILb1EEPcPKc", scope: !758, file: !758, line: 108, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !778, file: !723, line: 100)
!778 = !DISubprogram(name: "strtok", scope: !718, file: !718, line: 111, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !780, file: !723, line: 101)
!780 = !DISubprogram(name: "memset", scope: !718, file: !718, line: 84, type: !759, flags: DIFlagPrototyped, spFlags: 0)
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !782, file: !723, line: 102)
!782 = !DISubprogram(name: "strerror", linkageName: "\01_strerror", scope: !718, file: !718, line: 95, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!437, !7}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !786, file: !723, line: 103)
!786 = !DISubprogram(name: "strlen", scope: !718, file: !718, line: 96, type: !787, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DISubroutineType(types: !788)
!788 = !{!510, !394}
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !790, file: !796, line: 422)
!790 = !DISubprogram(name: "isfinite", linkageName: "_ZNSt3__16__math8isfiniteB8ne200100Ee", scope: !792, file: !791, line: 79, type: !793, flags: DIFlagPrototyped, spFlags: 0)
!791 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__math/traits.h", directory: "")
!792 = !DINamespace(name: "__math", scope: !239)
!793 = !DISubroutineType(types: !794)
!794 = !{!795, !309}
!795 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!796 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/math.h", directory: "")
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !798, file: !796, line: 425)
!798 = !DISubprogram(name: "isinf", linkageName: "_ZNSt3__16__math5isinfB8ne200100Ee", scope: !792, file: !791, line: 103, type: !793, flags: DIFlagPrototyped, spFlags: 0)
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !800, file: !796, line: 429)
!800 = !DISubprogram(name: "isnan", linkageName: "_ZNSt3__16__math5isnanB8ne200100Ee", scope: !792, file: !791, line: 127, type: !793, flags: DIFlagPrototyped, spFlags: 0)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !802, file: !796, line: 430)
!802 = !DISubprogram(name: "isnormal", linkageName: "_ZNSt3__16__math8isnormalB8ne200100Ee", scope: !792, file: !791, line: 146, type: !793, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !804, file: !796, line: 485)
!804 = !DISubprogram(name: "modf", linkageName: "_ZNSt3__16__math4modfB8ne200100EePe", scope: !792, file: !805, line: 55, type: !806, flags: DIFlagPrototyped, spFlags: 0)
!805 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__math/modulo.h", directory: "")
!806 = !DISubroutineType(types: !807)
!807 = !{!309, !309, !808}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !790, file: !810, line: 352)
!810 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cmath", directory: "")
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !798, file: !810, line: 353)
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !800, file: !810, line: 354)
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !802, file: !810, line: 355)
!814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !815, file: !810, line: 364)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !816, line: 50, baseType: !571)
!816 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/math.h", directory: "", checksumkind: CSK_MD5, checksum: "35b1ff63542c2c0c144330dd9277d2dc")
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !818, file: !810, line: 365)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !816, line: 51, baseType: !565)
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !820, file: !810, line: 367)
!820 = !DISubprogram(name: "abs", linkageName: "_Z3absB8ne200100e", scope: !821, file: !821, line: 123, type: !822, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/stdlib.h", directory: "")
!822 = !DISubroutineType(types: !823)
!823 = !{!309, !309}
!824 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !825, file: !810, line: 370)
!825 = !DISubprogram(name: "acosf", scope: !816, file: !816, line: 314, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!826 = !DISubroutineType(types: !827)
!827 = !{!571, !571}
!828 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !829, file: !810, line: 372)
!829 = !DISubprogram(name: "asinf", scope: !816, file: !816, line: 318, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !831, file: !810, line: 374)
!831 = !DISubprogram(name: "atanf", scope: !816, file: !816, line: 322, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!832 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !833, file: !810, line: 376)
!833 = !DISubprogram(name: "atan2f", scope: !816, file: !816, line: 326, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!834 = !DISubroutineType(types: !835)
!835 = !{!571, !571, !571}
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !837, file: !810, line: 378)
!837 = !DISubprogram(name: "ceilf", scope: !816, file: !816, line: 461, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !839, file: !810, line: 380)
!839 = !DISubprogram(name: "cosf", scope: !816, file: !816, line: 330, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !841, file: !810, line: 382)
!841 = !DISubprogram(name: "coshf", scope: !816, file: !816, line: 354, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !843, file: !810, line: 385)
!843 = !DISubprogram(name: "expf", scope: !816, file: !816, line: 366, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !845, file: !810, line: 388)
!845 = !DISubprogram(name: "fabsf", scope: !816, file: !816, line: 422, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !847, file: !810, line: 390)
!847 = !DISubprogram(name: "floorf", scope: !816, file: !816, line: 465, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !849, file: !810, line: 393)
!849 = !DISubprogram(name: "fmodf", scope: !816, file: !816, line: 505, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !851, file: !810, line: 396)
!851 = !DISubprogram(name: "frexpf", scope: !816, file: !816, line: 406, type: !852, flags: DIFlagPrototyped, spFlags: 0)
!852 = !DISubroutineType(types: !853)
!853 = !{!571, !571, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !856, file: !810, line: 398)
!856 = !DISubprogram(name: "ldexpf", scope: !816, file: !816, line: 402, type: !857, flags: DIFlagPrototyped, spFlags: 0)
!857 = !DISubroutineType(types: !858)
!858 = !{!571, !571, !7}
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !860, file: !810, line: 401)
!860 = !DISubprogram(name: "logf", scope: !816, file: !816, line: 378, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !862, file: !810, line: 404)
!862 = !DISubprogram(name: "log10f", scope: !816, file: !816, line: 382, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !804, file: !810, line: 405)
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !865, file: !810, line: 406)
!865 = !DISubprogram(name: "modff", scope: !816, file: !816, line: 398, type: !866, flags: DIFlagPrototyped, spFlags: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{!571, !571, !868}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !870, file: !810, line: 409)
!870 = !DISubprogram(name: "powf", scope: !816, file: !816, line: 434, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !872, file: !810, line: 412)
!872 = !DISubprogram(name: "sinf", scope: !816, file: !816, line: 334, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !874, file: !810, line: 414)
!874 = !DISubprogram(name: "sinhf", scope: !816, file: !816, line: 358, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !876, file: !810, line: 417)
!876 = !DISubprogram(name: "sqrtf", scope: !816, file: !816, line: 438, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !878, file: !810, line: 419)
!878 = !DISubprogram(name: "tanf", scope: !816, file: !816, line: 338, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !880, file: !810, line: 422)
!880 = !DISubprogram(name: "tanhf", scope: !816, file: !816, line: 362, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !882, file: !810, line: 425)
!882 = !DISubprogram(name: "acoshf", scope: !816, file: !816, line: 342, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !884, file: !810, line: 427)
!884 = !DISubprogram(name: "asinhf", scope: !816, file: !816, line: 346, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !886, file: !810, line: 429)
!886 = !DISubprogram(name: "atanhf", scope: !816, file: !816, line: 350, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !888, file: !810, line: 431)
!888 = !DISubprogram(name: "cbrtf", scope: !816, file: !816, line: 426, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !890, file: !810, line: 434)
!890 = !DISubprogram(name: "copysignf", scope: !816, file: !816, line: 517, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !892, file: !810, line: 437)
!892 = !DISubprogram(name: "erff", scope: !816, file: !816, line: 442, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !894, file: !810, line: 439)
!894 = !DISubprogram(name: "erfcf", scope: !816, file: !816, line: 446, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!895 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !896, file: !810, line: 441)
!896 = !DISubprogram(name: "exp2f", scope: !816, file: !816, line: 370, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !898, file: !810, line: 443)
!898 = !DISubprogram(name: "expm1f", scope: !816, file: !816, line: 374, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!899 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !900, file: !810, line: 445)
!900 = !DISubprogram(name: "fdimf", scope: !816, file: !816, line: 533, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!901 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !902, file: !810, line: 446)
!902 = !DISubprogram(name: "fmaf", scope: !816, file: !816, line: 545, type: !903, flags: DIFlagPrototyped, spFlags: 0)
!903 = !DISubroutineType(types: !904)
!904 = !{!571, !571, !571, !571}
!905 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !906, file: !810, line: 449)
!906 = !DISubprogram(name: "fmaxf", scope: !816, file: !816, line: 537, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!907 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !908, file: !810, line: 451)
!908 = !DISubprogram(name: "fminf", scope: !816, file: !816, line: 541, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!909 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !910, file: !810, line: 453)
!910 = !DISubprogram(name: "hypotf", scope: !816, file: !816, line: 430, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!911 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !912, file: !810, line: 455)
!912 = !DISubprogram(name: "ilogbf", scope: !816, file: !816, line: 410, type: !913, flags: DIFlagPrototyped, spFlags: 0)
!913 = !DISubroutineType(types: !914)
!914 = !{!7, !571}
!915 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !916, file: !810, line: 457)
!916 = !DISubprogram(name: "lgammaf", scope: !816, file: !816, line: 453, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!917 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !918, file: !810, line: 459)
!918 = !DISubprogram(name: "llrintf", scope: !816, file: !816, line: 492, type: !919, flags: DIFlagPrototyped, spFlags: 0)
!919 = !DISubroutineType(types: !920)
!920 = !{!20, !571}
!921 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !922, file: !810, line: 461)
!922 = !DISubprogram(name: "llroundf", scope: !816, file: !816, line: 496, type: !919, flags: DIFlagPrototyped, spFlags: 0)
!923 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !924, file: !810, line: 463)
!924 = !DISubprogram(name: "log1pf", scope: !816, file: !816, line: 390, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!925 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !926, file: !810, line: 465)
!926 = !DISubprogram(name: "log2f", scope: !816, file: !816, line: 386, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!927 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !928, file: !810, line: 467)
!928 = !DISubprogram(name: "logbf", scope: !816, file: !816, line: 394, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!929 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !930, file: !810, line: 469)
!930 = !DISubprogram(name: "lrintf", scope: !816, file: !816, line: 477, type: !931, flags: DIFlagPrototyped, spFlags: 0)
!931 = !DISubroutineType(types: !932)
!932 = !{!295, !571}
!933 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !934, file: !810, line: 471)
!934 = !DISubprogram(name: "lroundf", scope: !816, file: !816, line: 485, type: !931, flags: DIFlagPrototyped, spFlags: 0)
!935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !936, file: !810, line: 473)
!936 = !DISubprogram(name: "nan", scope: !816, file: !816, line: 522, type: !937, flags: DIFlagPrototyped, spFlags: 0)
!937 = !DISubroutineType(types: !938)
!938 = !{!565, !394}
!939 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !940, file: !810, line: 474)
!940 = !DISubprogram(name: "nanf", scope: !816, file: !816, line: 521, type: !941, flags: DIFlagPrototyped, spFlags: 0)
!941 = !DISubroutineType(types: !942)
!942 = !{!571, !394}
!943 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !944, file: !810, line: 477)
!944 = !DISubprogram(name: "nearbyintf", scope: !816, file: !816, line: 469, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!945 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !946, file: !810, line: 479)
!946 = !DISubprogram(name: "nextafterf", scope: !816, file: !816, line: 525, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!947 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !948, file: !810, line: 481)
!948 = !DISubprogram(name: "nexttowardf", scope: !816, file: !816, line: 530, type: !949, flags: DIFlagPrototyped, spFlags: 0)
!949 = !DISubroutineType(types: !950)
!950 = !{!571, !571, !309}
!951 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !239, entity: !952, file: !810, line: 483)
!952 = !DISubprogram(name: "remainderf", scope: !816, file: !816, line: 509, type: !834, flags: DIFlagPrototyped, spFlags: 0)
