; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/weapon.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/weapon.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.weapon_info = type { i8, i8, i16, i16, i8, i8, i16, i8, i8, i16, i8, i8, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, %struct.bitmap_index, i32, i32, i32, [5 x i32], [5 x i32], i32, i32, i32, i32, i32, i32, i32, %struct.bitmap_index, %struct.bitmap_index }
%struct.bitmap_index = type { i16 }
%struct.player = type { [9 x i8], [4 x i8], i16, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i16, i16, i16, [10 x i16], [10 x i16], i16, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i32, i8, i8 }
%"class.std::__1::vector" = type { ptr, ptr, ptr }
%struct.object = type { i32, i8, i8, i16, i16, i8, i8, i8, i8, i16, i16, %struct.vms_vector, %struct.vms_matrix, i32, i32, %struct.vms_vector, i8, i8, i8, i8, i32, %union.anon, %union.anon.0, %union.anon.1 }
%struct.vms_matrix = type { %struct.vms_vector, %struct.vms_vector, %struct.vms_vector }
%struct.vms_vector = type { i32, i32, i32 }
%union.anon = type { %struct.physics_info }
%struct.physics_info = type { %struct.vms_vector, %struct.vms_vector, i32, i32, i32, %struct.vms_vector, %struct.vms_vector, i16, i16 }
%union.anon.0 = type { %struct.ai_static }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Primary_weapon_to_weapon_info", scope: !2, file: !22, line: 50, type: !23, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !19, imports: !308, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "/Users/richard/code/ChocolateDescent/main_d2/weapon.cpp", directory: "/Users/richard/code/ChocolateDescent/build-c-ref", checksumkind: CSK_MD5, checksum: "f672bdb9ea97684efd08dcc4baae2181")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LogicVer", file: !6, line: 56, baseType: !7, size: 32, flags: DIFlagEnumClass, elements: !8, identifier: "_ZTS8LogicVer")
!6 = !DIFile(filename: "main_d2/inferno.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "f9bd7760bcc54609c0547a3a7ca7ee90")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "SHAREWARE", value: 0)
!10 = !DIEnumerator(name: "FULL_1_0", value: 1)
!11 = !DIEnumerator(name: "FULL_1_1", value: 2)
!12 = !DIEnumerator(name: "FULL_1_2", value: 3)
!13 = !{!14, !16}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !17, line: 30, baseType: !18)
!17 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!18 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!19 = !{!0, !20, !29, !31, !34, !36, !38, !40, !108, !110, !112, !114, !119, !121, !123, !125, !127, !130, !136, !141, !146, !151, !153, !155, !160, !165, !170, !175, !180, !185, !188, !190, !195, !200, !203, !205, !210, !215, !220, !225, !227, !229, !234, !239, !244, !249, !251, !256, !259, !261, !263, !265, !267, !269, !271, !273, !275, !277, !282, !287, !289, !294, !299, !301, !303, !305}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "Secondary_weapon_to_weapon_info", scope: !2, file: !22, line: 51, type: !23, isLocal: false, isDefinition: true)
!22 = !DIFile(filename: "main_d2/weapon.cpp", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "f672bdb9ea97684efd08dcc4baae2181")
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 80, elements: !27)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 31, baseType: !26)
!25 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!26 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !{!28}
!28 = !DISubrange(count: 10)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "Secondary_weapon_to_gun_num", scope: !2, file: !22, line: 54, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "Primary_ammo_max", scope: !2, file: !22, line: 56, type: !33, isLocal: false, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 320, elements: !27)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "Secondary_ammo_max", scope: !2, file: !22, line: 57, type: !23, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "Primary_weapon_to_powerup", scope: !2, file: !22, line: 60, type: !23, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "Secondary_weapon_to_powerup", scope: !2, file: !22, line: 63, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "Weapon_info", scope: !2, file: !22, line: 65, type: !42, isLocal: false, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 71680, elements: !106)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "weapon_info", file: !44, line: 80, baseType: !45)
!44 = !DIFile(filename: "main_d2/weapon.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "a9e4f8b8f865fefc0854f8f4cf993ef2")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "weapon_info", file: !44, line: 24, size: 1024, flags: DIFlagTypePassByValue, elements: !46, identifier: "_ZTS11weapon_info")
!46 = !{!47, !51, !52, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !78, !79, !80, !89, !90, !91, !92, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "render_type", scope: !45, file: !44, line: 26, baseType: !48, size: 8)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !49, line: 30, baseType: !50)
!49 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!50 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "persistent", scope: !45, file: !44, line: 27, baseType: !48, size: 8, offset: 8)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "model_num", scope: !45, file: !44, line: 28, baseType: !53, size: 16, offset: 16)
!53 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "model_num_inner", scope: !45, file: !44, line: 29, baseType: !53, size: 16, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "flash_vclip", scope: !45, file: !44, line: 31, baseType: !48, size: 8, offset: 48)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "robot_hit_vclip", scope: !45, file: !44, line: 32, baseType: !48, size: 8, offset: 56)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flash_sound", scope: !45, file: !44, line: 33, baseType: !53, size: 16, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "wall_hit_vclip", scope: !45, file: !44, line: 35, baseType: !48, size: 8, offset: 80)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fire_count", scope: !45, file: !44, line: 36, baseType: !48, size: 8, offset: 88)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "robot_hit_sound", scope: !45, file: !44, line: 37, baseType: !53, size: 16, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ammo_usage", scope: !45, file: !44, line: 39, baseType: !48, size: 8, offset: 112)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "weapon_vclip", scope: !45, file: !44, line: 40, baseType: !48, size: 8, offset: 120)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "wall_hit_sound", scope: !45, file: !44, line: 41, baseType: !53, size: 16, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "destroyable", scope: !45, file: !44, line: 43, baseType: !48, size: 8, offset: 144)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "matter", scope: !45, file: !44, line: 44, baseType: !48, size: 8, offset: 152)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "bounce", scope: !45, file: !44, line: 45, baseType: !48, size: 8, offset: 160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "homing_flag", scope: !45, file: !44, line: 46, baseType: !48, size: 8, offset: 168)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "speedvar", scope: !45, file: !44, line: 48, baseType: !24, size: 8, offset: 176)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !45, file: !44, line: 50, baseType: !24, size: 8, offset: 184)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flash", scope: !45, file: !44, line: 52, baseType: !48, size: 8, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "afterburner_size", scope: !45, file: !44, line: 53, baseType: !48, size: 8, offset: 200)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !45, file: !44, line: 55, baseType: !48, size: 8, offset: 208)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "energy_usage", scope: !45, file: !44, line: 57, baseType: !74, size: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "fix", file: !75, line: 20, baseType: !76)
!75 = !DIFile(filename: "./fix/fix.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c5006a11bf8b4cb7d963898499eda13a")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !77, line: 30, baseType: !7)
!77 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fire_wait", scope: !45, file: !44, line: 58, baseType: !74, size: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "multi_damage_scale", scope: !45, file: !44, line: 60, baseType: !74, size: 32, offset: 288)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !45, file: !44, line: 62, baseType: !81, size: 16, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_index", file: !82, line: 40, baseType: !83)
!82 = !DIFile(filename: "./main_shared/piggy.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "5d74a9a5fcd56b04e1df3c49c8d4c571")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_index", file: !82, line: 37, size: 16, flags: DIFlagTypePassByValue, elements: !84, identifier: "_ZTS12bitmap_index")
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !83, file: !82, line: 39, baseType: !86, size: 16)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !87, line: 31, baseType: !88)
!87 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!88 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "blob_size", scope: !45, file: !44, line: 64, baseType: !74, size: 32, offset: 352)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flash_size", scope: !45, file: !44, line: 65, baseType: !74, size: 32, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "impact_size", scope: !45, file: !44, line: 66, baseType: !74, size: 32, offset: 416)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !45, file: !44, line: 67, baseType: !93, size: 160, offset: 448)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 160, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 5)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !45, file: !44, line: 68, baseType: !93, size: 160, offset: 608)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !45, file: !44, line: 69, baseType: !74, size: 32, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "drag", scope: !45, file: !44, line: 70, baseType: !74, size: 32, offset: 800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "thrust", scope: !45, file: !44, line: 71, baseType: !74, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "po_len_to_width_ratio", scope: !45, file: !44, line: 72, baseType: !74, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "light", scope: !45, file: !44, line: 73, baseType: !74, size: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "lifetime", scope: !45, file: !44, line: 74, baseType: !74, size: 32, offset: 928)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "damage_radius", scope: !45, file: !44, line: 75, baseType: !74, size: 32, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !45, file: !44, line: 78, baseType: !81, size: 16, offset: 992)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hires_picture", scope: !45, file: !44, line: 79, baseType: !81, size: 16, offset: 1008)
!106 = !{!107}
!107 = !DISubrange(count: 70)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "N_weapon_types", scope: !2, file: !22, line: 66, type: !7, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "Primary_weapon", scope: !2, file: !22, line: 67, type: !48, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "Secondary_weapon", scope: !2, file: !22, line: 67, type: !48, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "PrimaryOrder", scope: !2, file: !22, line: 71, type: !116, isLocal: false, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 88, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 11)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "SecondaryOrder", scope: !2, file: !22, line: 72, type: !116, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "DefaultPrimaryOrder", scope: !2, file: !22, line: 74, type: !116, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "DefaultSecondaryOrder", scope: !2, file: !22, line: 75, type: !116, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "Cycling", scope: !2, file: !22, line: 79, type: !24, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "Weapon_is_energy", scope: !2, file: !22, line: 116, type: !129, isLocal: false, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 560, elements: !106)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !22, line: 264, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 144, elements: !134)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!134 = !{!135}
!135 = !DISubrange(count: 18)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !22, line: 272, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 160, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 20)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !22, line: 360, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 120, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 15)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !22, line: 362, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 48, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 6)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "Primary_last_was_super", scope: !2, file: !22, line: 367, type: !23, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "Secondary_last_was_super", scope: !2, file: !22, line: 368, type: !23, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !22, line: 425, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 56, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 7)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !22, line: 428, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 64, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 8)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !22, line: 525, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 136, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 17)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !22, line: 525, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 448, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 56)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !22, line: 544, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 248, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 31)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !22, line: 560, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 32)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !22, line: 587, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 40, elements: !94)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !22, line: 589, type: !187, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !22, line: 591, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 240, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 30)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !22, line: 594, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 16, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 2)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !22, line: 627, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 88, elements: !117)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !22, line: 665, type: !162, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !22, line: 670, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 32, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 4)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !22, line: 685, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 488, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 61)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !22, line: 691, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 16)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !22, line: 691, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 264, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 33)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !22, line: 713, type: !132, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !22, line: 729, type: !182, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !22, line: 732, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 312, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 39)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !22, line: 747, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 272, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 34)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !22, line: 750, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 200, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 25)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !22, line: 751, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 328, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 41)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !22, line: 783, type: !132, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !22, line: 816, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 480, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 60)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "Smega_detonate_times", scope: !2, file: !22, line: 848, type: !258, isLocal: false, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 128, elements: !208)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "Seismic_tremor_magnitude", scope: !2, file: !22, line: 860, type: !74, isLocal: false, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "Next_seismic_sound_time", scope: !2, file: !22, line: 861, type: !74, isLocal: false, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "Seismic_sound_playing", scope: !2, file: !22, line: 862, type: !7, isLocal: false, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "Seismic_tremor_volume", scope: !2, file: !22, line: 863, type: !7, isLocal: false, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "Seismic_sound", scope: !2, file: !22, line: 865, type: !7, isLocal: false, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "Seismic_disturbance_start_time", scope: !2, file: !22, line: 932, type: !74, isLocal: false, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "Seismic_disturbance_end_time", scope: !2, file: !22, line: 932, type: !74, isLocal: false, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "Seismic_level", scope: !2, file: !22, line: 934, type: !7, isLocal: false, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "Super_mines_yes", scope: !2, file: !22, line: 1035, type: !7, isLocal: false, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !22, line: 1152, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 376, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 47)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !22, line: 1226, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 432, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 54)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !22, line: 1271, type: !236, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !22, line: 1275, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 12)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !22, line: 1325, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 232, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 29)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !22, line: 1333, type: !296, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "tactile_fire_duration", scope: !2, file: !22, line: 1400, type: !33, isLocal: false, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "tactile_fire_repeat", scope: !2, file: !22, line: 1401, type: !33, isLocal: false, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!306 = distinct !DIGlobalVariable(name: "FRACBITS", scope: !2, file: !75, line: 18, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!308 = !{!309, !313, !316, !317, !318, !319, !320, !324, !328, !331, !333, !335, !337, !339, !341, !343, !345, !347, !349, !351, !353, !355, !357, !359, !361, !367, !371, !374, !377, !382, !388, !390, !392, !394, !396, !398, !400, !402, !404, !406, !408, !410, !412, !414, !419, !424, !429, !434, !436, !439, !441, !443, !445, !447, !449, !451, !453, !455, !457, !461, !466, !470, !472, !476, !480, !493, !508, !509, !564, !573, !575, !583, !589, !593, !597, !599, !603, !607, !611, !615, !619, !623, !625, !627, !631, !637, !642, !646, !650, !654, !658, !662, !666, !670, !672, !674, !678, !680, !684, !688, !693, !695, !697, !699, !703, !707, !711, !713, !717, !719, !721, !723, !725, !731, !735, !737, !743, !748, !752, !756, !761, !766, !770, !774, !778, !782, !784, !786, !794, !800, !806, !810, !814, !818, !822, !827, !831, !835, !839, !843, !847, !851, !855, !859, !864, !868, !872, !876, !881, !886, !890, !892, !896, !898, !907, !911, !916, !920, !924, !928, !932, !934, !938, !942, !946, !950, !954, !956, !958, !960, !968, !970, !972, !974, !980, !982, !983, !984, !985, !988, !990, !991, !995, !997, !999, !1003, !1005, !1007, !1009, !1011, !1013, !1015, !1017, !1022, !1026, !1028, !1030, !1031, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1072, !1074, !1076, !1078, !1082, !1084, !1088, !1090, !1092, !1094, !1096, !1100, !1102, !1104, !1108, !1110, !1112, !1116, !1118, !1122, !1124, !1126, !1130, !1132, !1134, !1136, !1138, !1140, !1142, !1146, !1148, !1150, !1152, !1154, !1156, !1158, !1160, !1164, !1168, !1170, !1172, !1174, !1176, !1178, !1180, !1182, !1184, !1186, !1188, !1190, !1192, !1194, !1196, !1198, !1200, !1202, !1204, !1206, !1210, !1212, !1214, !1216, !1220, !1222, !1226, !1228, !1230, !1232, !1234, !1238, !1240, !1244, !1246, !1248, !1250, !1252, !1256, !1258, !1260, !1264, !1266, !1268, !1270, !1276, !1278, !1282, !1286, !1288, !1290, !1294, !1298, !1302, !1304, !1308, !1313, !1317, !1321, !1323, !1325, !1327, !1329, !1331, !1333, !1337, !1341, !1346, !1351, !1355, !1356, !1360, !1364, !1369, !1374, !1378, !1384, !1388, !1390, !1394, !1396, !1397, !1401, !1403, !1407, !1411, !1415, !1417, !1421, !1425, !1429, !1435, !1437, !1441, !1445, !1449, !1451, !1455, !1459, !1463, !1465, !1467, !1469, !1473, !1477, !1482, !1486, !1492, !1496, !1500, !1502, !1504, !1506, !1510, !1514, !1518, !1520, !1522, !1526, !1530, !1532, !1536, !1540, !1543, !1545, !1547, !1549, !1578, !1583, !1588}
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !48, file: !312, line: 158)
!310 = !DINamespace(name: "__1", scope: !311, exportSymbols: true)
!311 = !DINamespace(name: "std", scope: null)
!312 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdint", directory: "")
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !314, file: !312, line: 159)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !315, line: 30, baseType: !53)
!315 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !76, file: !312, line: 160)
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !16, file: !312, line: 161)
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !24, file: !312, line: 163)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !86, file: !312, line: 164)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !321, file: !312, line: 165)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !322, line: 31, baseType: !323)
!322 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!323 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !325, file: !312, line: 166)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !326, line: 31, baseType: !327)
!326 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!327 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !329, file: !312, line: 168)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !330, line: 29, baseType: !48)
!330 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !332, file: !312, line: 169)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !330, line: 30, baseType: !314)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !334, file: !312, line: 170)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !330, line: 31, baseType: !76)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !336, file: !312, line: 171)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !330, line: 32, baseType: !16)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !338, file: !312, line: 173)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !330, line: 33, baseType: !24)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !340, file: !312, line: 174)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !330, line: 34, baseType: !86)
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !342, file: !312, line: 175)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !330, line: 35, baseType: !321)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !344, file: !312, line: 176)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !330, line: 36, baseType: !325)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !346, file: !312, line: 178)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !330, line: 40, baseType: !48)
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !348, file: !312, line: 179)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !330, line: 41, baseType: !314)
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !350, file: !312, line: 180)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !330, line: 42, baseType: !76)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !352, file: !312, line: 181)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !330, line: 43, baseType: !16)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !354, file: !312, line: 183)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !330, line: 44, baseType: !24)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !356, file: !312, line: 184)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !330, line: 45, baseType: !86)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !358, file: !312, line: 185)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !330, line: 46, baseType: !321)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !360, file: !312, line: 186)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !330, line: 47, baseType: !325)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !362, file: !312, line: 188)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !363, line: 32, baseType: !364)
!363 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !365, line: 40, baseType: !366)
!365 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!366 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !368, file: !312, line: 189)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !369, line: 34, baseType: !370)
!369 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!370 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !372, file: !312, line: 191)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !373, line: 32, baseType: !366)
!373 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !375, file: !312, line: 192)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !376, line: 32, baseType: !370)
!376 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !378, file: !381, line: 22)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !379, line: 16, baseType: !380)
!379 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/lib/clang/20/include/__stddef_max_align_t.h", directory: "", checksumkind: CSK_MD5, checksum: "3c0a2f19d136d39aa835c737c7105def")
!380 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!381 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__cstddef/max_align_t.h", directory: "")
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !383, file: !387, line: 113)
!383 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !384, file: !384, line: 217, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "b10215117a277691ffc4168ac4505796")
!385 = !DISubroutineType(types: !386)
!386 = !{!7, !7}
!387 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cctype", directory: "")
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !389, file: !387, line: 114)
!389 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !384, file: !384, line: 223, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !391, file: !387, line: 115)
!391 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !384, file: !384, line: 229, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !393, file: !387, line: 116)
!393 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !384, file: !384, line: 235, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !395, file: !387, line: 117)
!395 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !384, file: !384, line: 242, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !397, file: !387, line: 118)
!397 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !384, file: !384, line: 248, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !399, file: !387, line: 119)
!399 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !384, file: !384, line: 254, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !401, file: !387, line: 120)
!401 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !384, file: !384, line: 260, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !403, file: !387, line: 121)
!403 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !384, file: !384, line: 266, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !405, file: !387, line: 122)
!405 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !384, file: !384, line: 272, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !407, file: !387, line: 123)
!407 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !384, file: !384, line: 278, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !409, file: !387, line: 124)
!409 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !384, file: !384, line: 285, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !411, file: !387, line: 125)
!411 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !384, file: !384, line: 297, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !413, file: !387, line: 126)
!413 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !384, file: !384, line: 303, type: !385, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !415, file: !418, line: 75)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !416, line: 32, baseType: !417)
!416 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "6dfd3a3d5009054224653c03b2c2b6ac")
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !365, line: 111, baseType: !7)
!418 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwctype", directory: "")
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !420, file: !418, line: 76)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !421, line: 32, baseType: !422)
!421 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctrans_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70040c8494301cc74e19df26f4c1d76")
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !423, line: 44, baseType: !7)
!423 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "c789da493a5b476a3618b20a8fcff3c3")
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !425, file: !418, line: 77)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !426, line: 32, baseType: !427)
!426 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctype_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8d1720b82a490c742e6a297f971be2a2")
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !423, line: 46, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !365, line: 36, baseType: !323)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !430, file: !418, line: 78)
!430 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !431, file: !431, line: 84, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/___wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "d5a8bf0b4062c20bda4d49376e5b44d9")
!432 = !DISubroutineType(types: !433)
!433 = !{!7, !415}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !435, file: !418, line: 79)
!435 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !431, file: !431, line: 90, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !437, file: !418, line: 80)
!437 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !438, file: !438, line: 53, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "6bc93063cb32b00d3df790305c546a93")
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !440, file: !418, line: 81)
!440 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !431, file: !431, line: 96, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !442, file: !418, line: 82)
!442 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !431, file: !431, line: 108, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !444, file: !418, line: 83)
!444 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !431, file: !431, line: 114, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !446, file: !418, line: 84)
!446 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !431, file: !431, line: 120, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !448, file: !418, line: 85)
!448 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !431, file: !431, line: 126, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !450, file: !418, line: 86)
!450 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !431, file: !431, line: 132, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !452, file: !418, line: 87)
!452 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !431, file: !431, line: 138, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !454, file: !418, line: 88)
!454 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !431, file: !431, line: 144, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !456, file: !418, line: 89)
!456 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !431, file: !431, line: 150, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !458, file: !418, line: 90)
!458 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !431, file: !431, line: 102, type: !459, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DISubroutineType(types: !460)
!460 = !{!7, !415, !425}
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !462, file: !418, line: 91)
!462 = !DISubprogram(name: "wctype", scope: !431, file: !431, line: 190, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DISubroutineType(types: !464)
!464 = !{!425, !465}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !467, file: !418, line: 92)
!467 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !431, file: !431, line: 156, type: !468, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DISubroutineType(types: !469)
!469 = !{!415, !415}
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !471, file: !418, line: 93)
!471 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !431, file: !431, line: 162, type: !468, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !473, file: !418, line: 94)
!473 = !DISubprogram(name: "towctrans", scope: !438, file: !438, line: 124, type: !474, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DISubroutineType(types: !475)
!475 = !{!415, !415, !420}
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !477, file: !418, line: 95)
!477 = !DISubprogram(name: "wctrans", scope: !438, file: !438, line: 126, type: !478, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DISubroutineType(types: !479)
!479 = !{!420, !465}
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !481, file: !492, line: 133)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !482, line: 32, baseType: !483)
!482 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8f920c8f4b68eb07504db5a6777c5466")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !365, line: 72, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !365, line: 70, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !365, line: 67, size: 1024, flags: DIFlagTypePassByValue, elements: !486, identifier: "_ZTS11__mbstate_t")
!486 = !{!487, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !485, file: !365, line: 68, baseType: !488, size: 1024)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1024, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !485, file: !365, line: 69, baseType: !18, size: 64)
!492 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwchar", directory: "")
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !494, file: !492, line: 134)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !495, line: 78, size: 448, flags: DIFlagTypePassByValue, elements: !496, identifier: "_ZTS2tm")
!495 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_time.h", directory: "", checksumkind: CSK_MD5, checksum: "e65eafd533c28a52a9094e430476b03e")
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !494, file: !495, line: 79, baseType: !7, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !494, file: !495, line: 80, baseType: !7, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !494, file: !495, line: 81, baseType: !7, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !494, file: !495, line: 82, baseType: !7, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !494, file: !495, line: 83, baseType: !7, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !494, file: !495, line: 84, baseType: !7, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !494, file: !495, line: 85, baseType: !7, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !494, file: !495, line: 86, baseType: !7, size: 32, offset: 224)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !494, file: !495, line: 87, baseType: !7, size: 32, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !494, file: !495, line: 88, baseType: !366, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !494, file: !495, line: 89, baseType: !14, size: 64, offset: 384)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !415, file: !492, line: 135)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !510, file: !492, line: 136)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !511, line: 162, baseType: !512)
!511 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "d91ebd7d161d9196cc100822ef0e5cdf")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !511, line: 131, size: 1216, flags: DIFlagTypePassByValue, elements: !513, identifier: "_ZTS7__sFILE")
!513 = !{!514, !516, !517, !518, !519, !520, !525, !526, !528, !532, !536, !544, !548, !549, !552, !553, !557, !561, !562, !563}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !512, file: !511, line: 132, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !512, file: !511, line: 133, baseType: !7, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !512, file: !511, line: 134, baseType: !7, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !512, file: !511, line: 135, baseType: !53, size: 16, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !512, file: !511, line: 136, baseType: !53, size: 16, offset: 144)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !512, file: !511, line: 137, baseType: !521, size: 128, offset: 192)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !511, line: 97, size: 128, flags: DIFlagTypePassByValue, elements: !522, identifier: "_ZTS6__sbuf")
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !521, file: !511, line: 98, baseType: !515, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !521, file: !511, line: 99, baseType: !7, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !512, file: !511, line: 138, baseType: !7, size: 32, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !512, file: !511, line: 141, baseType: !527, size: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !512, file: !511, line: 142, baseType: !529, size: 64, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!7, !527}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !512, file: !511, line: 143, baseType: !533, size: 64, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!7, !527, !14, !7}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !512, file: !511, line: 144, baseType: !537, size: 64, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !527, !540, !7}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !511, line: 86, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !542, line: 83, baseType: !543)
!542 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !365, line: 37, baseType: !18)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !512, file: !511, line: 145, baseType: !545, size: 64, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!7, !527, !465, !7}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !512, file: !511, line: 148, baseType: !521, size: 128, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !512, file: !511, line: 149, baseType: !550, size: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !511, line: 103, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS8__sFILEX")
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !512, file: !511, line: 150, baseType: !7, size: 32, offset: 896)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !512, file: !511, line: 153, baseType: !554, size: 24, offset: 928)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 24, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 3)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !512, file: !511, line: 154, baseType: !558, size: 8, offset: 952)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 1)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !512, file: !511, line: 157, baseType: !521, size: 128, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !512, file: !511, line: 160, baseType: !7, size: 32, offset: 1088)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !512, file: !511, line: 161, baseType: !540, size: 64, offset: 1152)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !565, file: !492, line: 137)
!565 = !DISubprogram(name: "fwprintf", scope: !566, file: !566, line: 107, type: !567, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c0db33314388059ce7a1663adf1bfda0")
!567 = !DISubroutineType(types: !568)
!568 = !{!7, !569, !570, null}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !574, file: !492, line: 138)
!574 = !DISubprogram(name: "fwscanf", scope: !566, file: !566, line: 108, type: !567, flags: DIFlagPrototyped, spFlags: 0)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !576, file: !492, line: 139)
!576 = !DISubprogram(name: "swprintf", scope: !566, file: !566, line: 120, type: !577, flags: DIFlagPrototyped, spFlags: 0)
!577 = !DISubroutineType(types: !578)
!578 = !{!7, !579, !580, !570, null}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !581, line: 50, baseType: !582)
!581 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !365, line: 87, baseType: !370)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !584, file: !492, line: 140)
!584 = !DISubprogram(name: "vfwprintf", scope: !566, file: !566, line: 124, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!585 = !DISubroutineType(types: !586)
!586 = !{!7, !569, !570, !587}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !365, line: 95, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !22, baseType: !14)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !590, file: !492, line: 141)
!590 = !DISubprogram(name: "vswprintf", scope: !566, file: !566, line: 126, type: !591, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DISubroutineType(types: !592)
!592 = !{!7, !579, !580, !570, !587}
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !594, file: !492, line: 142)
!594 = !DISubprogram(name: "swscanf", scope: !566, file: !566, line: 122, type: !595, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DISubroutineType(types: !596)
!596 = !{!7, !570, !570, null}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !598, file: !492, line: 143)
!598 = !DISubprogram(name: "vfwscanf", scope: !566, file: !566, line: 195, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !600, file: !492, line: 144)
!600 = !DISubprogram(name: "vswscanf", scope: !566, file: !566, line: 197, type: !601, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DISubroutineType(types: !602)
!602 = !{!7, !570, !570, !587}
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !604, file: !492, line: 145)
!604 = !DISubprogram(name: "fgetwc", scope: !566, file: !566, line: 100, type: !605, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DISubroutineType(types: !606)
!606 = !{!415, !569}
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !608, file: !492, line: 146)
!608 = !DISubprogram(name: "fgetws", scope: !566, file: !566, line: 102, type: !609, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DISubroutineType(types: !610)
!610 = !{!579, !579, !7, !569}
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !612, file: !492, line: 147)
!612 = !DISubprogram(name: "fputwc", scope: !566, file: !566, line: 104, type: !613, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DISubroutineType(types: !614)
!614 = !{!415, !572, !569}
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !616, file: !492, line: 148)
!616 = !DISubprogram(name: "fputws", scope: !566, file: !566, line: 105, type: !617, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DISubroutineType(types: !618)
!618 = !{!7, !570, !569}
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !620, file: !492, line: 149)
!620 = !DISubprogram(name: "fwide", scope: !566, file: !566, line: 106, type: !621, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DISubroutineType(types: !622)
!622 = !{!7, !569, !7}
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !624, file: !492, line: 150)
!624 = !DISubprogram(name: "getwc", scope: !566, file: !566, line: 109, type: !605, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !626, file: !492, line: 151)
!626 = !DISubprogram(name: "putwc", scope: !566, file: !566, line: 118, type: !613, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !628, file: !492, line: 152)
!628 = !DISubprogram(name: "ungetwc", scope: !566, file: !566, line: 123, type: !629, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DISubroutineType(types: !630)
!630 = !{!415, !415, !569}
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !632, file: !492, line: 153)
!632 = !DISubprogram(name: "wcstod", scope: !566, file: !566, line: 160, type: !633, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DISubroutineType(types: !634)
!634 = !{!635, !570, !636}
!635 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !638, file: !492, line: 154)
!638 = !DISubprogram(name: "wcstof", scope: !566, file: !566, line: 200, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !570, !636}
!641 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !643, file: !492, line: 155)
!643 = !DISubprogram(name: "wcstold", scope: !566, file: !566, line: 202, type: !644, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{!380, !570, !636}
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !647, file: !492, line: 156)
!647 = !DISubprogram(name: "wcstol", scope: !566, file: !566, line: 164, type: !648, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DISubroutineType(types: !649)
!649 = !{!366, !570, !636, !7}
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !651, file: !492, line: 157)
!651 = !DISubprogram(name: "wcstoll", scope: !566, file: !566, line: 205, type: !652, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DISubroutineType(types: !653)
!653 = !{!18, !570, !636, !7}
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !655, file: !492, line: 158)
!655 = !DISubprogram(name: "wcstoul", scope: !566, file: !566, line: 167, type: !656, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DISubroutineType(types: !657)
!657 = !{!370, !570, !636, !7}
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !659, file: !492, line: 159)
!659 = !DISubprogram(name: "wcstoull", scope: !566, file: !566, line: 207, type: !660, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DISubroutineType(types: !661)
!661 = !{!327, !570, !636, !7}
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !663, file: !492, line: 160)
!663 = !DISubprogram(name: "wcscpy", scope: !566, file: !566, line: 134, type: !664, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DISubroutineType(types: !665)
!665 = !{!579, !579, !570}
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !667, file: !492, line: 161)
!667 = !DISubprogram(name: "wcsncpy", scope: !566, file: !566, line: 148, type: !668, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DISubroutineType(types: !669)
!669 = !{!579, !579, !570, !580}
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !671, file: !492, line: 162)
!671 = !DISubprogram(name: "wcscat", scope: !566, file: !566, line: 130, type: !664, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !673, file: !492, line: 163)
!673 = !DISubprogram(name: "wcsncat", scope: !566, file: !566, line: 142, type: !668, flags: DIFlagPrototyped, spFlags: 0)
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !675, file: !492, line: 164)
!675 = !DISubprogram(name: "wcscmp", scope: !566, file: !566, line: 132, type: !676, flags: DIFlagPrototyped, spFlags: 0)
!676 = !DISubroutineType(types: !677)
!677 = !{!7, !570, !570}
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !679, file: !492, line: 165)
!679 = !DISubprogram(name: "wcscoll", scope: !566, file: !566, line: 133, type: !676, flags: DIFlagPrototyped, spFlags: 0)
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !681, file: !492, line: 166)
!681 = !DISubprogram(name: "wcsncmp", scope: !566, file: !566, line: 145, type: !682, flags: DIFlagPrototyped, spFlags: 0)
!682 = !DISubroutineType(types: !683)
!683 = !{!7, !570, !570, !580}
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !685, file: !492, line: 167)
!685 = !DISubprogram(name: "wcsxfrm", scope: !566, file: !566, line: 157, type: !686, flags: DIFlagPrototyped, spFlags: 0)
!686 = !DISubroutineType(types: !687)
!687 = !{!580, !579, !570, !580}
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !689, file: !492, line: 168)
!689 = !DISubprogram(name: "wcschr", linkageName: "_Z6wcschrB8ne200100Ua9enable_ifILb1EEPww", scope: !690, file: !690, line: 147, type: !691, flags: DIFlagPrototyped, spFlags: 0)
!690 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/wchar.h", directory: "")
!691 = !DISubroutineType(types: !692)
!692 = !{!579, !579, !572}
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !694, file: !492, line: 169)
!694 = !DISubprogram(name: "wcspbrk", linkageName: "_Z7wcspbrkB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !690, file: !690, line: 158, type: !664, flags: DIFlagPrototyped, spFlags: 0)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !696, file: !492, line: 170)
!696 = !DISubprogram(name: "wcsrchr", linkageName: "_Z7wcsrchrB8ne200100Ua9enable_ifILb1EEPww", scope: !690, file: !690, line: 168, type: !691, flags: DIFlagPrototyped, spFlags: 0)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !698, file: !492, line: 171)
!698 = !DISubprogram(name: "wcsstr", linkageName: "_Z6wcsstrB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !690, file: !690, line: 179, type: !664, flags: DIFlagPrototyped, spFlags: 0)
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !700, file: !492, line: 172)
!700 = !DISubprogram(name: "wmemchr", linkageName: "_Z7wmemchrB8ne200100Ua9enable_ifILb1EEPwwm", scope: !690, file: !690, line: 190, type: !701, flags: DIFlagPrototyped, spFlags: 0)
!701 = !DISubroutineType(types: !702)
!702 = !{!579, !579, !572, !580}
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !704, file: !492, line: 173)
!704 = !DISubprogram(name: "wcscspn", scope: !566, file: !566, line: 136, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!705 = !DISubroutineType(types: !706)
!706 = !{!580, !570, !570}
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !708, file: !492, line: 174)
!708 = !DISubprogram(name: "wcslen", scope: !566, file: !566, line: 140, type: !709, flags: DIFlagPrototyped, spFlags: 0)
!709 = !DISubroutineType(types: !710)
!710 = !{!580, !570}
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !712, file: !492, line: 175)
!712 = !DISubprogram(name: "wcsspn", scope: !566, file: !566, line: 155, type: !705, flags: DIFlagPrototyped, spFlags: 0)
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !714, file: !492, line: 176)
!714 = !DISubprogram(name: "wcstok", scope: !566, file: !566, line: 162, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{!579, !579, !570, !636}
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !718, file: !492, line: 177)
!718 = !DISubprogram(name: "wmemcmp", scope: !566, file: !566, line: 170, type: !682, flags: DIFlagPrototyped, spFlags: 0)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !720, file: !492, line: 178)
!720 = !DISubprogram(name: "wmemcpy", scope: !566, file: !566, line: 173, type: !668, flags: DIFlagPrototyped, spFlags: 0)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !722, file: !492, line: 179)
!722 = !DISubprogram(name: "wmemmove", scope: !566, file: !566, line: 176, type: !668, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !724, file: !492, line: 180)
!724 = !DISubprogram(name: "wmemset", scope: !566, file: !566, line: 179, type: !701, flags: DIFlagPrototyped, spFlags: 0)
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !726, file: !492, line: 181)
!726 = !DISubprogram(name: "wcsftime", linkageName: "\01_wcsftime", scope: !566, file: !566, line: 137, type: !727, flags: DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{!580, !579, !580, !570, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !732, file: !492, line: 182)
!732 = !DISubprogram(name: "btowc", scope: !566, file: !566, line: 99, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DISubroutineType(types: !734)
!734 = !{!415, !7}
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !736, file: !492, line: 183)
!736 = !DISubprogram(name: "wctob", scope: !566, file: !566, line: 159, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !738, file: !492, line: 184)
!738 = !DISubprogram(name: "mbsinit", scope: !566, file: !566, line: 115, type: !739, flags: DIFlagPrototyped, spFlags: 0)
!739 = !DISubroutineType(types: !740)
!740 = !{!7, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !744, file: !492, line: 185)
!744 = !DISubprogram(name: "mbrlen", scope: !566, file: !566, line: 111, type: !745, flags: DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{!580, !465, !580, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !749, file: !492, line: 186)
!749 = !DISubprogram(name: "mbrtowc", scope: !566, file: !566, line: 113, type: !750, flags: DIFlagPrototyped, spFlags: 0)
!750 = !DISubroutineType(types: !751)
!751 = !{!580, !579, !465, !580, !747}
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !753, file: !492, line: 187)
!753 = !DISubprogram(name: "wcrtomb", scope: !566, file: !566, line: 129, type: !754, flags: DIFlagPrototyped, spFlags: 0)
!754 = !DISubroutineType(types: !755)
!755 = !{!580, !14, !572, !747}
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !757, file: !492, line: 188)
!757 = !DISubprogram(name: "mbsrtowcs", scope: !566, file: !566, line: 116, type: !758, flags: DIFlagPrototyped, spFlags: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!580, !579, !760, !580, !747}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !762, file: !492, line: 189)
!762 = !DISubprogram(name: "wcsrtombs", scope: !566, file: !566, line: 153, type: !763, flags: DIFlagPrototyped, spFlags: 0)
!763 = !DISubroutineType(types: !764)
!764 = !{!580, !14, !765, !580, !747}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !767, file: !492, line: 191)
!767 = !DISubprogram(name: "getwchar", scope: !566, file: !566, line: 110, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!768 = !DISubroutineType(types: !769)
!769 = !{!415}
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !771, file: !492, line: 192)
!771 = !DISubprogram(name: "vwscanf", scope: !566, file: !566, line: 199, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!772 = !DISubroutineType(types: !773)
!773 = !{!7, !570, !587}
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !775, file: !492, line: 193)
!775 = !DISubprogram(name: "wscanf", scope: !566, file: !566, line: 181, type: !776, flags: DIFlagPrototyped, spFlags: 0)
!776 = !DISubroutineType(types: !777)
!777 = !{!7, !570, null}
!778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !779, file: !492, line: 195)
!779 = !DISubprogram(name: "putwchar", scope: !566, file: !566, line: 119, type: !780, flags: DIFlagPrototyped, spFlags: 0)
!780 = !DISubroutineType(types: !781)
!781 = !{!415, !572}
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !783, file: !492, line: 196)
!783 = !DISubprogram(name: "vwprintf", scope: !566, file: !566, line: 128, type: !772, flags: DIFlagPrototyped, spFlags: 0)
!784 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !785, file: !492, line: 197)
!785 = !DISubprogram(name: "wprintf", scope: !566, file: !566, line: 180, type: !776, flags: DIFlagPrototyped, spFlags: 0)
!786 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !787, file: !793, line: 106)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !788, line: 105, baseType: !789)
!788 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "17a3e5580239ce2f2af260c9c943ad9b")
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 102, size: 64, flags: DIFlagTypePassByValue, elements: !790, identifier: "_ZTS5div_t")
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !789, file: !788, line: 103, baseType: !7, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !789, file: !788, line: 104, baseType: !7, size: 32, offset: 32)
!793 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdlib", directory: "")
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !795, file: !793, line: 107)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !788, line: 110, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 107, size: 128, flags: DIFlagTypePassByValue, elements: !797, identifier: "_ZTS6ldiv_t")
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !796, file: !788, line: 108, baseType: !366, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !796, file: !788, line: 109, baseType: !366, size: 64, offset: 64)
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !801, file: !793, line: 108)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !788, line: 116, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !788, line: 113, size: 128, flags: DIFlagTypePassByValue, elements: !803, identifier: "_ZTS7lldiv_t")
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !802, file: !788, line: 114, baseType: !18, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !802, file: !788, line: 115, baseType: !18, size: 64, offset: 64)
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !807, file: !793, line: 109)
!807 = !DISubprogram(name: "atof", scope: !788, file: !788, line: 149, type: !808, flags: DIFlagPrototyped, spFlags: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{!635, !465}
!810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !811, file: !793, line: 110)
!811 = !DISubprogram(name: "atoi", scope: !788, file: !788, line: 150, type: !812, flags: DIFlagPrototyped, spFlags: 0)
!812 = !DISubroutineType(types: !813)
!813 = !{!7, !465}
!814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !815, file: !793, line: 111)
!815 = !DISubprogram(name: "atol", scope: !788, file: !788, line: 151, type: !816, flags: DIFlagPrototyped, spFlags: 0)
!816 = !DISubroutineType(types: !817)
!817 = !{!366, !465}
!818 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !819, file: !793, line: 112)
!819 = !DISubprogram(name: "atoll", scope: !788, file: !788, line: 154, type: !820, flags: DIFlagPrototyped, spFlags: 0)
!820 = !DISubroutineType(types: !821)
!821 = !{!18, !465}
!822 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !823, file: !793, line: 113)
!823 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !788, file: !788, line: 184, type: !824, flags: DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{!635, !465, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !828, file: !793, line: 114)
!828 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !788, file: !788, line: 185, type: !829, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DISubroutineType(types: !830)
!830 = !{!641, !465, !826}
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !832, file: !793, line: 115)
!832 = !DISubprogram(name: "strtold", scope: !788, file: !788, line: 188, type: !833, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!380, !465, !826}
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !836, file: !793, line: 116)
!836 = !DISubprogram(name: "strtol", scope: !788, file: !788, line: 186, type: !837, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!366, !465, !826, !7}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !840, file: !793, line: 117)
!840 = !DISubprogram(name: "strtoll", scope: !788, file: !788, line: 191, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!18, !465, !826, !7}
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !844, file: !793, line: 118)
!844 = !DISubprogram(name: "strtoul", scope: !788, file: !788, line: 194, type: !845, flags: DIFlagPrototyped, spFlags: 0)
!845 = !DISubroutineType(types: !846)
!846 = !{!370, !465, !826, !7}
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !848, file: !793, line: 119)
!848 = !DISubprogram(name: "strtoull", scope: !788, file: !788, line: 197, type: !849, flags: DIFlagPrototyped, spFlags: 0)
!849 = !DISubroutineType(types: !850)
!850 = !{!327, !465, !826, !7}
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !852, file: !793, line: 120)
!852 = !DISubprogram(name: "rand", scope: !788, file: !788, line: 181, type: !853, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{!7}
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !856, file: !793, line: 121)
!856 = !DISubprogram(name: "srand", scope: !788, file: !788, line: 183, type: !857, flags: DIFlagPrototyped, spFlags: 0)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !323}
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !860, file: !793, line: 122)
!860 = !DISubprogram(name: "calloc", scope: !861, file: !861, line: 55, type: !862, flags: DIFlagPrototyped, spFlags: 0)
!861 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/malloc/_malloc.h", directory: "", checksumkind: CSK_MD5, checksum: "169c9ed8662627a4a4d92e321cfa866c")
!862 = !DISubroutineType(types: !863)
!863 = !{!527, !580, !580}
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !865, file: !793, line: 123)
!865 = !DISubprogram(name: "free", scope: !861, file: !861, line: 56, type: !866, flags: DIFlagPrototyped, spFlags: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !527}
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !869, file: !793, line: 124)
!869 = !DISubprogram(name: "malloc", scope: !861, file: !861, line: 54, type: !870, flags: DIFlagPrototyped, spFlags: 0)
!870 = !DISubroutineType(types: !871)
!871 = !{!527, !580}
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !873, file: !793, line: 125)
!873 = !DISubprogram(name: "realloc", scope: !861, file: !861, line: 57, type: !874, flags: DIFlagPrototyped, spFlags: 0)
!874 = !DISubroutineType(types: !875)
!875 = !{!527, !527, !580}
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !877, file: !793, line: 126)
!877 = !DISubprogram(name: "abort", scope: !878, file: !878, line: 33, type: !879, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!878 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_abort.h", directory: "", checksumkind: CSK_MD5, checksum: "b8994a53d49770cf67adab87821b3fcb")
!879 = !DISubroutineType(types: !880)
!880 = !{null}
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !882, file: !793, line: 127)
!882 = !DISubprogram(name: "atexit", scope: !788, file: !788, line: 144, type: !883, flags: DIFlagPrototyped, spFlags: 0)
!883 = !DISubroutineType(types: !884)
!884 = !{!7, !885}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!886 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !887, file: !793, line: 128)
!887 = !DISubprogram(name: "exit", scope: !788, file: !788, line: 160, type: !888, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !7}
!890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !891, file: !793, line: 129)
!891 = !DISubprogram(name: "_Exit", scope: !788, file: !788, line: 210, type: !888, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !893, file: !793, line: 130)
!893 = !DISubprogram(name: "getenv", scope: !788, file: !788, line: 162, type: !894, flags: DIFlagPrototyped, spFlags: 0)
!894 = !DISubroutineType(types: !895)
!895 = !{!14, !465}
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !897, file: !793, line: 131)
!897 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !788, file: !788, line: 203, type: !812, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !899, file: !793, line: 132)
!899 = !DISubprogram(name: "bsearch", scope: !788, file: !788, line: 156, type: !900, flags: DIFlagPrototyped, spFlags: 0)
!900 = !DISubroutineType(types: !901)
!901 = !{!527, !902, !902, !580, !580, !904}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!7, !902, !902}
!907 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !908, file: !793, line: 133)
!908 = !DISubprogram(name: "qsort", scope: !788, file: !788, line: 175, type: !909, flags: DIFlagPrototyped, spFlags: 0)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !527, !580, !580, !904}
!911 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !912, file: !793, line: 134)
!912 = !DISubprogram(name: "abs", linkageName: "_Z3absB8ne200100e", scope: !913, file: !913, line: 123, type: !914, flags: DIFlagPrototyped, spFlags: 0)
!913 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/stdlib.h", directory: "")
!914 = !DISubroutineType(types: !915)
!915 = !{!380, !380}
!916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !917, file: !793, line: 135)
!917 = !DISubprogram(name: "labs", scope: !788, file: !788, line: 163, type: !918, flags: DIFlagPrototyped, spFlags: 0)
!918 = !DISubroutineType(types: !919)
!919 = !{!366, !366}
!920 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !921, file: !793, line: 136)
!921 = !DISubprogram(name: "llabs", scope: !788, file: !788, line: 167, type: !922, flags: DIFlagPrototyped, spFlags: 0)
!922 = !DISubroutineType(types: !923)
!923 = !{!18, !18}
!924 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !925, file: !793, line: 137)
!925 = !DISubprogram(name: "div", linkageName: "_Z3divB8ne200100xx", scope: !913, file: !913, line: 143, type: !926, flags: DIFlagPrototyped, spFlags: 0)
!926 = !DISubroutineType(types: !927)
!927 = !{!801, !18, !18}
!928 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !929, file: !793, line: 138)
!929 = !DISubprogram(name: "ldiv", scope: !788, file: !788, line: 164, type: !930, flags: DIFlagPrototyped, spFlags: 0)
!930 = !DISubroutineType(types: !931)
!931 = !{!795, !366, !366}
!932 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !933, file: !793, line: 139)
!933 = !DISubprogram(name: "lldiv", scope: !788, file: !788, line: 168, type: !926, flags: DIFlagPrototyped, spFlags: 0)
!934 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !935, file: !793, line: 140)
!935 = !DISubprogram(name: "mblen", scope: !788, file: !788, line: 171, type: !936, flags: DIFlagPrototyped, spFlags: 0)
!936 = !DISubroutineType(types: !937)
!937 = !{!7, !465, !580}
!938 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !939, file: !793, line: 142)
!939 = !DISubprogram(name: "mbtowc", scope: !788, file: !788, line: 173, type: !940, flags: DIFlagPrototyped, spFlags: 0)
!940 = !DISubroutineType(types: !941)
!941 = !{!7, !579, !465, !580}
!942 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !943, file: !793, line: 143)
!943 = !DISubprogram(name: "wctomb", scope: !788, file: !788, line: 207, type: !944, flags: DIFlagPrototyped, spFlags: 0)
!944 = !DISubroutineType(types: !945)
!945 = !{!7, !14, !572}
!946 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !947, file: !793, line: 144)
!947 = !DISubprogram(name: "mbstowcs", scope: !788, file: !788, line: 172, type: !948, flags: DIFlagPrototyped, spFlags: 0)
!948 = !DISubroutineType(types: !949)
!949 = !{!580, !579, !465, !580}
!950 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !951, file: !793, line: 145)
!951 = !DISubprogram(name: "wcstombs", scope: !788, file: !788, line: 206, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!952 = !DISubroutineType(types: !953)
!953 = !{!580, !14, !570, !580}
!954 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !955, file: !793, line: 148)
!955 = !DISubprogram(name: "at_quick_exit", scope: !788, file: !788, line: 147, type: !883, flags: DIFlagPrototyped, spFlags: 0)
!956 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !957, file: !793, line: 149)
!957 = !DISubprogram(name: "quick_exit", scope: !788, file: !788, line: 179, type: !888, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!958 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !481, file: !959, line: 25)
!959 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__std_mbstate_t.h", directory: "")
!960 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !961, file: !967, line: 422)
!961 = !DISubprogram(name: "isfinite", linkageName: "_ZNSt3__16__math8isfiniteB8ne200100Ee", scope: !963, file: !962, line: 79, type: !964, flags: DIFlagPrototyped, spFlags: 0)
!962 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__math/traits.h", directory: "")
!963 = !DINamespace(name: "__math", scope: !310)
!964 = !DISubroutineType(types: !965)
!965 = !{!966, !380}
!966 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!967 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/math.h", directory: "")
!968 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !969, file: !967, line: 425)
!969 = !DISubprogram(name: "isinf", linkageName: "_ZNSt3__16__math5isinfB8ne200100Ee", scope: !963, file: !962, line: 103, type: !964, flags: DIFlagPrototyped, spFlags: 0)
!970 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !971, file: !967, line: 429)
!971 = !DISubprogram(name: "isnan", linkageName: "_ZNSt3__16__math5isnanB8ne200100Ee", scope: !963, file: !962, line: 127, type: !964, flags: DIFlagPrototyped, spFlags: 0)
!972 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !973, file: !967, line: 430)
!973 = !DISubprogram(name: "isnormal", linkageName: "_ZNSt3__16__math8isnormalB8ne200100Ee", scope: !963, file: !962, line: 146, type: !964, flags: DIFlagPrototyped, spFlags: 0)
!974 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !975, file: !967, line: 485)
!975 = !DISubprogram(name: "modf", linkageName: "_ZNSt3__16__math4modfB8ne200100EePe", scope: !963, file: !976, line: 55, type: !977, flags: DIFlagPrototyped, spFlags: 0)
!976 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__math/modulo.h", directory: "")
!977 = !DISubroutineType(types: !978)
!978 = !{!380, !380, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!980 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !961, file: !981, line: 352)
!981 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cmath", directory: "")
!982 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !969, file: !981, line: 353)
!983 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !971, file: !981, line: 354)
!984 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !973, file: !981, line: 355)
!985 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !986, file: !981, line: 364)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !987, line: 50, baseType: !641)
!987 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/math.h", directory: "", checksumkind: CSK_MD5, checksum: "35b1ff63542c2c0c144330dd9277d2dc")
!988 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !989, file: !981, line: 365)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !987, line: 51, baseType: !635)
!990 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !912, file: !981, line: 367)
!991 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !992, file: !981, line: 370)
!992 = !DISubprogram(name: "acosf", scope: !987, file: !987, line: 314, type: !993, flags: DIFlagPrototyped, spFlags: 0)
!993 = !DISubroutineType(types: !994)
!994 = !{!641, !641}
!995 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !996, file: !981, line: 372)
!996 = !DISubprogram(name: "asinf", scope: !987, file: !987, line: 318, type: !993, flags: DIFlagPrototyped, spFlags: 0)
!997 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !998, file: !981, line: 374)
!998 = !DISubprogram(name: "atanf", scope: !987, file: !987, line: 322, type: !993, flags: DIFlagPrototyped, spFlags: 0)
!999 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !1000, file: !981, line: 376)
!1000 = !DISubprogram(name: "atan2f", scope: !987, file: !987, line: 326, type: !1001, flags: DIFlagPrototyped, spFlags: 0)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!641, !641, !641}
!1003 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !1004, file: !981, line: 378)
!1004 = !DISubprogram(name: "ceilf", scope: !987, file: !987, line: 461, type: !993, flags: DIFlagPrototyped, spFlags: 0)
!1005 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !1006, file: !981, line: 380)
!1006 = !DISubprogram(name: "cosf", scope: !987, file: !987, line: 330, type: !993, flags: DIFlagPrototyped, spFlags: 0)
!1007 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !1008, file: !981, line: 382)
!1008 = !DISubprogram(name: "coshf", scope: !987, file: !987, line: 354, type: !993, flags: DIFlagPrototyped, spFlags: 0)
!1009 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !1010, file: !981, line: 385)
!1010 = !DISubprogram(name: "expf", scope: !987, file: !987, line: 366, type: !993, flags: DIFlagPrototyped, spFlags: 0)
!1011 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !1012, file: !981, line: 388)
!1012 = !DISubprogram(name: "fabsf", scope: !987, file: !987, line: 422, type: !993, flags: DIFlagPrototyped, spFlags: 0)
!1013 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !1014, file: !981, line: 390)
!1014 = !DISubprogram(name: "floorf", scope: !987, file: !987, line: 465, type: !993, flags: DIFlagPrototyped, spFlags: 0)
!1015 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !1016, file: !981, line: 393)
!1016 = !DISubprogram(name: "fmodf", scope: !987, file: !987, line: 505, type: !1001, flags: DIFlagPrototyped, spFlags: 0)
!1017 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !310, entity: !1018, file: !981, line: 396)
