; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/fuelcen.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/fuelcen.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.matcen_info = type { [2 x i32], i32, i32, i16, i16 }
%struct.FuelCenter = type { i32, i32, i8, i8, i8, i8, i32, i32, i32, i32, %struct.vms_vector }
%struct.vms_vector = type { i32, i32, i32 }
%struct.segment2 = type { i8, i8, i8, i8, i32 }
%struct.segment = type { [6 x %struct.side], [6 x i16], [8 x i16], i32 }
%struct.side = type { i8, i8, i16, i16, i16, [4 x %struct.uvl], [2 x %struct.vms_vector] }
%struct.uvl = type { i32, i32, i32 }
%struct.object = type { i32, i8, i8, i16, i16, i8, i8, i8, i8, i16, i16, %struct.vms_vector, %struct.vms_matrix, i32, i32, %struct.vms_vector, i8, i8, i8, i8, i32, %union.anon, %union.anon.0, %union.anon.1 }
%struct.vms_matrix = type { %struct.vms_vector, %struct.vms_vector, %struct.vms_vector }
%union.anon = type { %struct.physics_info }
%struct.physics_info = type { %struct.vms_vector, %struct.vms_vector, i32, i32, i32, %struct.vms_vector, %struct.vms_vector, i16, i16 }
%union.anon.0 = type { %struct.ai_static }
%struct.ai_static = type { i8, [11 x i8], i16, i16, i16, i8, i8, i16, i32, i32 }
%union.anon.1 = type { %struct.polyobj_info }
%struct.polyobj_info = type { i32, [10 x %struct.vms_angvec], i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Fuelcen_refill_speed", scope: !2, file: !15, line: 54, type: !16, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !12, imports: !241, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "/Users/richard/code/ChocolateDescent/main_d2/fuelcen.cpp", directory: "/Users/richard/code/ChocolateDescent/build-c-ref", checksumkind: CSK_MD5, checksum: "5ee8c9aee80dcb6228b2039717465d28")
!4 = !{!5, !6, !9}
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !7, line: 30, baseType: !8)
!7 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!8 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !10, line: 30, baseType: !11)
!10 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!11 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!12 = !{!0, !13, !20, !22, !24, !42, !44, !70, !72, !113, !120, !125, !130, !135, !140, !142, !147, !152, !157, !162, !167, !172, !174, !176, !178, !183, !188, !193, !198, !203, !208, !214, !219, !224, !229, !234, !236, !238}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "Fuelcen_give_amount", scope: !2, file: !15, line: 55, type: !16, isLocal: false, isDefinition: true)
!15 = !DIFile(filename: "main_d2/fuelcen.cpp", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "5ee8c9aee80dcb6228b2039717465d28")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "fix", file: !17, line: 20, baseType: !18)
!17 = !DIFile(filename: "./fix/fix.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c5006a11bf8b4cb7d963898499eda13a")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !19, line: 30, baseType: !5)
!19 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "Fuelcen_max_amount", scope: !2, file: !15, line: 56, type: !16, isLocal: false, isDefinition: true)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "EnergyToCreateOneRobot", scope: !2, file: !15, line: 60, type: !16, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "RobotCenters", scope: !2, file: !15, line: 65, type: !26, isLocal: false, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 3200, elements: !40)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "matcen_info", file: !28, line: 117, baseType: !29)
!28 = !DIFile(filename: "main_d2/fuelcen.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "8ae6b7177fad5b3c733b361bc7aef356")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "matcen_info", file: !28, line: 110, size: 160, flags: DIFlagTypePassByValue, elements: !30, identifier: "_ZTS11matcen_info")
!30 = !{!31, !35, !36, !37, !39}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "robot_flags", scope: !29, file: !28, line: 112, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !33)
!33 = !{!34}
!34 = !DISubrange(count: 2)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "hit_points", scope: !29, file: !28, line: 113, baseType: !16, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !29, file: !28, line: 114, baseType: !16, size: 32, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !29, file: !28, line: 115, baseType: !38, size: 16, offset: 128)
!38 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fuelcen_num", scope: !29, file: !28, line: 116, baseType: !38, size: 16, offset: 144)
!40 = !{!41}
!41 = !DISubrange(count: 20)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "Num_robot_centers", scope: !2, file: !15, line: 66, type: !5, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "Station", scope: !2, file: !15, line: 68, type: !46, isLocal: false, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 22400, elements: !68)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "FuelCenter", file: !28, line: 103, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FuelCenter", file: !28, line: 88, size: 320, flags: DIFlagTypePassByValue, elements: !49, identifier: "_ZTS10FuelCenter")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !48, file: !28, line: 90, baseType: !5, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !48, file: !28, line: 91, baseType: !5, size: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Flag", scope: !48, file: !28, line: 92, baseType: !6, size: 8, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !48, file: !28, line: 93, baseType: !6, size: 8, offset: 72)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Lives", scope: !48, file: !28, line: 94, baseType: !6, size: 8, offset: 80)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "dum1", scope: !48, file: !28, line: 95, baseType: !6, size: 8, offset: 88)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Capacity", scope: !48, file: !28, line: 96, baseType: !16, size: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "MaxCapacity", scope: !48, file: !28, line: 97, baseType: !16, size: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Timer", scope: !48, file: !28, line: 98, baseType: !16, size: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Disable_time", scope: !48, file: !28, line: 99, baseType: !16, size: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !48, file: !28, line: 102, baseType: !61, size: 96, offset: 224)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_vector", file: !62, line: 22, baseType: !63)
!62 = !DIFile(filename: "./vecmat/vecmat.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "dfa84e3325c1ea4f5f74699fff5ef2bf")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_vector", file: !62, line: 19, size: 96, flags: DIFlagTypePassByValue, elements: !64, identifier: "_ZTS10vms_vector")
!64 = !{!65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !63, file: !62, line: 21, baseType: !16, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !63, file: !62, line: 21, baseType: !16, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !63, file: !62, line: 21, baseType: !16, size: 32, offset: 64)
!68 = !{!69}
!69 = !DISubrange(count: 70)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "Num_fuelcenters", scope: !2, file: !15, line: 69, type: !5, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "PlayerSegment", scope: !2, file: !15, line: 71, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "segment", file: !76, line: 123, baseType: !77)
!76 = !DIFile(filename: "main_d2/segment.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c950815a9b07e6bab2fa2587b90affec")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "segment", file: !76, line: 100, size: 4096, flags: DIFlagTypePassByValue, elements: !78, identifier: "_ZTS7segment")
!78 = !{!79, !106, !108, !112}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sides", scope: !77, file: !76, line: 105, baseType: !80, size: 3840)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 3840, elements: !104)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "side", file: !76, line: 91, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "side", file: !76, line: 82, size: 640, flags: DIFlagTypePassByValue, elements: !83, identifier: "_ZTS4side")
!83 = !{!84, !85, !89, !90, !91, !92, !102}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !76, line: 84, baseType: !6, size: 8)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !82, file: !76, line: 85, baseType: !86, size: 8, offset: 8)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !87, line: 31, baseType: !88)
!87 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!88 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "wall_num", scope: !82, file: !76, line: 86, baseType: !38, size: 16, offset: 16)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_num", scope: !82, file: !76, line: 87, baseType: !38, size: 16, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_num2", scope: !82, file: !76, line: 88, baseType: !38, size: 16, offset: 48)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "uvls", scope: !82, file: !76, line: 89, baseType: !93, size: 384, offset: 64)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 384, elements: !100)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uvl", file: !76, line: 67, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uvl", file: !76, line: 64, size: 96, flags: DIFlagTypePassByValue, elements: !96, identifier: "_ZTS3uvl")
!96 = !{!97, !98, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !95, file: !76, line: 66, baseType: !16, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !95, file: !76, line: 66, baseType: !16, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !95, file: !76, line: 66, baseType: !16, size: 32, offset: 64)
!100 = !{!101}
!101 = !DISubrange(count: 4)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "normals", scope: !82, file: !76, line: 90, baseType: !103, size: 192, offset: 448)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 192, elements: !33)
!104 = !{!105}
!105 = !DISubrange(count: 6)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !77, file: !76, line: 106, baseType: !107, size: 96, offset: 3840)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 96, elements: !104)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !77, file: !76, line: 107, baseType: !109, size: 128, offset: 3936)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 128, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 8)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !77, file: !76, line: 112, baseType: !5, size: 32, offset: 4064)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !15, line: 185, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 304, elements: !118)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!118 = !{!119}
!119 = !DISubrange(count: 38)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !15, line: 188, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 128, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 16)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !15, line: 188, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 456, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 57)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !15, line: 191, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 280, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 35)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !15, line: 192, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 168, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 21)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !15, line: 281, type: !115, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !15, line: 362, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 224, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 28)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !15, line: 364, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 320, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 40)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !15, line: 365, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 288, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 36)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !15, line: 366, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 584, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 73)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !15, line: 395, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 336, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 42)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !15, line: 466, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 352, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 44)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "Num_extry_robots", scope: !2, file: !15, line: 498, type: !5, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "FrameCount_last_msg", scope: !2, file: !15, line: 501, type: !5, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !15, line: 522, type: !127, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !15, line: 551, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 248, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 31)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !15, line: 566, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 272, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 34)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !15, line: 609, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 448, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 56)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !15, line: 622, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 312, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 39)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !15, line: 694, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 392, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 49)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !15, line: 714, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 496, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 62)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "last_play_time", scope: !210, file: !15, line: 780, type: !16, isLocal: true, isDefinition: true)
!210 = distinct !DISubprogram(name: "fuelcen_give_fuel", linkageName: "_Z17fuelcen_give_fuelP7segmenti", scope: !15, file: !15, line: 776, type: !211, scopeLine: 777, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{!16, !74, !16}
!213 = !{}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !15, line: 782, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 104, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 13)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1201, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 184, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 23)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1212, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 240, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 30)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1213, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 408, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 51)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1225, type: !221, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !15, line: 1259, type: !137, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!239 = distinct !DIGlobalVariable(name: "FRACBITS", scope: !2, file: !17, line: 18, type: !240, isLocal: true, isDefinition: true)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!241 = !{!242, !246, !249, !250, !251, !252, !256, !260, !264, !267, !269, !271, !273, !275, !277, !279, !281, !283, !285, !287, !289, !291, !293, !295, !297, !303, !307, !310, !313, !322, !324, !326, !328}
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !6, file: !245, line: 158)
!243 = !DINamespace(name: "__1", scope: !244, exportSymbols: true)
!244 = !DINamespace(name: "std", scope: null)
!245 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdint", directory: "")
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !247, file: !245, line: 159)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !248, line: 30, baseType: !38)
!248 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !18, file: !245, line: 160)
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !9, file: !245, line: 161)
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !86, file: !245, line: 163)
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !253, file: !245, line: 164)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !254, line: 31, baseType: !255)
!254 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!255 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !257, file: !245, line: 165)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !258, line: 31, baseType: !259)
!258 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!259 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !261, file: !245, line: 166)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !262, line: 31, baseType: !263)
!262 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!263 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !265, file: !245, line: 168)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !266, line: 29, baseType: !6)
!266 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !268, file: !245, line: 169)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !266, line: 30, baseType: !247)
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !270, file: !245, line: 170)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !266, line: 31, baseType: !18)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !272, file: !245, line: 171)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !266, line: 32, baseType: !9)
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !274, file: !245, line: 173)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !266, line: 33, baseType: !86)
!275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !276, file: !245, line: 174)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !266, line: 34, baseType: !253)
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !278, file: !245, line: 175)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !266, line: 35, baseType: !257)
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !280, file: !245, line: 176)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !266, line: 36, baseType: !261)
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !282, file: !245, line: 178)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !266, line: 40, baseType: !6)
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !284, file: !245, line: 179)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !266, line: 41, baseType: !247)
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !286, file: !245, line: 180)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !266, line: 42, baseType: !18)
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !288, file: !245, line: 181)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !266, line: 43, baseType: !9)
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !290, file: !245, line: 183)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !266, line: 44, baseType: !86)
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !292, file: !245, line: 184)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !266, line: 45, baseType: !253)
!293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !294, file: !245, line: 185)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !266, line: 46, baseType: !257)
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !296, file: !245, line: 186)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !266, line: 47, baseType: !261)
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !298, file: !245, line: 188)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !299, line: 32, baseType: !300)
!299 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !301, line: 40, baseType: !302)
!301 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!302 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !304, file: !245, line: 189)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !305, line: 34, baseType: !306)
!305 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!306 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !308, file: !245, line: 191)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !309, line: 32, baseType: !302)
!309 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !243, entity: !311, file: !245, line: 192)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !312, line: 32, baseType: !306)
!312 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !314, file: !321, line: 422)
!314 = !DISubprogram(name: "isfinite", linkageName: "_ZNSt3__16__math8isfiniteB8ne200100Ee", scope: !316, file: !315, line: 79, type: !317, flags: DIFlagPrototyped, spFlags: 0)
!315 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__math/traits.h", directory: "")
!316 = !DINamespace(name: "__math", scope: !243)
!317 = !DISubroutineType(types: !318)
!318 = !{!319, !320}
!319 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!320 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!321 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/math.h", directory: "")
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !323, file: !321, line: 425)
!323 = !DISubprogram(name: "isinf", linkageName: "_ZNSt3__16__math5isinfB8ne200100Ee", scope: !316, file: !315, line: 103, type: !317, flags: DIFlagPrototyped, spFlags: 0)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !325, file: !321, line: 429)
!325 = !DISubprogram(name: "isnan", linkageName: "_ZNSt3__16__math5isnanB8ne200100Ee", scope: !316, file: !315, line: 127, type: !317, flags: DIFlagPrototyped, spFlags: 0)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !327, file: !321, line: 430)
!327 = !DISubprogram(name: "isnormal", linkageName: "_ZNSt3__16__math8isnormalB8ne200100Ee", scope: !316, file: !315, line: 146, type: !317, flags: DIFlagPrototyped, spFlags: 0)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !329, file: !321, line: 485)
!329 = !DISubprogram(name: "modf", linkageName: "_ZNSt3__16__math4modfB8ne200100EePe", scope: !316, file: !330, line: 55, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!330 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__math/modulo.h", directory: "")
!331 = !DISubroutineType(types: !332)
!332 = !{!320, !320, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!334 = !{i32 2, !"SDK Version", [2 x i32] [i32 15, i32 4]}
!335 = !{i32 7, !"Dwarf Version", i32 5}
!336 = !{i32 2, !"Debug Info Version", i32 3}
!337 = !{i32 1, !"wchar_size", i32 4}
!338 = !{i32 8, !"PIC Level", i32 2}
!339 = !{i32 7, !"uwtable", i32 1}
!340 = !{i32 7, !"frame-pointer", i32 1}
!341 = !{!"Homebrew clang version 20.1.8"}
!342 = distinct !DISubprogram(name: "fuelcen_reset", linkageName: "_Z13fuelcen_resetv", scope: !15, file: !15, line: 87, type: !343, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!343 = !DISubroutineType(types: !344)
!344 = !{null}
!345 = !DILocalVariable(name: "i", scope: !342, file: !15, line: 89, type: !5)
!346 = !DILocation(line: 89, column: 6, scope: !342)
!347 = !DILocation(line: 91, column: 18, scope: !342)
!348 = !DILocation(line: 94, column: 9, scope: !349)
!349 = distinct !DILexicalBlock(scope: !342, file: !15, line: 94, column: 2)
!350 = !DILocation(line: 94, column: 7, scope: !349)
!351 = !DILocation(line: 94, column: 14, scope: !352)
!352 = distinct !DILexicalBlock(scope: !349, file: !15, line: 94, column: 2)
!353 = !DILocation(line: 94, column: 16, scope: !352)
!354 = !DILocation(line: 94, column: 2, scope: !349)
!355 = !DILocation(line: 95, column: 13, scope: !352)
!356 = !DILocation(line: 95, column: 3, scope: !352)
!357 = !DILocation(line: 95, column: 16, scope: !352)
!358 = !DILocation(line: 95, column: 24, scope: !352)
!359 = !DILocation(line: 94, column: 33, scope: !352)
!360 = !DILocation(line: 94, column: 2, scope: !352)
!361 = distinct !{!361, !354, !362, !363}
!362 = !DILocation(line: 95, column: 26, scope: !349)
!363 = !{!"llvm.loop.mustprogress"}
!364 = !DILocation(line: 97, column: 20, scope: !342)
!365 = !DILocation(line: 99, column: 1, scope: !342)
!366 = distinct !DISubprogram(name: "reset_all_robot_centers", linkageName: "_Z23reset_all_robot_centersv", scope: !15, file: !15, line: 102, type: !343, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!367 = !DILocalVariable(name: "i", scope: !366, file: !15, line: 104, type: !5)
!368 = !DILocation(line: 104, column: 6, scope: !366)
!369 = !DILocation(line: 107, column: 9, scope: !370)
!370 = distinct !DILexicalBlock(scope: !366, file: !15, line: 107, column: 2)
!371 = !DILocation(line: 107, column: 7, scope: !370)
!372 = !DILocation(line: 107, column: 14, scope: !373)
!373 = distinct !DILexicalBlock(scope: !370, file: !15, line: 107, column: 2)
!374 = !DILocation(line: 107, column: 18, scope: !373)
!375 = !DILocation(line: 107, column: 16, scope: !373)
!376 = !DILocation(line: 107, column: 2, scope: !370)
!377 = !DILocation(line: 108, column: 17, scope: !378)
!378 = distinct !DILexicalBlock(scope: !373, file: !15, line: 108, column: 7)
!379 = !DILocation(line: 108, column: 7, scope: !378)
!380 = !DILocation(line: 108, column: 20, scope: !378)
!381 = !DILocation(line: 108, column: 28, scope: !378)
!382 = !DILocation(line: 109, column: 14, scope: !383)
!383 = distinct !DILexicalBlock(scope: !378, file: !15, line: 108, column: 54)
!384 = !DILocation(line: 109, column: 4, scope: !383)
!385 = !DILocation(line: 109, column: 17, scope: !383)
!386 = !DILocation(line: 109, column: 25, scope: !383)
!387 = !DILocation(line: 110, column: 14, scope: !383)
!388 = !DILocation(line: 110, column: 4, scope: !383)
!389 = !DILocation(line: 110, column: 17, scope: !383)
!390 = !DILocation(line: 110, column: 28, scope: !383)
!391 = !DILocation(line: 111, column: 3, scope: !383)
!392 = !DILocation(line: 108, column: 31, scope: !378)
!393 = !DILocation(line: 107, column: 33, scope: !373)
!394 = !DILocation(line: 107, column: 2, scope: !373)
!395 = distinct !{!395, !376, !396, !363}
!396 = !DILocation(line: 111, column: 3, scope: !370)
!397 = !DILocation(line: 112, column: 1, scope: !366)
!398 = distinct !DISubprogram(name: "fuelcen_create", linkageName: "_Z14fuelcen_createP7segment", scope: !15, file: !15, line: 117, type: !399, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !74}
!401 = !DILocalVariable(name: "segp", arg: 1, scope: !398, file: !15, line: 117, type: !74)
!402 = !DILocation(line: 117, column: 30, scope: !398)
!403 = !DILocalVariable(name: "segnum", scope: !398, file: !15, line: 119, type: !5)
!404 = !DILocation(line: 119, column: 6, scope: !398)
!405 = !DILocation(line: 119, column: 21, scope: !398)
!406 = !DILocation(line: 119, column: 26, scope: !398)
!407 = !DILocation(line: 119, column: 20, scope: !398)
!408 = !DILocalVariable(name: "seg2p", scope: !398, file: !15, line: 168, type: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "segment2", file: !76, line: 137, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "segment2", file: !76, line: 130, size: 64, flags: DIFlagTypePassByValue, elements: !412, identifier: "_ZTS8segment2")
!412 = !{!413, !414, !415, !416, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "special", scope: !411, file: !76, line: 132, baseType: !86, size: 8)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "matcen_num", scope: !411, file: !76, line: 133, baseType: !6, size: 8, offset: 8)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !411, file: !76, line: 134, baseType: !6, size: 8, offset: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "s2_flags", scope: !411, file: !76, line: 135, baseType: !86, size: 8, offset: 24)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "static_light", scope: !411, file: !76, line: 136, baseType: !16, size: 32, offset: 32)
!418 = !DILocation(line: 168, column: 12, scope: !398)
!419 = !DILocation(line: 168, column: 31, scope: !398)
!420 = !DILocation(line: 168, column: 21, scope: !398)
!421 = !DILocalVariable(name: "station_type", scope: !398, file: !15, line: 170, type: !5)
!422 = !DILocation(line: 170, column: 6, scope: !398)
!423 = !DILocation(line: 172, column: 17, scope: !398)
!424 = !DILocation(line: 172, column: 24, scope: !398)
!425 = !DILocation(line: 172, column: 15, scope: !398)
!426 = !DILocation(line: 174, column: 10, scope: !398)
!427 = !DILocation(line: 174, column: 2, scope: !398)
!428 = !DILocation(line: 178, column: 3, scope: !429)
!429 = distinct !DILexicalBlock(scope: !398, file: !15, line: 174, column: 24)
!430 = !DILocation(line: 183, column: 3, scope: !429)
!431 = !DILocation(line: 185, column: 51, scope: !429)
!432 = !DILocation(line: 185, column: 3, scope: !429)
!433 = !DILocation(line: 186, column: 2, scope: !429)
!434 = !DILocation(line: 188, column: 2, scope: !398)
!435 = !DILocation(line: 189, column: 6, scope: !436)
!436 = distinct !DILexicalBlock(scope: !398, file: !15, line: 189, column: 6)
!437 = !DILocation(line: 189, column: 12, scope: !436)
!438 = !DILocation(line: 189, column: 21, scope: !436)
!439 = !DILocation(line: 191, column: 2, scope: !398)
!440 = !DILocation(line: 192, column: 2, scope: !398)
!441 = !DILocation(line: 194, column: 17, scope: !398)
!442 = !DILocation(line: 194, column: 2, scope: !398)
!443 = !DILocation(line: 194, column: 9, scope: !398)
!444 = !DILocation(line: 194, column: 15, scope: !398)
!445 = !DILocation(line: 195, column: 34, scope: !398)
!446 = !DILocation(line: 195, column: 10, scope: !398)
!447 = !DILocation(line: 195, column: 2, scope: !398)
!448 = !DILocation(line: 195, column: 27, scope: !398)
!449 = !DILocation(line: 195, column: 32, scope: !398)
!450 = !DILocation(line: 196, column: 41, scope: !398)
!451 = !DILocation(line: 196, column: 10, scope: !398)
!452 = !DILocation(line: 196, column: 2, scope: !398)
!453 = !DILocation(line: 196, column: 27, scope: !398)
!454 = !DILocation(line: 196, column: 39, scope: !398)
!455 = !DILocation(line: 197, column: 46, scope: !398)
!456 = !DILocation(line: 197, column: 38, scope: !398)
!457 = !DILocation(line: 197, column: 63, scope: !398)
!458 = !DILocation(line: 197, column: 10, scope: !398)
!459 = !DILocation(line: 197, column: 2, scope: !398)
!460 = !DILocation(line: 197, column: 27, scope: !398)
!461 = !DILocation(line: 197, column: 36, scope: !398)
!462 = !DILocation(line: 198, column: 36, scope: !398)
!463 = !DILocation(line: 198, column: 42, scope: !398)
!464 = !DILocation(line: 198, column: 10, scope: !398)
!465 = !DILocation(line: 198, column: 2, scope: !398)
!466 = !DILocation(line: 198, column: 27, scope: !398)
!467 = !DILocation(line: 198, column: 34, scope: !398)
!468 = !DILocation(line: 199, column: 10, scope: !398)
!469 = !DILocation(line: 199, column: 2, scope: !398)
!470 = !DILocation(line: 199, column: 27, scope: !398)
!471 = !DILocation(line: 199, column: 33, scope: !398)
!472 = !DILocation(line: 200, column: 10, scope: !398)
!473 = !DILocation(line: 200, column: 2, scope: !398)
!474 = !DILocation(line: 200, column: 27, scope: !398)
!475 = !DILocation(line: 200, column: 32, scope: !398)
!476 = !DILocation(line: 204, column: 34, scope: !398)
!477 = !DILocation(line: 204, column: 26, scope: !398)
!478 = !DILocation(line: 204, column: 51, scope: !398)
!479 = !DILocation(line: 204, column: 59, scope: !398)
!480 = !DILocation(line: 204, column: 2, scope: !398)
!481 = !DILocation(line: 210, column: 17, scope: !398)
!482 = !DILocation(line: 211, column: 1, scope: !398)
!483 = distinct !DISubprogram(name: "matcen_create", linkageName: "_Z13matcen_createP7segment", scope: !15, file: !15, line: 216, type: !399, scopeLine: 217, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!484 = !DILocalVariable(name: "segp", arg: 1, scope: !483, file: !15, line: 216, type: !74)
!485 = !DILocation(line: 216, column: 29, scope: !483)
!486 = !DILocalVariable(name: "segnum", scope: !483, file: !15, line: 218, type: !5)
!487 = !DILocation(line: 218, column: 6, scope: !483)
!488 = !DILocation(line: 218, column: 15, scope: !483)
!489 = !DILocation(line: 218, column: 20, scope: !483)
!490 = !DILocalVariable(name: "seg2p", scope: !483, file: !15, line: 276, type: !409)
!491 = !DILocation(line: 276, column: 12, scope: !483)
!492 = !DILocation(line: 276, column: 31, scope: !483)
!493 = !DILocation(line: 276, column: 21, scope: !483)
!494 = !DILocalVariable(name: "station_type", scope: !483, file: !15, line: 278, type: !5)
!495 = !DILocation(line: 278, column: 6, scope: !483)
!496 = !DILocation(line: 278, column: 21, scope: !483)
!497 = !DILocation(line: 278, column: 28, scope: !483)
!498 = !DILocation(line: 280, column: 2, scope: !483)
!499 = !DILocation(line: 281, column: 2, scope: !483)
!500 = !DILocation(line: 282, column: 6, scope: !501)
!501 = distinct !DILexicalBlock(scope: !483, file: !15, line: 282, column: 6)
!502 = !DILocation(line: 282, column: 12, scope: !501)
!503 = !DILocation(line: 282, column: 21, scope: !501)
!504 = !DILocation(line: 284, column: 2, scope: !483)
!505 = !DILocation(line: 285, column: 2, scope: !483)
!506 = !DILocation(line: 287, column: 17, scope: !483)
!507 = !DILocation(line: 287, column: 2, scope: !483)
!508 = !DILocation(line: 287, column: 9, scope: !483)
!509 = !DILocation(line: 287, column: 15, scope: !483)
!510 = !DILocation(line: 288, column: 34, scope: !483)
!511 = !DILocation(line: 288, column: 10, scope: !483)
!512 = !DILocation(line: 288, column: 2, scope: !483)
!513 = !DILocation(line: 288, column: 27, scope: !483)
!514 = !DILocation(line: 288, column: 32, scope: !483)
!515 = !DILocation(line: 289, column: 42, scope: !483)
!516 = !DILocation(line: 289, column: 59, scope: !483)
!517 = !DILocation(line: 289, column: 38, scope: !483)
!518 = !DILocation(line: 289, column: 10, scope: !483)
!519 = !DILocation(line: 289, column: 2, scope: !483)
!520 = !DILocation(line: 289, column: 27, scope: !483)
!521 = !DILocation(line: 289, column: 36, scope: !483)
!522 = !DILocation(line: 290, column: 49, scope: !483)
!523 = !DILocation(line: 290, column: 41, scope: !483)
!524 = !DILocation(line: 290, column: 66, scope: !483)
!525 = !DILocation(line: 290, column: 10, scope: !483)
!526 = !DILocation(line: 290, column: 2, scope: !483)
!527 = !DILocation(line: 290, column: 27, scope: !483)
!528 = !DILocation(line: 290, column: 39, scope: !483)
!529 = !DILocation(line: 292, column: 36, scope: !483)
!530 = !DILocation(line: 292, column: 42, scope: !483)
!531 = !DILocation(line: 292, column: 10, scope: !483)
!532 = !DILocation(line: 292, column: 2, scope: !483)
!533 = !DILocation(line: 292, column: 27, scope: !483)
!534 = !DILocation(line: 292, column: 34, scope: !483)
!535 = !DILocation(line: 293, column: 10, scope: !483)
!536 = !DILocation(line: 293, column: 2, scope: !483)
!537 = !DILocation(line: 293, column: 27, scope: !483)
!538 = !DILocation(line: 293, column: 33, scope: !483)
!539 = !DILocation(line: 294, column: 10, scope: !483)
!540 = !DILocation(line: 294, column: 2, scope: !483)
!541 = !DILocation(line: 294, column: 27, scope: !483)
!542 = !DILocation(line: 294, column: 32, scope: !483)
!543 = !DILocation(line: 298, column: 34, scope: !483)
!544 = !DILocation(line: 298, column: 26, scope: !483)
!545 = !DILocation(line: 298, column: 51, scope: !483)
!546 = !DILocation(line: 298, column: 69, scope: !483)
!547 = !DILocation(line: 298, column: 75, scope: !483)
!548 = !DILocation(line: 298, column: 60, scope: !483)
!549 = !DILocation(line: 298, column: 2, scope: !483)
!550 = !DILocation(line: 300, column: 22, scope: !483)
!551 = !DILocation(line: 300, column: 2, scope: !483)
!552 = !DILocation(line: 300, column: 9, scope: !483)
!553 = !DILocation(line: 300, column: 20, scope: !483)
!554 = !DILocation(line: 301, column: 19, scope: !483)
!555 = !DILocation(line: 303, column: 15, scope: !483)
!556 = !DILocation(line: 303, column: 22, scope: !483)
!557 = !DILocation(line: 303, column: 2, scope: !483)
!558 = !DILocation(line: 303, column: 34, scope: !483)
!559 = !DILocation(line: 303, column: 45, scope: !483)
!560 = !DILocation(line: 304, column: 15, scope: !483)
!561 = !DILocation(line: 304, column: 22, scope: !483)
!562 = !DILocation(line: 304, column: 2, scope: !483)
!563 = !DILocation(line: 304, column: 34, scope: !483)
!564 = !DILocation(line: 304, column: 43, scope: !483)
!565 = !DILocation(line: 305, column: 43, scope: !483)
!566 = !DILocation(line: 305, column: 49, scope: !483)
!567 = !DILocation(line: 305, column: 15, scope: !483)
!568 = !DILocation(line: 305, column: 22, scope: !483)
!569 = !DILocation(line: 305, column: 2, scope: !483)
!570 = !DILocation(line: 305, column: 34, scope: !483)
!571 = !DILocation(line: 305, column: 41, scope: !483)
!572 = !DILocation(line: 306, column: 48, scope: !483)
!573 = !DILocation(line: 306, column: 15, scope: !483)
!574 = !DILocation(line: 306, column: 22, scope: !483)
!575 = !DILocation(line: 306, column: 2, scope: !483)
!576 = !DILocation(line: 306, column: 34, scope: !483)
!577 = !DILocation(line: 306, column: 46, scope: !483)
!578 = !DILocation(line: 309, column: 17, scope: !483)
!579 = !DILocation(line: 310, column: 1, scope: !483)
!580 = distinct !DISubprogram(name: "i2f", linkageName: "_Z3i2fi", scope: !17, file: !17, line: 49, type: !581, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!581 = !DISubroutineType(types: !582)
!582 = !{!16, !5}
!583 = !DILocalVariable(name: "i", arg: 1, scope: !580, file: !17, line: 49, type: !5)
!584 = !DILocation(line: 49, column: 23, scope: !580)
!585 = !DILocation(line: 51, column: 9, scope: !580)
!586 = !DILocation(line: 51, column: 11, scope: !580)
!587 = !DILocation(line: 51, column: 2, scope: !580)
!588 = distinct !DISubprogram(name: "fuelcen_activate", linkageName: "_Z16fuelcen_activateP7segmenti", scope: !15, file: !15, line: 314, type: !589, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !74, !5}
!591 = !DILocalVariable(name: "segp", arg: 1, scope: !588, file: !15, line: 314, type: !74)
!592 = !DILocation(line: 314, column: 32, scope: !588)
!593 = !DILocalVariable(name: "station_type", arg: 2, scope: !588, file: !15, line: 314, type: !5)
!594 = !DILocation(line: 314, column: 42, scope: !588)
!595 = !DILocalVariable(name: "segnum", scope: !588, file: !15, line: 316, type: !5)
!596 = !DILocation(line: 316, column: 6, scope: !588)
!597 = !DILocation(line: 316, column: 21, scope: !588)
!598 = !DILocation(line: 316, column: 26, scope: !588)
!599 = !DILocation(line: 316, column: 20, scope: !588)
!600 = !DILocalVariable(name: "seg2p", scope: !588, file: !15, line: 336, type: !409)
!601 = !DILocation(line: 336, column: 12, scope: !588)
!602 = !DILocation(line: 336, column: 31, scope: !588)
!603 = !DILocation(line: 336, column: 21, scope: !588)
!604 = !DILocation(line: 338, column: 19, scope: !588)
!605 = !DILocation(line: 338, column: 2, scope: !588)
!606 = !DILocation(line: 338, column: 9, scope: !588)
!607 = !DILocation(line: 338, column: 17, scope: !588)
!608 = !DILocation(line: 340, column: 6, scope: !609)
!609 = distinct !DILexicalBlock(scope: !588, file: !15, line: 340, column: 6)
!610 = !DILocation(line: 340, column: 13, scope: !609)
!611 = !DILocation(line: 340, column: 21, scope: !609)
!612 = !DILocation(line: 341, column: 17, scope: !609)
!613 = !DILocation(line: 341, column: 3, scope: !609)
!614 = !DILocation(line: 343, column: 18, scope: !609)
!615 = !DILocation(line: 343, column: 3, scope: !609)
!616 = !DILocation(line: 345, column: 1, scope: !588)
!617 = distinct !DISubprogram(name: "trigger_matcen", linkageName: "_Z14trigger_matceni", scope: !15, file: !15, line: 354, type: !618, scopeLine: 355, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !5}
!620 = !DILocalVariable(name: "segnum", arg: 1, scope: !617, file: !15, line: 354, type: !5)
!621 = !DILocation(line: 354, column: 25, scope: !617)
!622 = !DILocalVariable(name: "seg2p", scope: !617, file: !15, line: 357, type: !409)
!623 = !DILocation(line: 357, column: 12, scope: !617)
!624 = !DILocation(line: 357, column: 31, scope: !617)
!625 = !DILocation(line: 357, column: 21, scope: !617)
!626 = !DILocalVariable(name: "pos", scope: !617, file: !15, line: 358, type: !61)
!627 = !DILocation(line: 358, column: 13, scope: !617)
!628 = !DILocalVariable(name: "delta", scope: !617, file: !15, line: 358, type: !61)
!629 = !DILocation(line: 358, column: 18, scope: !617)
!630 = !DILocalVariable(name: "robotcen", scope: !617, file: !15, line: 359, type: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!632 = !DILocation(line: 359, column: 14, scope: !617)
!633 = !DILocalVariable(name: "objnum", scope: !617, file: !15, line: 360, type: !5)
!634 = !DILocation(line: 360, column: 8, scope: !617)
!635 = !DILocation(line: 362, column: 2, scope: !617)
!636 = !DILocation(line: 364, column: 2, scope: !617)
!637 = !DILocation(line: 365, column: 2, scope: !617)
!638 = !DILocation(line: 366, column: 2, scope: !617)
!639 = !DILocation(line: 0, scope: !617)
!640 = !DILocation(line: 368, column: 35, scope: !617)
!641 = !DILocation(line: 368, column: 42, scope: !617)
!642 = !DILocation(line: 368, column: 22, scope: !617)
!643 = !DILocation(line: 368, column: 54, scope: !617)
!644 = !DILocation(line: 368, column: 14, scope: !617)
!645 = !DILocation(line: 368, column: 11, scope: !617)
!646 = !DILocation(line: 370, column: 6, scope: !647)
!647 = distinct !DILexicalBlock(scope: !617, file: !15, line: 370, column: 6)
!648 = !DILocation(line: 370, column: 16, scope: !647)
!649 = !DILocation(line: 370, column: 24, scope: !647)
!650 = !DILocation(line: 371, column: 3, scope: !647)
!651 = !DILocation(line: 373, column: 7, scope: !652)
!652 = distinct !DILexicalBlock(scope: !617, file: !15, line: 373, column: 6)
!653 = !DILocation(line: 373, column: 17, scope: !652)
!654 = !DILocation(line: 373, column: 6, scope: !652)
!655 = !DILocation(line: 374, column: 3, scope: !652)
!656 = !DILocation(line: 377, column: 6, scope: !657)
!657 = distinct !DILexicalBlock(scope: !617, file: !15, line: 377, column: 6)
!658 = !DILocation(line: 377, column: 23, scope: !657)
!659 = !DILocation(line: 377, column: 27, scope: !657)
!660 = !DILocation(line: 378, column: 3, scope: !657)
!661 = !DILocation(line: 378, column: 13, scope: !657)
!662 = !DILocation(line: 378, column: 18, scope: !657)
!663 = !DILocation(line: 380, column: 2, scope: !617)
!664 = !DILocation(line: 380, column: 12, scope: !617)
!665 = !DILocation(line: 380, column: 18, scope: !617)
!666 = !DILocation(line: 381, column: 2, scope: !617)
!667 = !DILocation(line: 381, column: 12, scope: !617)
!668 = !DILocation(line: 381, column: 20, scope: !617)
!669 = !DILocation(line: 382, column: 27, scope: !617)
!670 = !DILocation(line: 382, column: 44, scope: !617)
!671 = !DILocation(line: 382, column: 23, scope: !617)
!672 = !DILocation(line: 382, column: 2, scope: !617)
!673 = !DILocation(line: 382, column: 12, scope: !617)
!674 = !DILocation(line: 382, column: 21, scope: !617)
!675 = !DILocation(line: 383, column: 27, scope: !617)
!676 = !DILocation(line: 383, column: 2, scope: !617)
!677 = !DILocation(line: 383, column: 12, scope: !617)
!678 = !DILocation(line: 383, column: 25, scope: !617)
!679 = !DILocation(line: 386, column: 8, scope: !617)
!680 = !DILocation(line: 386, column: 18, scope: !617)
!681 = !DILocation(line: 386, column: 6, scope: !617)
!682 = !DILocation(line: 387, column: 40, scope: !617)
!683 = !DILocation(line: 387, column: 31, scope: !617)
!684 = !DILocation(line: 387, column: 48, scope: !617)
!685 = !DILocation(line: 387, column: 22, scope: !617)
!686 = !DILocation(line: 387, column: 60, scope: !617)
!687 = !DILocation(line: 387, column: 70, scope: !617)
!688 = !DILocation(line: 387, column: 2, scope: !617)
!689 = !DILocation(line: 388, column: 2, scope: !617)
!690 = !DILocation(line: 389, column: 36, scope: !617)
!691 = !DILocation(line: 389, column: 11, scope: !617)
!692 = !DILocation(line: 389, column: 9, scope: !617)
!693 = !DILocation(line: 390, column: 6, scope: !694)
!694 = distinct !DILexicalBlock(scope: !617, file: !15, line: 390, column: 6)
!695 = !DILocation(line: 390, column: 13, scope: !694)
!696 = !DILocation(line: 391, column: 30, scope: !697)
!697 = distinct !DILexicalBlock(scope: !694, file: !15, line: 390, column: 20)
!698 = !DILocation(line: 391, column: 11, scope: !697)
!699 = !DILocation(line: 391, column: 3, scope: !697)
!700 = !DILocation(line: 391, column: 19, scope: !697)
!701 = !DILocation(line: 391, column: 28, scope: !697)
!702 = !DILocation(line: 392, column: 48, scope: !697)
!703 = !DILocation(line: 392, column: 11, scope: !697)
!704 = !DILocation(line: 392, column: 3, scope: !697)
!705 = !DILocation(line: 392, column: 19, scope: !697)
!706 = !DILocation(line: 392, column: 36, scope: !697)
!707 = !DILocation(line: 392, column: 46, scope: !697)
!708 = !DILocation(line: 393, column: 2, scope: !697)
!709 = !DILocation(line: 395, column: 3, scope: !710)
!710 = distinct !DILexicalBlock(scope: !694, file: !15, line: 394, column: 7)
!711 = !DILocation(line: 396, column: 3, scope: !710)
!712 = !DILocation(line: 399, column: 1, scope: !617)
!713 = distinct !DISubprogram(name: "create_morph_robot", linkageName: "_Z18create_morph_robotP7segmentP10vms_vectori", scope: !15, file: !15, line: 452, type: !714, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !74, !848, !5}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !718, line: 259, baseType: !719)
!718 = !DIFile(filename: "main_d2/object.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "1f2325d356aae4b692933d2aae4f3afd")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !718, line: 210, size: 2144, flags: DIFlagTypePassByValue, elements: !720, identifier: "_ZTS6object")
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !740, !741, !742, !743, !744, !745, !746, !747, !748, !766, !820}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !719, file: !718, line: 212, baseType: !5, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !719, file: !718, line: 213, baseType: !86, size: 8, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !719, file: !718, line: 214, baseType: !86, size: 8, offset: 40)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !719, file: !718, line: 215, baseType: !38, size: 16, offset: 48)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !719, file: !718, line: 215, baseType: !38, size: 16, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !719, file: !718, line: 216, baseType: !86, size: 8, offset: 80)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "movement_type", scope: !719, file: !718, line: 217, baseType: !86, size: 8, offset: 88)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "render_type", scope: !719, file: !718, line: 218, baseType: !86, size: 8, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !719, file: !718, line: 219, baseType: !86, size: 8, offset: 104)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !719, file: !718, line: 220, baseType: !38, size: 16, offset: 112)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "attached_obj", scope: !719, file: !718, line: 221, baseType: !38, size: 16, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !719, file: !718, line: 222, baseType: !61, size: 96, offset: 160)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "orient", scope: !719, file: !718, line: 223, baseType: !734, size: 288, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_matrix", file: !62, line: 47, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_matrix", file: !62, line: 44, size: 288, flags: DIFlagTypePassByValue, elements: !736, identifier: "_ZTS10vms_matrix")
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rvec", scope: !735, file: !62, line: 46, baseType: !61, size: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "uvec", scope: !735, file: !62, line: 46, baseType: !61, size: 96, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fvec", scope: !735, file: !62, line: 46, baseType: !61, size: 96, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !719, file: !718, line: 224, baseType: !16, size: 32, offset: 544)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "shields", scope: !719, file: !718, line: 225, baseType: !16, size: 32, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !719, file: !718, line: 226, baseType: !61, size: 96, offset: 608)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "contains_type", scope: !719, file: !718, line: 227, baseType: !6, size: 8, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "contains_id", scope: !719, file: !718, line: 228, baseType: !6, size: 8, offset: 712)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "contains_count", scope: !719, file: !718, line: 229, baseType: !6, size: 8, offset: 720)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "matcen_creator", scope: !719, file: !718, line: 230, baseType: !6, size: 8, offset: 728)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lifeleft", scope: !719, file: !718, line: 231, baseType: !16, size: 32, offset: 736)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mtype", scope: !719, file: !718, line: 240, baseType: !749, size: 512, offset: 768)
!749 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !719, file: !718, line: 236, size: 512, flags: DIFlagTypePassByValue, elements: !750, identifier: "_ZTSN6objectUt_E")
!750 = !{!751, !765}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "phys_info", scope: !749, file: !718, line: 238, baseType: !752, size: 512)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "physics_info", file: !718, line: 153, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "physics_info", file: !718, line: 142, size: 512, flags: DIFlagTypePassByValue, elements: !754, identifier: "_ZTS12physics_info")
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !764}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !753, file: !718, line: 144, baseType: !61, size: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "thrust", scope: !753, file: !718, line: 145, baseType: !61, size: 96, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !753, file: !718, line: 146, baseType: !16, size: 32, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "drag", scope: !753, file: !718, line: 147, baseType: !16, size: 32, offset: 224)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "brakes", scope: !753, file: !718, line: 148, baseType: !16, size: 32, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rotvel", scope: !753, file: !718, line: 149, baseType: !61, size: 96, offset: 288)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rotthrust", scope: !753, file: !718, line: 150, baseType: !61, size: 96, offset: 384)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "turnroll", scope: !753, file: !718, line: 151, baseType: !763, size: 16, offset: 480)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixang", file: !17, line: 21, baseType: !38)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !753, file: !718, line: 152, baseType: !253, size: 16, offset: 496)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "spin_rate", scope: !749, file: !718, line: 239, baseType: !61, size: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !719, file: !718, line: 250, baseType: !767, size: 256, offset: 1280)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !719, file: !718, line: 243, size: 256, flags: DIFlagTypePassByValue, elements: !768, identifier: "_ZTSN6objectUt0_E")
!768 = !{!769, !780, !790, !808, !813}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "laser_info", scope: !767, file: !718, line: 245, baseType: !770, size: 160)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "laser_info_t", file: !718, line: 166, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "laser_info_s", file: !718, line: 157, size: 160, flags: DIFlagTypePassByValue, elements: !772, identifier: "_ZTS12laser_info_s")
!772 = !{!773, !774, !775, !776, !777, !778, !779}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "parent_type", scope: !771, file: !718, line: 159, baseType: !38, size: 16)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "parent_num", scope: !771, file: !718, line: 160, baseType: !38, size: 16, offset: 16)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "parent_signature", scope: !771, file: !718, line: 161, baseType: !5, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !771, file: !718, line: 162, baseType: !16, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "last_hitobj", scope: !771, file: !718, line: 163, baseType: !38, size: 16, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "track_goal", scope: !771, file: !718, line: 164, baseType: !38, size: 16, offset: 112)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !771, file: !718, line: 165, baseType: !16, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "expl_info", scope: !767, file: !718, line: 246, baseType: !781, size: 128)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "explosion_info", file: !718, line: 176, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "explosion_info", file: !718, line: 168, size: 128, flags: DIFlagTypePassByValue, elements: !783, identifier: "_ZTS14explosion_info")
!783 = !{!784, !785, !786, !787, !788, !789}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "spawn_time", scope: !782, file: !718, line: 170, baseType: !16, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "delete_time", scope: !782, file: !718, line: 171, baseType: !16, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "delete_objnum", scope: !782, file: !718, line: 172, baseType: !38, size: 16, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "attach_parent", scope: !782, file: !718, line: 173, baseType: !38, size: 16, offset: 80)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "prev_attach", scope: !782, file: !718, line: 174, baseType: !38, size: 16, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next_attach", scope: !782, file: !718, line: 175, baseType: !38, size: 16, offset: 112)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ai_info", scope: !767, file: !718, line: 247, baseType: !791, size: 256)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "ai_static", file: !792, line: 144, baseType: !793)
!792 = !DIFile(filename: "main_d2/aistruct.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d122430e792a0ddc0f9eaa08ad217628")
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ai_static", file: !792, line: 127, size: 256, flags: DIFlagTypePassByValue, elements: !794, identifier: "_ZTS9ai_static")
!794 = !{!795, !796, !800, !801, !802, !803, !804, !805, !806, !807}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "behavior", scope: !793, file: !792, line: 128, baseType: !86, size: 8)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !793, file: !792, line: 129, baseType: !797, size: 88, offset: 8)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 88, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 11)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "hide_segment", scope: !793, file: !792, line: 130, baseType: !38, size: 16, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "hide_index", scope: !793, file: !792, line: 131, baseType: !38, size: 16, offset: 112)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !793, file: !792, line: 132, baseType: !38, size: 16, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cur_path_index", scope: !793, file: !792, line: 133, baseType: !6, size: 8, offset: 144)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dying_sound_playing", scope: !793, file: !792, line: 134, baseType: !6, size: 8, offset: 152)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_num", scope: !793, file: !792, line: 139, baseType: !38, size: 16, offset: 160)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_signature", scope: !793, file: !792, line: 140, baseType: !5, size: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dying_start_time", scope: !793, file: !792, line: 141, baseType: !16, size: 32, offset: 224)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "light_info", scope: !767, file: !718, line: 248, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "light_info_t", file: !718, line: 181, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "light_info_s", file: !718, line: 178, size: 32, flags: DIFlagTypePassByValue, elements: !811, identifier: "_ZTS12light_info_s")
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !810, file: !718, line: 180, baseType: !16, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "powerup_info", scope: !767, file: !718, line: 249, baseType: !814, size: 96)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "powerup_info_t", file: !718, line: 190, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "powerup_info_s", file: !718, line: 185, size: 96, flags: DIFlagTypePassByValue, elements: !816, identifier: "_ZTS14powerup_info_s")
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !815, file: !718, line: 187, baseType: !5, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !815, file: !718, line: 188, baseType: !16, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !815, file: !718, line: 189, baseType: !5, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !719, file: !718, line: 257, baseType: !821, size: 608, offset: 1536)
!821 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !719, file: !718, line: 253, size: 608, flags: DIFlagTypePassByValue, elements: !822, identifier: "_ZTSN6objectUt1_E")
!822 = !{!823, !841}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pobj_info", scope: !821, file: !718, line: 255, baseType: !824, size: 608)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "polyobj_info", file: !718, line: 208, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "polyobj_info", file: !718, line: 201, size: 608, flags: DIFlagTypePassByValue, elements: !826, identifier: "_ZTS12polyobj_info")
!826 = !{!827, !828, !838, !839, !840}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "model_num", scope: !825, file: !718, line: 203, baseType: !5, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "anim_angles", scope: !825, file: !718, line: 204, baseType: !829, size: 480, offset: 32)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 480, elements: !836)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_angvec", file: !62, line: 40, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_angvec", file: !62, line: 37, size: 48, flags: DIFlagTypePassByValue, elements: !832, identifier: "_ZTS10vms_angvec")
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !831, file: !62, line: 39, baseType: !763, size: 16)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !831, file: !62, line: 39, baseType: !763, size: 16, offset: 16)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !831, file: !62, line: 39, baseType: !763, size: 16, offset: 32)
!836 = !{!837}
!837 = !DISubrange(count: 10)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "subobj_flags", scope: !825, file: !718, line: 205, baseType: !5, size: 32, offset: 512)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_override", scope: !825, file: !718, line: 206, baseType: !5, size: 32, offset: 544)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "alt_textures", scope: !825, file: !718, line: 207, baseType: !5, size: 32, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_info", scope: !821, file: !718, line: 256, baseType: !842, size: 96)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "vclip_info_t", file: !718, line: 197, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vclip_info_s", file: !718, line: 192, size: 96, flags: DIFlagTypePassByValue, elements: !844, identifier: "_ZTS12vclip_info_s")
!844 = !{!845, !846, !847}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_num", scope: !843, file: !718, line: 194, baseType: !5, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "frametime", scope: !843, file: !718, line: 195, baseType: !16, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !843, file: !718, line: 196, baseType: !6, size: 8, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!849 = !DILocalVariable(name: "segp", arg: 1, scope: !713, file: !15, line: 452, type: !74)
!850 = !DILocation(line: 452, column: 37, scope: !713)
!851 = !DILocalVariable(name: "object_pos", arg: 2, scope: !713, file: !15, line: 452, type: !848)
!852 = !DILocation(line: 452, column: 55, scope: !713)
!853 = !DILocalVariable(name: "object_id", arg: 3, scope: !713, file: !15, line: 452, type: !5)
!854 = !DILocation(line: 452, column: 71, scope: !713)
!855 = !DILocalVariable(name: "objnum", scope: !713, file: !15, line: 454, type: !38)
!856 = !DILocation(line: 454, column: 9, scope: !713)
!857 = !DILocalVariable(name: "obj", scope: !713, file: !15, line: 455, type: !716)
!858 = !DILocation(line: 455, column: 10, scope: !713)
!859 = !DILocalVariable(name: "default_behavior", scope: !713, file: !15, line: 456, type: !5)
!860 = !DILocation(line: 456, column: 7, scope: !713)
!861 = !DILocation(line: 458, column: 10, scope: !713)
!862 = !DILocation(line: 458, column: 2, scope: !713)
!863 = !DILocation(line: 458, column: 22, scope: !713)
!864 = !DILocation(line: 458, column: 38, scope: !713)
!865 = !DILocation(line: 459, column: 10, scope: !713)
!866 = !DILocation(line: 459, column: 2, scope: !713)
!867 = !DILocation(line: 459, column: 22, scope: !713)
!868 = !DILocation(line: 459, column: 38, scope: !713)
!869 = !DILocation(line: 461, column: 33, scope: !713)
!870 = !DILocation(line: 461, column: 44, scope: !713)
!871 = !DILocation(line: 461, column: 49, scope: !713)
!872 = !DILocation(line: 461, column: 61, scope: !713)
!873 = !DILocation(line: 462, column: 51, scope: !713)
!874 = !DILocation(line: 462, column: 40, scope: !713)
!875 = !DILocation(line: 462, column: 62, scope: !713)
!876 = !DILocation(line: 462, column: 25, scope: !713)
!877 = !DILocation(line: 462, column: 73, scope: !713)
!878 = !DILocation(line: 461, column: 11, scope: !713)
!879 = !DILocation(line: 461, column: 9, scope: !713)
!880 = !DILocation(line: 465, column: 6, scope: !881)
!881 = distinct !DILexicalBlock(scope: !713, file: !15, line: 465, column: 6)
!882 = !DILocation(line: 465, column: 13, scope: !881)
!883 = !DILocation(line: 466, column: 3, scope: !884)
!884 = distinct !DILexicalBlock(scope: !881, file: !15, line: 465, column: 18)
!885 = !DILocation(line: 467, column: 3, scope: !884)
!886 = !DILocation(line: 468, column: 3, scope: !884)
!887 = !DILocation(line: 471, column: 17, scope: !713)
!888 = !DILocation(line: 471, column: 9, scope: !713)
!889 = !DILocation(line: 471, column: 6, scope: !713)
!890 = !DILocation(line: 475, column: 46, scope: !713)
!891 = !DILocation(line: 475, column: 51, scope: !713)
!892 = !DILocation(line: 475, column: 35, scope: !713)
!893 = !DILocation(line: 475, column: 55, scope: !713)
!894 = !DILocation(line: 475, column: 2, scope: !713)
!895 = !DILocation(line: 475, column: 7, scope: !713)
!896 = !DILocation(line: 475, column: 23, scope: !713)
!897 = !DILocation(line: 475, column: 33, scope: !713)
!898 = !DILocation(line: 476, column: 2, scope: !713)
!899 = !DILocation(line: 476, column: 7, scope: !713)
!900 = !DILocation(line: 476, column: 23, scope: !713)
!901 = !DILocation(line: 476, column: 36, scope: !713)
!902 = !DILocation(line: 480, column: 41, scope: !713)
!903 = !DILocation(line: 480, column: 46, scope: !713)
!904 = !DILocation(line: 480, column: 30, scope: !713)
!905 = !DILocation(line: 480, column: 50, scope: !713)
!906 = !DILocation(line: 480, column: 2, scope: !713)
!907 = !DILocation(line: 480, column: 7, scope: !713)
!908 = !DILocation(line: 480, column: 23, scope: !713)
!909 = !DILocation(line: 480, column: 28, scope: !713)
!910 = !DILocation(line: 481, column: 41, scope: !713)
!911 = !DILocation(line: 481, column: 46, scope: !713)
!912 = !DILocation(line: 481, column: 30, scope: !713)
!913 = !DILocation(line: 481, column: 50, scope: !713)
!914 = !DILocation(line: 481, column: 2, scope: !713)
!915 = !DILocation(line: 481, column: 7, scope: !713)
!916 = !DILocation(line: 481, column: 23, scope: !713)
!917 = !DILocation(line: 481, column: 28, scope: !713)
!918 = !DILocation(line: 483, column: 2, scope: !713)
!919 = !DILocation(line: 483, column: 7, scope: !713)
!920 = !DILocation(line: 483, column: 23, scope: !713)
!921 = !DILocation(line: 483, column: 29, scope: !713)
!922 = !DILocation(line: 485, column: 28, scope: !713)
!923 = !DILocation(line: 485, column: 33, scope: !713)
!924 = !DILocation(line: 485, column: 17, scope: !713)
!925 = !DILocation(line: 485, column: 37, scope: !713)
!926 = !DILocation(line: 485, column: 2, scope: !713)
!927 = !DILocation(line: 485, column: 7, scope: !713)
!928 = !DILocation(line: 485, column: 15, scope: !713)
!929 = !DILocation(line: 487, column: 32, scope: !713)
!930 = !DILocation(line: 487, column: 37, scope: !713)
!931 = !DILocation(line: 487, column: 21, scope: !713)
!932 = !DILocation(line: 487, column: 41, scope: !713)
!933 = !DILocation(line: 487, column: 19, scope: !713)
!934 = !DILocation(line: 489, column: 17, scope: !713)
!935 = !DILocation(line: 489, column: 21, scope: !713)
!936 = !DILocation(line: 489, column: 32, scope: !713)
!937 = !DILocation(line: 489, column: 2, scope: !713)
!938 = !DILocation(line: 491, column: 24, scope: !713)
!939 = !DILocation(line: 491, column: 2, scope: !713)
!940 = !DILocation(line: 493, column: 51, scope: !713)
!941 = !DILocation(line: 493, column: 31, scope: !713)
!942 = !DILocation(line: 493, column: 16, scope: !713)
!943 = !DILocation(line: 493, column: 2, scope: !713)
!944 = !DILocation(line: 493, column: 24, scope: !713)
!945 = !DILocation(line: 493, column: 29, scope: !713)
!946 = !DILocation(line: 495, column: 9, scope: !713)
!947 = !DILocation(line: 495, column: 2, scope: !713)
!948 = !DILocation(line: 496, column: 1, scope: !713)
!949 = distinct !DISubprogram(name: "robotmaker_proc", linkageName: "_Z15robotmaker_procP10FuelCenter", scope: !15, file: !15, line: 505, type: !950, scopeLine: 506, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !631}
!952 = !DILocalVariable(name: "robotcen", arg: 1, scope: !949, file: !15, line: 505, type: !631)
!953 = !DILocation(line: 505, column: 34, scope: !949)
!954 = !DILocalVariable(name: "dist_to_player", scope: !949, file: !15, line: 507, type: !16)
!955 = !DILocation(line: 507, column: 7, scope: !949)
!956 = !DILocalVariable(name: "cur_object_loc", scope: !949, file: !15, line: 508, type: !61)
!957 = !DILocation(line: 508, column: 13, scope: !949)
!958 = !DILocalVariable(name: "matcen_num", scope: !949, file: !15, line: 509, type: !5)
!959 = !DILocation(line: 509, column: 7, scope: !949)
!960 = !DILocalVariable(name: "segnum", scope: !949, file: !15, line: 509, type: !5)
!961 = !DILocation(line: 509, column: 19, scope: !949)
!962 = !DILocalVariable(name: "objnum", scope: !949, file: !15, line: 509, type: !5)
!963 = !DILocation(line: 509, column: 27, scope: !949)
!964 = !DILocalVariable(name: "obj", scope: !949, file: !15, line: 510, type: !716)
!965 = !DILocation(line: 510, column: 10, scope: !949)
!966 = !DILocalVariable(name: "top_time", scope: !949, file: !15, line: 511, type: !16)
!967 = !DILocation(line: 511, column: 7, scope: !949)
!968 = !DILocalVariable(name: "direction", scope: !949, file: !15, line: 512, type: !61)
!969 = !DILocation(line: 512, column: 13, scope: !949)
!970 = !DILocation(line: 514, column: 6, scope: !971)
!971 = distinct !DILexicalBlock(scope: !949, file: !15, line: 514, column: 6)
!972 = !DILocation(line: 514, column: 16, scope: !971)
!973 = !DILocation(line: 514, column: 24, scope: !971)
!974 = !DILocation(line: 515, column: 3, scope: !971)
!975 = !DILocation(line: 517, column: 6, scope: !976)
!976 = distinct !DILexicalBlock(scope: !949, file: !15, line: 517, column: 6)
!977 = !DILocation(line: 517, column: 16, scope: !976)
!978 = !DILocation(line: 517, column: 29, scope: !976)
!979 = !DILocation(line: 519, column: 29, scope: !980)
!980 = distinct !DILexicalBlock(scope: !976, file: !15, line: 518, column: 2)
!981 = !DILocation(line: 519, column: 3, scope: !980)
!982 = !DILocation(line: 519, column: 13, scope: !980)
!983 = !DILocation(line: 519, column: 26, scope: !980)
!984 = !DILocation(line: 520, column: 7, scope: !985)
!985 = distinct !DILexicalBlock(scope: !980, file: !15, line: 520, column: 7)
!986 = !DILocation(line: 520, column: 17, scope: !985)
!987 = !DILocation(line: 520, column: 30, scope: !985)
!988 = !DILocation(line: 522, column: 4, scope: !989)
!989 = distinct !DILexicalBlock(scope: !985, file: !15, line: 521, column: 3)
!990 = !DILocation(line: 523, column: 4, scope: !989)
!991 = !DILocation(line: 523, column: 14, scope: !989)
!992 = !DILocation(line: 523, column: 22, scope: !989)
!993 = !DILocation(line: 524, column: 3, scope: !989)
!994 = !DILocation(line: 525, column: 2, scope: !980)
!995 = !DILocation(line: 541, column: 6, scope: !996)
!996 = distinct !DILexicalBlock(scope: !949, file: !15, line: 541, column: 6)
!997 = !DILocation(line: 541, column: 16, scope: !996)
!998 = !DILocation(line: 541, column: 25, scope: !996)
!999 = !DILocation(line: 543, column: 3, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !996, file: !15, line: 542, column: 2)
!1001 = !DILocation(line: 546, column: 25, scope: !949)
!1002 = !DILocation(line: 546, column: 35, scope: !949)
!1003 = !DILocation(line: 546, column: 15, scope: !949)
!1004 = !DILocation(line: 546, column: 43, scope: !949)
!1005 = !DILocation(line: 546, column: 13, scope: !949)
!1006 = !DILocation(line: 549, column: 6, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !949, file: !15, line: 549, column: 6)
!1008 = !DILocation(line: 549, column: 17, scope: !1007)
!1009 = !DILocation(line: 551, column: 3, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1007, file: !15, line: 550, column: 2)
!1011 = !DILocation(line: 552, column: 3, scope: !1010)
!1012 = !DILocation(line: 555, column: 19, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !949, file: !15, line: 555, column: 6)
!1014 = !DILocation(line: 555, column: 6, scope: !1013)
!1015 = !DILocation(line: 555, column: 31, scope: !1013)
!1016 = !DILocation(line: 555, column: 46, scope: !1013)
!1017 = !DILocation(line: 555, column: 51, scope: !1013)
!1018 = !DILocation(line: 555, column: 67, scope: !1013)
!1019 = !DILocation(line: 555, column: 54, scope: !1013)
!1020 = !DILocation(line: 555, column: 79, scope: !1013)
!1021 = !DILocation(line: 555, column: 94, scope: !1013)
!1022 = !DILocation(line: 557, column: 3, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1013, file: !15, line: 555, column: 100)
!1024 = !DILocation(line: 562, column: 15, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !949, file: !15, line: 562, column: 6)
!1026 = !DILocation(line: 562, column: 7, scope: !1025)
!1027 = !DILocation(line: 562, column: 27, scope: !1025)
!1028 = !DILocation(line: 562, column: 54, scope: !1025)
!1029 = !DILocation(line: 562, column: 46, scope: !1025)
!1030 = !DILocation(line: 562, column: 66, scope: !1025)
!1031 = !DILocation(line: 562, column: 44, scope: !1025)
!1032 = !DILocation(line: 562, column: 87, scope: !1025)
!1033 = !DILocation(line: 562, column: 113, scope: !1025)
!1034 = !DILocation(line: 562, column: 111, scope: !1025)
!1035 = !DILocation(line: 562, column: 83, scope: !1025)
!1036 = !DILocation(line: 564, column: 7, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !15, line: 564, column: 7)
!1038 = distinct !DILexicalBlock(scope: !1025, file: !15, line: 562, column: 132)
!1039 = !DILocation(line: 564, column: 20, scope: !1037)
!1040 = !DILocation(line: 564, column: 40, scope: !1037)
!1041 = !DILocation(line: 564, column: 18, scope: !1037)
!1042 = !DILocation(line: 566, column: 4, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1037, file: !15, line: 565, column: 3)
!1044 = !DILocation(line: 567, column: 26, scope: !1043)
!1045 = !DILocation(line: 567, column: 24, scope: !1043)
!1046 = !DILocation(line: 568, column: 3, scope: !1043)
!1047 = !DILocation(line: 570, column: 3, scope: !1038)
!1048 = !DILocation(line: 573, column: 21, scope: !949)
!1049 = !DILocation(line: 573, column: 2, scope: !949)
!1050 = !DILocation(line: 573, column: 12, scope: !949)
!1051 = !DILocation(line: 573, column: 18, scope: !949)
!1052 = !DILocation(line: 575, column: 10, scope: !949)
!1053 = !DILocation(line: 575, column: 20, scope: !949)
!1054 = !DILocation(line: 575, column: 2, scope: !949)
!1055 = !DILocation(line: 578, column: 7, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !15, line: 578, column: 7)
!1057 = distinct !DILexicalBlock(scope: !949, file: !15, line: 576, column: 2)
!1058 = !DILocation(line: 578, column: 17, scope: !1056)
!1059 = !DILocation(line: 580, column: 15, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1056, file: !15, line: 579, column: 3)
!1061 = !DILocation(line: 580, column: 13, scope: !1060)
!1062 = !DILocation(line: 581, column: 3, scope: !1060)
!1063 = !DILocation(line: 584, column: 40, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1056, file: !15, line: 583, column: 3)
!1065 = !DILocation(line: 584, column: 55, scope: !1064)
!1066 = !DILocation(line: 584, column: 61, scope: !1064)
!1067 = !DILocation(line: 584, column: 71, scope: !1064)
!1068 = !DILocation(line: 584, column: 21, scope: !1064)
!1069 = !DILocation(line: 584, column: 19, scope: !1064)
!1070 = !DILocation(line: 585, column: 15, scope: !1064)
!1071 = !DILocation(line: 585, column: 30, scope: !1064)
!1072 = !DILocation(line: 585, column: 37, scope: !1064)
!1073 = !DILocation(line: 585, column: 46, scope: !1064)
!1074 = !DILocation(line: 585, column: 35, scope: !1064)
!1075 = !DILocation(line: 585, column: 50, scope: !1064)
!1076 = !DILocation(line: 585, column: 13, scope: !1064)
!1077 = !DILocation(line: 586, column: 8, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1064, file: !15, line: 586, column: 8)
!1079 = !DILocation(line: 586, column: 19, scope: !1078)
!1080 = !DILocation(line: 586, column: 17, scope: !1078)
!1081 = !DILocation(line: 587, column: 16, scope: !1078)
!1082 = !DILocation(line: 587, column: 33, scope: !1078)
!1083 = !DILocation(line: 587, column: 31, scope: !1078)
!1084 = !DILocation(line: 587, column: 14, scope: !1078)
!1085 = !DILocation(line: 587, column: 5, scope: !1078)
!1086 = !DILocation(line: 588, column: 8, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1064, file: !15, line: 588, column: 8)
!1088 = !DILocation(line: 588, column: 17, scope: !1087)
!1089 = !DILocation(line: 589, column: 31, scope: !1087)
!1090 = !DILocation(line: 589, column: 40, scope: !1087)
!1091 = !DILocation(line: 589, column: 29, scope: !1087)
!1092 = !DILocation(line: 589, column: 14, scope: !1087)
!1093 = !DILocation(line: 589, column: 5, scope: !1087)
!1094 = !DILocation(line: 594, column: 7, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1057, file: !15, line: 594, column: 7)
!1096 = !DILocation(line: 594, column: 17, scope: !1095)
!1097 = !DILocation(line: 594, column: 25, scope: !1095)
!1098 = !DILocation(line: 594, column: 23, scope: !1095)
!1099 = !DILocalVariable(name: "count", scope: !1100, file: !15, line: 596, type: !5)
!1100 = distinct !DILexicalBlock(scope: !1095, file: !15, line: 595, column: 3)
!1101 = !DILocation(line: 596, column: 8, scope: !1100)
!1102 = !DILocalVariable(name: "i", scope: !1100, file: !15, line: 597, type: !5)
!1103 = !DILocation(line: 597, column: 8, scope: !1100)
!1104 = !DILocalVariable(name: "my_station_num", scope: !1100, file: !15, line: 597, type: !5)
!1105 = !DILocation(line: 597, column: 11, scope: !1100)
!1106 = !DILocation(line: 597, column: 28, scope: !1100)
!1107 = !DILocation(line: 597, column: 37, scope: !1100)
!1108 = !DILocalVariable(name: "obj", scope: !1100, file: !15, line: 598, type: !716)
!1109 = !DILocation(line: 598, column: 12, scope: !1100)
!1110 = !DILocation(line: 601, column: 11, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1100, file: !15, line: 601, column: 4)
!1112 = !DILocation(line: 601, column: 9, scope: !1111)
!1113 = !DILocation(line: 601, column: 16, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1111, file: !15, line: 601, column: 4)
!1115 = !DILocation(line: 601, column: 21, scope: !1114)
!1116 = !DILocation(line: 601, column: 18, scope: !1114)
!1117 = !DILocation(line: 601, column: 4, scope: !1111)
!1118 = !DILocation(line: 602, column: 17, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1114, file: !15, line: 602, column: 9)
!1120 = !DILocation(line: 602, column: 9, scope: !1119)
!1121 = !DILocation(line: 602, column: 20, scope: !1119)
!1122 = !DILocation(line: 602, column: 25, scope: !1119)
!1123 = !DILocation(line: 605, column: 27, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1119, file: !15, line: 605, column: 10)
!1125 = !DILocation(line: 605, column: 19, scope: !1124)
!1126 = !DILocation(line: 605, column: 30, scope: !1124)
!1127 = !DILocation(line: 605, column: 45, scope: !1124)
!1128 = !DILocation(line: 605, column: 18, scope: !1124)
!1129 = !DILocation(line: 605, column: 10, scope: !1124)
!1130 = !DILocation(line: 605, column: 56, scope: !1124)
!1131 = !DILocation(line: 605, column: 53, scope: !1124)
!1132 = !DILocation(line: 606, column: 12, scope: !1124)
!1133 = !DILocation(line: 606, column: 7, scope: !1124)
!1134 = !DILocation(line: 602, column: 28, scope: !1119)
!1135 = !DILocation(line: 601, column: 44, scope: !1114)
!1136 = !DILocation(line: 601, column: 4, scope: !1114)
!1137 = distinct !{!1137, !1117, !1138, !363}
!1138 = !DILocation(line: 606, column: 12, scope: !1111)
!1139 = !DILocation(line: 607, column: 8, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1100, file: !15, line: 607, column: 8)
!1141 = !DILocation(line: 607, column: 16, scope: !1140)
!1142 = !DILocation(line: 607, column: 33, scope: !1140)
!1143 = !DILocation(line: 607, column: 14, scope: !1140)
!1144 = !DILocation(line: 609, column: 5, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1140, file: !15, line: 608, column: 4)
!1146 = !DILocation(line: 610, column: 5, scope: !1145)
!1147 = !DILocation(line: 610, column: 15, scope: !1145)
!1148 = !DILocation(line: 610, column: 21, scope: !1145)
!1149 = !DILocation(line: 611, column: 5, scope: !1145)
!1150 = !DILocation(line: 615, column: 10, scope: !1100)
!1151 = !DILocation(line: 616, column: 13, scope: !1100)
!1152 = !DILocation(line: 616, column: 23, scope: !1100)
!1153 = !DILocation(line: 616, column: 11, scope: !1100)
!1154 = !DILocation(line: 617, column: 27, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1100, file: !15, line: 617, column: 4)
!1156 = !DILocation(line: 617, column: 18, scope: !1155)
!1157 = !DILocation(line: 617, column: 35, scope: !1155)
!1158 = !DILocation(line: 617, column: 16, scope: !1155)
!1159 = !DILocation(line: 617, column: 9, scope: !1155)
!1160 = !DILocation(line: 617, column: 44, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1155, file: !15, line: 617, column: 4)
!1162 = !DILocation(line: 617, column: 51, scope: !1161)
!1163 = !DILocation(line: 617, column: 4, scope: !1155)
!1164 = !DILocation(line: 619, column: 10, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1161, file: !15, line: 618, column: 4)
!1166 = !DILocation(line: 620, column: 9, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1165, file: !15, line: 620, column: 9)
!1168 = !DILocation(line: 620, column: 15, scope: !1167)
!1169 = !DILocation(line: 622, column: 6, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1167, file: !15, line: 621, column: 5)
!1171 = !DILocation(line: 623, column: 6, scope: !1170)
!1172 = !DILocation(line: 624, column: 6, scope: !1170)
!1173 = !DILocation(line: 626, column: 17, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1165, file: !15, line: 626, column: 9)
!1175 = !DILocation(line: 626, column: 9, scope: !1174)
!1176 = !DILocation(line: 626, column: 25, scope: !1174)
!1177 = !DILocation(line: 626, column: 30, scope: !1174)
!1178 = !DILocation(line: 628, column: 56, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1174, file: !15, line: 627, column: 5)
!1180 = !DILocation(line: 628, column: 48, scope: !1179)
!1181 = !DILocation(line: 628, column: 6, scope: !1179)
!1182 = !DILocation(line: 629, column: 24, scope: !1179)
!1183 = !DILocation(line: 629, column: 33, scope: !1179)
!1184 = !DILocation(line: 629, column: 6, scope: !1179)
!1185 = !DILocation(line: 629, column: 16, scope: !1179)
!1186 = !DILocation(line: 629, column: 22, scope: !1179)
!1187 = !DILocation(line: 630, column: 6, scope: !1179)
!1188 = !DILocation(line: 632, column: 22, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1174, file: !15, line: 632, column: 14)
!1190 = !DILocation(line: 632, column: 14, scope: !1189)
!1191 = !DILocation(line: 632, column: 30, scope: !1189)
!1192 = !DILocation(line: 632, column: 35, scope: !1189)
!1193 = !DILocation(line: 634, column: 57, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1189, file: !15, line: 633, column: 5)
!1195 = !DILocation(line: 634, column: 49, scope: !1194)
!1196 = !DILocation(line: 634, column: 6, scope: !1194)
!1197 = !DILocation(line: 635, column: 24, scope: !1194)
!1198 = !DILocation(line: 635, column: 33, scope: !1194)
!1199 = !DILocation(line: 635, column: 6, scope: !1194)
!1200 = !DILocation(line: 635, column: 16, scope: !1194)
!1201 = !DILocation(line: 635, column: 22, scope: !1194)
!1202 = !DILocation(line: 636, column: 6, scope: !1194)
!1203 = !DILocation(line: 638, column: 4, scope: !1165)
!1204 = !DILocation(line: 617, column: 75, scope: !1161)
!1205 = !DILocation(line: 617, column: 67, scope: !1161)
!1206 = !DILocation(line: 617, column: 83, scope: !1161)
!1207 = !DILocation(line: 617, column: 65, scope: !1161)
!1208 = !DILocation(line: 617, column: 4, scope: !1161)
!1209 = distinct !{!1209, !1163, !1210, !363}
!1210 = !DILocation(line: 638, column: 4, scope: !1155)
!1211 = !DILocation(line: 640, column: 54, scope: !1100)
!1212 = !DILocation(line: 640, column: 64, scope: !1100)
!1213 = !DILocation(line: 640, column: 45, scope: !1100)
!1214 = !DILocation(line: 640, column: 4, scope: !1100)
!1215 = !DILocation(line: 642, column: 34, scope: !1100)
!1216 = !DILocation(line: 642, column: 44, scope: !1100)
!1217 = !DILocation(line: 642, column: 69, scope: !1100)
!1218 = !DILocation(line: 642, column: 10, scope: !1100)
!1219 = !DILocation(line: 642, column: 8, scope: !1100)
!1220 = !DILocation(line: 644, column: 8, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1100, file: !15, line: 644, column: 8)
!1222 = !DILocation(line: 645, column: 34, scope: !1221)
!1223 = !DILocation(line: 645, column: 39, scope: !1221)
!1224 = !DILocation(line: 645, column: 57, scope: !1221)
!1225 = !DILocation(line: 645, column: 67, scope: !1221)
!1226 = !DILocation(line: 645, column: 48, scope: !1221)
!1227 = !DILocation(line: 645, column: 5, scope: !1221)
!1228 = !DILocation(line: 647, column: 36, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1100, file: !15, line: 647, column: 8)
!1230 = !DILocation(line: 647, column: 8, scope: !1229)
!1231 = !DILocation(line: 647, column: 46, scope: !1229)
!1232 = !DILocation(line: 649, column: 56, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1229, file: !15, line: 648, column: 4)
!1234 = !DILocation(line: 649, column: 28, scope: !1233)
!1235 = !DILocation(line: 649, column: 67, scope: !1233)
!1236 = !DILocation(line: 649, column: 77, scope: !1233)
!1237 = !DILocation(line: 649, column: 5, scope: !1233)
!1238 = !DILocation(line: 650, column: 4, scope: !1233)
!1239 = !DILocation(line: 651, column: 4, scope: !1100)
!1240 = !DILocation(line: 651, column: 14, scope: !1100)
!1241 = !DILocation(line: 651, column: 19, scope: !1100)
!1242 = !DILocation(line: 652, column: 4, scope: !1100)
!1243 = !DILocation(line: 652, column: 14, scope: !1100)
!1244 = !DILocation(line: 652, column: 20, scope: !1100)
!1245 = !DILocation(line: 654, column: 3, scope: !1100)
!1246 = !DILocation(line: 655, column: 3, scope: !1057)
!1247 = !DILocation(line: 657, column: 7, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1057, file: !15, line: 657, column: 7)
!1249 = !DILocation(line: 657, column: 17, scope: !1248)
!1250 = !DILocation(line: 657, column: 54, scope: !1248)
!1251 = !DILocation(line: 657, column: 64, scope: !1248)
!1252 = !DILocation(line: 657, column: 23, scope: !1248)
!1253 = !DILocation(line: 659, column: 26, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1248, file: !15, line: 657, column: 70)
!1255 = !DILocation(line: 659, column: 4, scope: !1254)
!1256 = !DILocation(line: 659, column: 14, scope: !1254)
!1257 = !DILocation(line: 659, column: 23, scope: !1254)
!1258 = !DILocation(line: 660, column: 4, scope: !1254)
!1259 = !DILocation(line: 660, column: 14, scope: !1254)
!1260 = !DILocation(line: 660, column: 19, scope: !1254)
!1261 = !DILocation(line: 662, column: 4, scope: !1254)
!1262 = !DILocation(line: 662, column: 14, scope: !1254)
!1263 = !DILocation(line: 662, column: 20, scope: !1254)
!1264 = !DILocation(line: 663, column: 54, scope: !1254)
!1265 = !DILocation(line: 663, column: 64, scope: !1254)
!1266 = !DILocation(line: 663, column: 45, scope: !1254)
!1267 = !DILocation(line: 663, column: 4, scope: !1254)
!1268 = !DILocation(line: 666, column: 21, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1254, file: !15, line: 666, column: 8)
!1270 = !DILocation(line: 666, column: 8, scope: !1269)
!1271 = !DILocation(line: 666, column: 33, scope: !1269)
!1272 = !DILocation(line: 666, column: 48, scope: !1269)
!1273 = !DILocation(line: 666, column: 53, scope: !1269)
!1274 = !DILocation(line: 666, column: 69, scope: !1269)
!1275 = !DILocation(line: 666, column: 56, scope: !1269)
!1276 = !DILocation(line: 666, column: 81, scope: !1269)
!1277 = !DILocation(line: 666, column: 96, scope: !1269)
!1278 = !DILocalVariable(name: "type", scope: !1279, file: !15, line: 667, type: !5)
!1279 = distinct !DILexicalBlock(scope: !1269, file: !15, line: 666, column: 102)
!1280 = !DILocation(line: 667, column: 9, scope: !1279)
!1281 = !DILocalVariable(name: "flags", scope: !1279, file: !15, line: 668, type: !257)
!1282 = !DILocation(line: 668, column: 14, scope: !1279)
!1283 = !DILocalVariable(name: "legal_types", scope: !1279, file: !15, line: 669, type: !1284)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, elements: !1285)
!1285 = !{!1286}
!1286 = !DISubrange(count: 64)
!1287 = !DILocation(line: 669, column: 12, scope: !1279)
!1288 = !DILocalVariable(name: "num_types", scope: !1279, file: !15, line: 670, type: !5)
!1289 = !DILocation(line: 670, column: 9, scope: !1279)
!1290 = !DILocalVariable(name: "robot_index", scope: !1279, file: !15, line: 670, type: !5)
!1291 = !DILocation(line: 670, column: 20, scope: !1279)
!1292 = !DILocalVariable(name: "i", scope: !1279, file: !15, line: 670, type: !5)
!1293 = !DILocation(line: 670, column: 33, scope: !1279)
!1294 = !DILocation(line: 672, column: 15, scope: !1279)
!1295 = !DILocation(line: 673, column: 12, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1279, file: !15, line: 673, column: 5)
!1297 = !DILocation(line: 673, column: 10, scope: !1296)
