; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/object.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/object.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.object = type { i32, i8, i8, i16, i16, i8, i8, i8, i8, i16, i16, %struct.vms_vector, %struct.vms_matrix, i32, i32, %struct.vms_vector, i8, i8, i8, i8, i32, %union.anon, %union.anon.0, %union.anon.1 }
%struct.vms_matrix = type { %struct.vms_vector, %struct.vms_vector, %struct.vms_vector }
%struct.vms_vector = type { i32, i32, i32 }
%union.anon = type { %struct.physics_info }
%struct.physics_info = type { %struct.vms_vector, %struct.vms_vector, i32, i32, i32, %struct.vms_vector, %struct.vms_vector, i16, i16 }
%union.anon.0 = type { %struct.ai_static }
%struct.ai_static = type { i8, [11 x i8], i16, i16, i16, i8, i8, i16, i32, i32 }
%union.anon.1 = type { %struct.polyobj_info }
%struct.polyobj_info = type { i32, [10 x %struct.vms_angvec], i32, i32, i32 }
%struct.vms_angvec = type { i16, i16, i16 }
%struct.window_rendered_data = type { i32, ptr, i32, i32, i32, [50 x i16] }
%struct._grs_bitmap = type { i16, i16, i16, i16, i8, i8, i16, ptr, i16, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CollisionResult", scope: !2, file: !165, line: 101, type: !1810, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !162, imports: !527, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "/Users/richard/code/ChocolateDescent/main_d2/object.cpp", directory: "/Users/richard/code/ChocolateDescent/build-c-ref", checksumkind: CSK_MD5, checksum: "c026ede8ff5f56a88873a43d82c60782")
!4 = !{!5, !32, !159}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !7, line: 259, baseType: !8)
!7 = !DIFile(filename: "main_d2/object.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "1f2325d356aae4b692933d2aae4f3afd")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !7, line: 210, size: 2144, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTS6object")
!9 = !{!10, !12, !16, !17, !19, !20, !21, !22, !23, !24, !25, !26, !38, !45, !46, !47, !48, !52, !53, !54, !55, !56, !77, !131}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !8, file: !7, line: 212, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, file: !7, line: 213, baseType: !13, size: 8, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !14, line: 31, baseType: !15)
!14 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!15 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !8, file: !7, line: 214, baseType: !13, size: 8, offset: 40)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !8, file: !7, line: 215, baseType: !18, size: 16, offset: 48)
!18 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !8, file: !7, line: 215, baseType: !18, size: 16, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !8, file: !7, line: 216, baseType: !13, size: 8, offset: 80)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "movement_type", scope: !8, file: !7, line: 217, baseType: !13, size: 8, offset: 88)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "render_type", scope: !8, file: !7, line: 218, baseType: !13, size: 8, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !8, file: !7, line: 219, baseType: !13, size: 8, offset: 104)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !8, file: !7, line: 220, baseType: !18, size: 16, offset: 112)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "attached_obj", scope: !8, file: !7, line: 221, baseType: !18, size: 16, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !8, file: !7, line: 222, baseType: !27, size: 96, offset: 160)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_vector", file: !28, line: 22, baseType: !29)
!28 = !DIFile(filename: "./vecmat/vecmat.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "dfa84e3325c1ea4f5f74699fff5ef2bf")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_vector", file: !28, line: 19, size: 96, flags: DIFlagTypePassByValue, elements: !30, identifier: "_ZTS10vms_vector")
!30 = !{!31, !36, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !28, line: 21, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "fix", file: !33, line: 20, baseType: !34)
!33 = !DIFile(filename: "./fix/fix.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c5006a11bf8b4cb7d963898499eda13a")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !35, line: 30, baseType: !11)
!35 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !28, line: 21, baseType: !32, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !28, line: 21, baseType: !32, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "orient", scope: !8, file: !7, line: 223, baseType: !39, size: 288, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_matrix", file: !28, line: 47, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_matrix", file: !28, line: 44, size: 288, flags: DIFlagTypePassByValue, elements: !41, identifier: "_ZTS10vms_matrix")
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "rvec", scope: !40, file: !28, line: 46, baseType: !27, size: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "uvec", scope: !40, file: !28, line: 46, baseType: !27, size: 96, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fvec", scope: !40, file: !28, line: 46, baseType: !27, size: 96, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !8, file: !7, line: 224, baseType: !32, size: 32, offset: 544)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "shields", scope: !8, file: !7, line: 225, baseType: !32, size: 32, offset: 576)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !8, file: !7, line: 226, baseType: !27, size: 96, offset: 608)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "contains_type", scope: !8, file: !7, line: 227, baseType: !49, size: 8, offset: 704)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !50, line: 30, baseType: !51)
!50 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!51 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "contains_id", scope: !8, file: !7, line: 228, baseType: !49, size: 8, offset: 712)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "contains_count", scope: !8, file: !7, line: 229, baseType: !49, size: 8, offset: 720)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "matcen_creator", scope: !8, file: !7, line: 230, baseType: !49, size: 8, offset: 728)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "lifeleft", scope: !8, file: !7, line: 231, baseType: !32, size: 32, offset: 736)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mtype", scope: !8, file: !7, line: 240, baseType: !57, size: 512, offset: 768)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !8, file: !7, line: 236, size: 512, flags: DIFlagTypePassByValue, elements: !58, identifier: "_ZTSN6objectUt_E")
!58 = !{!59, !76}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "phys_info", scope: !57, file: !7, line: 238, baseType: !60, size: 512)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "physics_info", file: !7, line: 153, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "physics_info", file: !7, line: 142, size: 512, flags: DIFlagTypePassByValue, elements: !62, identifier: "_ZTS12physics_info")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !72}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !61, file: !7, line: 144, baseType: !27, size: 96)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "thrust", scope: !61, file: !7, line: 145, baseType: !27, size: 96, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !61, file: !7, line: 146, baseType: !32, size: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "drag", scope: !61, file: !7, line: 147, baseType: !32, size: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "brakes", scope: !61, file: !7, line: 148, baseType: !32, size: 32, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "rotvel", scope: !61, file: !7, line: 149, baseType: !27, size: 96, offset: 288)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "rotthrust", scope: !61, file: !7, line: 150, baseType: !27, size: 96, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "turnroll", scope: !61, file: !7, line: 151, baseType: !71, size: 16, offset: 480)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixang", file: !33, line: 21, baseType: !18)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !61, file: !7, line: 152, baseType: !73, size: 16, offset: 496)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !74, line: 31, baseType: !75)
!74 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "spin_rate", scope: !57, file: !7, line: 239, baseType: !27, size: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !8, file: !7, line: 250, baseType: !78, size: 256, offset: 1280)
!78 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !8, file: !7, line: 243, size: 256, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTSN6objectUt0_E")
!79 = !{!80, !91, !101, !119, !124}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "laser_info", scope: !78, file: !7, line: 245, baseType: !81, size: 160)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "laser_info_t", file: !7, line: 166, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "laser_info_s", file: !7, line: 157, size: 160, flags: DIFlagTypePassByValue, elements: !83, identifier: "_ZTS12laser_info_s")
!83 = !{!84, !85, !86, !87, !88, !89, !90}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "parent_type", scope: !82, file: !7, line: 159, baseType: !18, size: 16)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "parent_num", scope: !82, file: !7, line: 160, baseType: !18, size: 16, offset: 16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "parent_signature", scope: !82, file: !7, line: 161, baseType: !11, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !82, file: !7, line: 162, baseType: !32, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "last_hitobj", scope: !82, file: !7, line: 163, baseType: !18, size: 16, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "track_goal", scope: !82, file: !7, line: 164, baseType: !18, size: 16, offset: 112)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !82, file: !7, line: 165, baseType: !32, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "expl_info", scope: !78, file: !7, line: 246, baseType: !92, size: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "explosion_info", file: !7, line: 176, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "explosion_info", file: !7, line: 168, size: 128, flags: DIFlagTypePassByValue, elements: !94, identifier: "_ZTS14explosion_info")
!94 = !{!95, !96, !97, !98, !99, !100}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "spawn_time", scope: !93, file: !7, line: 170, baseType: !32, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "delete_time", scope: !93, file: !7, line: 171, baseType: !32, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "delete_objnum", scope: !93, file: !7, line: 172, baseType: !18, size: 16, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "attach_parent", scope: !93, file: !7, line: 173, baseType: !18, size: 16, offset: 80)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev_attach", scope: !93, file: !7, line: 174, baseType: !18, size: 16, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_attach", scope: !93, file: !7, line: 175, baseType: !18, size: 16, offset: 112)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ai_info", scope: !78, file: !7, line: 247, baseType: !102, size: 256)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ai_static", file: !103, line: 144, baseType: !104)
!103 = !DIFile(filename: "main_d2/aistruct.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d122430e792a0ddc0f9eaa08ad217628")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ai_static", file: !103, line: 127, size: 256, flags: DIFlagTypePassByValue, elements: !105, identifier: "_ZTS9ai_static")
!105 = !{!106, !107, !111, !112, !113, !114, !115, !116, !117, !118}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "behavior", scope: !104, file: !103, line: 128, baseType: !13, size: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !104, file: !103, line: 129, baseType: !108, size: 88, offset: 8)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 88, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 11)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "hide_segment", scope: !104, file: !103, line: 130, baseType: !18, size: 16, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "hide_index", scope: !104, file: !103, line: 131, baseType: !18, size: 16, offset: 112)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !104, file: !103, line: 132, baseType: !18, size: 16, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "cur_path_index", scope: !104, file: !103, line: 133, baseType: !49, size: 8, offset: 144)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "dying_sound_playing", scope: !104, file: !103, line: 134, baseType: !49, size: 8, offset: 152)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_num", scope: !104, file: !103, line: 139, baseType: !18, size: 16, offset: 160)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_signature", scope: !104, file: !103, line: 140, baseType: !11, size: 32, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "dying_start_time", scope: !104, file: !103, line: 141, baseType: !32, size: 32, offset: 224)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "light_info", scope: !78, file: !7, line: 248, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "light_info_t", file: !7, line: 181, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "light_info_s", file: !7, line: 178, size: 32, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTS12light_info_s")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !121, file: !7, line: 180, baseType: !32, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "powerup_info", scope: !78, file: !7, line: 249, baseType: !125, size: 96)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "powerup_info_t", file: !7, line: 190, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "powerup_info_s", file: !7, line: 185, size: 96, flags: DIFlagTypePassByValue, elements: !127, identifier: "_ZTS14powerup_info_s")
!127 = !{!128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !126, file: !7, line: 187, baseType: !11, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !126, file: !7, line: 188, baseType: !32, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !7, line: 189, baseType: !11, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !8, file: !7, line: 257, baseType: !132, size: 608, offset: 1536)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !8, file: !7, line: 253, size: 608, flags: DIFlagTypePassByValue, elements: !133, identifier: "_ZTSN6objectUt1_E")
!133 = !{!134, !152}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pobj_info", scope: !132, file: !7, line: 255, baseType: !135, size: 608)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "polyobj_info", file: !7, line: 208, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "polyobj_info", file: !7, line: 201, size: 608, flags: DIFlagTypePassByValue, elements: !137, identifier: "_ZTS12polyobj_info")
!137 = !{!138, !139, !149, !150, !151}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "model_num", scope: !136, file: !7, line: 203, baseType: !11, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "anim_angles", scope: !136, file: !7, line: 204, baseType: !140, size: 480, offset: 32)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 480, elements: !147)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_angvec", file: !28, line: 40, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_angvec", file: !28, line: 37, size: 48, flags: DIFlagTypePassByValue, elements: !143, identifier: "_ZTS10vms_angvec")
!143 = !{!144, !145, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !142, file: !28, line: 39, baseType: !71, size: 16)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !142, file: !28, line: 39, baseType: !71, size: 16, offset: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !142, file: !28, line: 39, baseType: !71, size: 16, offset: 32)
!147 = !{!148}
!148 = !DISubrange(count: 10)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "subobj_flags", scope: !136, file: !7, line: 205, baseType: !11, size: 32, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_override", scope: !136, file: !7, line: 206, baseType: !11, size: 32, offset: 544)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "alt_textures", scope: !136, file: !7, line: 207, baseType: !11, size: 32, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_info", scope: !132, file: !7, line: 256, baseType: !153, size: 96)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "vclip_info_t", file: !7, line: 197, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vclip_info_s", file: !7, line: 192, size: 96, flags: DIFlagTypePassByValue, elements: !155, identifier: "_ZTS12vclip_info_s")
!155 = !{!156, !157, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_num", scope: !154, file: !7, line: 194, baseType: !11, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "frametime", scope: !154, file: !7, line: 195, baseType: !32, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !154, file: !7, line: 196, baseType: !49, size: 8, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !160, line: 30, baseType: !161)
!160 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!161 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!162 = !{!0, !163, !166, !168, !173, !175, !177, !179, !181, !198, !205, !211, !213, !215, !222, !224, !226, !231, !236, !238, !243, !248, !253, !258, !263, !268, !273, !278, !283, !285, !287, !289, !291, !293, !298, !303, !308, !313, !318, !320, !322, !327, !332, !334, !339, !344, !346, !348, !350, !352, !357, !359, !364, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !389, !391, !393, !398, !403, !405, !407, !409, !414, !419, !422, !427, !429, !431, !433, !436, !441, !443, !448, !450, !458, !460, !462, !466, !468, !473, !478, !480, !482, !484, !486, !491, !493, !495, !497, !502, !507, !509, !511, !516, !521, !524}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "ConsoleObject", scope: !2, file: !165, line: 103, type: !5, isLocal: false, isDefinition: true)
!165 = !DIFile(filename: "main_d2/object.cpp", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c026ede8ff5f56a88873a43d82c60782")
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "Object_minus_one", scope: !2, file: !165, line: 113, type: !6, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "Objects", scope: !2, file: !165, line: 116, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 750400, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 350)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "num_objects", scope: !2, file: !165, line: 117, type: !11, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "Highest_object_index", scope: !2, file: !165, line: 118, type: !11, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "Highest_ever_object_index", scope: !2, file: !165, line: 119, type: !11, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "print_object_info", scope: !2, file: !165, line: 130, type: !11, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "Window_rendered_data", scope: !2, file: !165, line: 137, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 3072, elements: !196)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "window_rendered_data", file: !7, line: 276, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 268, size: 1024, flags: DIFlagTypePassByValue, elements: !186, identifier: "_ZTS20window_rendered_data")
!186 = !{!187, !188, !189, !190, !191, !192}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !185, file: !7, line: 270, baseType: !11, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "viewer", scope: !185, file: !7, line: 271, baseType: !5, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "rear_view", scope: !185, file: !7, line: 272, baseType: !11, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !185, file: !7, line: 273, baseType: !11, size: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "num_objects", scope: !185, file: !7, line: 274, baseType: !11, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rendered_objects", scope: !185, file: !7, line: 275, baseType: !193, size: 800, offset: 224)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 800, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 50)
!196 = !{!197}
!197 = !DISubrange(count: 3)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "Object_type_names", scope: !2, file: !165, line: 140, type: !200, isLocal: false, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 1152, elements: !202)
!201 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!202 = !{!203, !204}
!203 = !DISubrange(count: 16)
!204 = !DISubrange(count: 9)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !165, line: 179, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 248, elements: !209)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!209 = !{!210}
!210 = !DISubrange(count: 31)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "global_orientation", scope: !2, file: !165, line: 233, type: !11, isLocal: false, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "Linear_tmap_polygon_objects", scope: !2, file: !165, line: 296, type: !11, isLocal: false, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "cloak_delta", scope: !217, file: !165, line: 356, type: !11, isLocal: true, isDefinition: true)
!217 = distinct !DISubprogram(name: "draw_cloaked_object", linkageName: "_Z19draw_cloaked_objectP6objectiPiii", scope: !165, file: !165, line: 317, type: !218, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !221)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !5, !32, !220, !32, !32}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!221 = !{}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "cloak_dir", scope: !217, file: !165, line: 356, type: !11, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "cloak_timer", scope: !217, file: !165, line: 357, type: !32, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !165, line: 481, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 168, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 21)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !165, line: 481, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 448, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 56)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "Player_fired_laser_this_frame", scope: !2, file: !165, line: 527, type: !11, isLocal: false, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !165, line: 632, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 384, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 48)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !165, line: 682, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 200, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 25)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !165, line: 873, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 224, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 28)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !165, line: 931, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 104, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 13)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !165, line: 968, type: !260, isLocal: true, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 320, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 40)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !165, line: 975, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 296, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 37)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1039, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 240, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 30)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1074, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 144, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 18)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1076, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 376, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 47)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1090, type: !228, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1094, type: !228, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "Object_next_signature", scope: !2, file: !165, line: 1119, type: !11, isLocal: false, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "Debris_object_count", scope: !2, file: !165, line: 1121, type: !11, isLocal: false, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "Unused_object_slots", scope: !2, file: !165, line: 1123, type: !11, isLocal: false, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1174, type: !295, isLocal: true, isDefinition: true)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 280, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 35)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1180, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 352, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 44)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1210, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 136, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 17)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1308, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 464, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 58)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1316, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 232, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 29)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1327, type: !315, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1348, type: !315, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1366, type: !324, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 256, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 32)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1367, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 96, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 12)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1368, type: !228, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1376, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 288, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 36)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1387, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 264, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 33)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1442, type: !255, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1450, type: !207, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1465, type: !270, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1517, type: !329, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1518, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 176, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 22)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1519, type: !228, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1524, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 312, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 39)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1528, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 344, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 43)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1546, type: !207, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "Player_is_dead", scope: !2, file: !165, line: 1566, type: !11, isLocal: false, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "Dead_player_camera", scope: !2, file: !165, line: 1567, type: !5, isLocal: false, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "Player_time_of_death", scope: !2, file: !165, line: 1568, type: !32, isLocal: false, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "Viewer_save", scope: !2, file: !165, line: 1569, type: !5, isLocal: false, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "Player_flags_save", scope: !2, file: !165, line: 1570, type: !11, isLocal: false, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "Player_exploded", scope: !2, file: !165, line: 1571, type: !11, isLocal: false, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "Death_sequence_aborted", scope: !2, file: !165, line: 1572, type: !11, isLocal: false, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "Player_eggs_dropped", scope: !2, file: !165, line: 1573, type: !11, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "Camera_to_player_dist_goal", scope: !2, file: !165, line: 1574, type: !32, isLocal: false, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "Control_type_save", scope: !2, file: !165, line: 1576, type: !13, isLocal: false, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "Render_type_save", scope: !2, file: !165, line: 1576, type: !13, isLocal: false, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1598, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 536, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 67)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1697, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 272, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 34)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1701, type: !400, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "Killed_in_frame", scope: !2, file: !165, line: 1822, type: !11, isLocal: false, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "Killed_objnum", scope: !2, file: !165, line: 1823, type: !18, isLocal: false, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1831, type: !411, isLocal: true, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 192, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 24)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1918, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 584, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 73)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1944, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 400, elements: !194)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1945, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 456, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 57)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1953, type: !324, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !165, line: 1963, type: !400, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "Drop_afterburner_blob_flag", scope: !2, file: !165, line: 1977, type: !11, isLocal: false, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "Last_afterburner_time", scope: !2, file: !165, line: 1986, type: !435, isLocal: false, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 11200, elements: !171)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2032, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 208, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 26)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2045, type: !315, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2077, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 488, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 61)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2132, type: !250, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "lavafall_hiss_playing", scope: !452, file: !165, line: 2145, type: !455, isLocal: true, isDefinition: true)
!452 = distinct !DISubprogram(name: "object_move_one", linkageName: "_Z15object_move_oneP6object", scope: !165, file: !165, line: 1990, type: !453, scopeLine: 1991, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !221)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !5}
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 8)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2191, type: !228, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "Max_used_objects", scope: !2, file: !165, line: 2229, type: !11, isLocal: false, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2370, type: !464, isLocal: true, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 128, elements: !465)
!465 = !{!203}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2418, type: !233, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2441, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 480, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 60)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2447, type: !475, isLocal: true, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 512, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 64)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2454, type: !438, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2455, type: !400, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2457, type: !361, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2458, type: !361, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2460, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 752, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 94)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2472, type: !421, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2473, type: !421, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2479, type: !245, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2480, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 328, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 41)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2489, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 688, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 86)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2494, type: !504, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2498, type: !416, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2519, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 184, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 23)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !165, line: 2619, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 504, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 63)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!522 = distinct !DIGlobalVariable(name: "FRACBITS", scope: !2, file: !33, line: 18, type: !523, isLocal: true, isDefinition: true)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "free_obj_list", linkageName: "_ZL13free_obj_list", scope: !2, file: !165, line: 105, type: !526, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 5600, elements: !171)
!527 = !{!528, !532, !535, !536, !537, !538, !539, !543, !547, !550, !552, !554, !556, !558, !560, !562, !564, !566, !568, !570, !572, !574, !576, !578, !580, !586, !590, !593, !596, !601, !607, !609, !611, !613, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !638, !643, !648, !653, !655, !658, !660, !662, !664, !666, !668, !670, !672, !674, !676, !680, !685, !689, !691, !695, !699, !712, !728, !729, !782, !791, !793, !801, !807, !811, !815, !817, !821, !825, !829, !833, !837, !841, !843, !845, !849, !855, !860, !864, !868, !872, !876, !880, !884, !888, !890, !892, !896, !898, !902, !906, !911, !913, !915, !917, !921, !925, !929, !931, !935, !937, !939, !941, !943, !949, !953, !955, !961, !966, !970, !974, !979, !984, !988, !992, !996, !1000, !1002, !1004, !1012, !1014, !1018, !1022, !1024, !1026, !1030, !1034, !1038, !1040, !1044, !1049, !1053, !1057, !1059, !1061, !1063, !1065, !1067, !1069, !1073, !1077, !1085, !1087, !1089, !1091, !1097, !1099, !1100, !1101, !1102, !1105, !1107, !1112, !1116, !1118, !1120, !1124, !1126, !1128, !1130, !1132, !1134, !1136, !1138, !1143, !1147, !1149, !1151, !1152, !1157, !1159, !1161, !1163, !1165, !1167, !1169, !1171, !1173, !1175, !1177, !1179, !1181, !1183, !1185, !1187, !1189, !1193, !1195, !1197, !1199, !1203, !1205, !1209, !1211, !1213, !1215, !1217, !1221, !1223, !1227, !1231, !1233, !1235, !1239, !1241, !1245, !1247, !1249, !1253, !1255, !1257, !1259, !1261, !1263, !1265, !1269, !1271, !1273, !1275, !1277, !1279, !1281, !1283, !1287, !1291, !1293, !1295, !1297, !1299, !1301, !1303, !1305, !1307, !1309, !1311, !1313, !1315, !1317, !1319, !1321, !1323, !1325, !1327, !1329, !1333, !1335, !1337, !1339, !1343, !1345, !1349, !1351, !1353, !1355, !1357, !1361, !1363, !1367, !1369, !1371, !1373, !1375, !1379, !1381, !1383, !1387, !1389, !1391, !1393, !1398, !1403, !1407, !1408, !1412, !1416, !1421, !1426, !1430, !1436, !1440, !1442, !1446, !1454, !1460, !1466, !1468, !1472, !1476, !1480, !1485, !1489, !1493, !1497, !1501, !1505, !1509, !1513, !1517, !1522, !1526, !1530, !1534, !1539, !1544, !1548, !1550, !1554, !1556, !1563, !1567, !1568, !1572, !1576, !1580, !1584, !1586, !1590, !1594, !1598, !1602, !1606, !1608, !1610, !1612, !1614, !1615, !1619, !1621, !1625, !1629, !1633, !1635, !1639, !1643, !1647, !1653, !1655, !1659, !1663, !1667, !1669, !1673, !1677, !1681, !1683, !1685, !1687, !1691, !1695, !1700, !1704, !1710, !1714, !1718, !1720, !1722, !1724, !1728, !1732, !1736, !1738, !1740, !1744, !1748, !1750, !1754, !1758, !1761, !1763, !1765, !1767, !1796, !1801, !1806}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !49, file: !531, line: 158)
!529 = !DINamespace(name: "__1", scope: !530, exportSymbols: true)
!530 = !DINamespace(name: "std", scope: null)
!531 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdint", directory: "")
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !533, file: !531, line: 159)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !534, line: 30, baseType: !18)
!534 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !34, file: !531, line: 160)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !159, file: !531, line: 161)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !13, file: !531, line: 163)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !73, file: !531, line: 164)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !540, file: !531, line: 165)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !541, line: 31, baseType: !542)
!541 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!542 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !544, file: !531, line: 166)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !545, line: 31, baseType: !546)
!545 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!546 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !548, file: !531, line: 168)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !549, line: 29, baseType: !49)
!549 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !551, file: !531, line: 169)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !549, line: 30, baseType: !533)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !553, file: !531, line: 170)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !549, line: 31, baseType: !34)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !555, file: !531, line: 171)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !549, line: 32, baseType: !159)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !557, file: !531, line: 173)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !549, line: 33, baseType: !13)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !559, file: !531, line: 174)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !549, line: 34, baseType: !73)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !561, file: !531, line: 175)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !549, line: 35, baseType: !540)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !563, file: !531, line: 176)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !549, line: 36, baseType: !544)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !565, file: !531, line: 178)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !549, line: 40, baseType: !49)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !567, file: !531, line: 179)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !549, line: 41, baseType: !533)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !569, file: !531, line: 180)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !549, line: 42, baseType: !34)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !571, file: !531, line: 181)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !549, line: 43, baseType: !159)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !573, file: !531, line: 183)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !549, line: 44, baseType: !13)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !575, file: !531, line: 184)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !549, line: 45, baseType: !73)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !577, file: !531, line: 185)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !549, line: 46, baseType: !540)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !579, file: !531, line: 186)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !549, line: 47, baseType: !544)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !581, file: !531, line: 188)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !582, line: 32, baseType: !583)
!582 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !584, line: 40, baseType: !585)
!584 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!585 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !587, file: !531, line: 189)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !588, line: 34, baseType: !589)
!588 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!589 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !591, file: !531, line: 191)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !592, line: 32, baseType: !585)
!592 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !594, file: !531, line: 192)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !595, line: 32, baseType: !589)
!595 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !597, file: !600, line: 22)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !598, line: 16, baseType: !599)
!598 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/lib/clang/20/include/__stddef_max_align_t.h", directory: "", checksumkind: CSK_MD5, checksum: "3c0a2f19d136d39aa835c737c7105def")
!599 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!600 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__cstddef/max_align_t.h", directory: "")
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !602, file: !606, line: 113)
!602 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !603, file: !603, line: 217, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "b10215117a277691ffc4168ac4505796")
!604 = !DISubroutineType(types: !605)
!605 = !{!11, !11}
!606 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cctype", directory: "")
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !608, file: !606, line: 114)
!608 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !603, file: !603, line: 223, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !610, file: !606, line: 115)
!610 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !603, file: !603, line: 229, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !612, file: !606, line: 116)
!612 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !603, file: !603, line: 235, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !614, file: !606, line: 117)
!614 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !603, file: !603, line: 242, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !616, file: !606, line: 118)
!616 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !603, file: !603, line: 248, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !618, file: !606, line: 119)
!618 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !603, file: !603, line: 254, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !620, file: !606, line: 120)
!620 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !603, file: !603, line: 260, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !622, file: !606, line: 121)
!622 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !603, file: !603, line: 266, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !624, file: !606, line: 122)
!624 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !603, file: !603, line: 272, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !626, file: !606, line: 123)
!626 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !603, file: !603, line: 278, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !628, file: !606, line: 124)
!628 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !603, file: !603, line: 285, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !630, file: !606, line: 125)
!630 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !603, file: !603, line: 297, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !632, file: !606, line: 126)
!632 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !603, file: !603, line: 303, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !634, file: !637, line: 75)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !635, line: 32, baseType: !636)
!635 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "6dfd3a3d5009054224653c03b2c2b6ac")
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !584, line: 111, baseType: !11)
!637 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwctype", directory: "")
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !639, file: !637, line: 76)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !640, line: 32, baseType: !641)
!640 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctrans_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70040c8494301cc74e19df26f4c1d76")
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !642, line: 44, baseType: !11)
!642 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "c789da493a5b476a3618b20a8fcff3c3")
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !644, file: !637, line: 77)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !645, line: 32, baseType: !646)
!645 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctype_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8d1720b82a490c742e6a297f971be2a2")
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !642, line: 46, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !584, line: 36, baseType: !542)
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !649, file: !637, line: 78)
!649 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !650, file: !650, line: 84, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!650 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/___wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "d5a8bf0b4062c20bda4d49376e5b44d9")
!651 = !DISubroutineType(types: !652)
!652 = !{!11, !634}
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !654, file: !637, line: 79)
!654 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !650, file: !650, line: 90, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !656, file: !637, line: 80)
!656 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !657, file: !657, line: 53, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "6bc93063cb32b00d3df790305c546a93")
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !659, file: !637, line: 81)
!659 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !650, file: !650, line: 96, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !661, file: !637, line: 82)
!661 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !650, file: !650, line: 108, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !663, file: !637, line: 83)
!663 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !650, file: !650, line: 114, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !665, file: !637, line: 84)
!665 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !650, file: !650, line: 120, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !667, file: !637, line: 85)
!667 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !650, file: !650, line: 126, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !669, file: !637, line: 86)
!669 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !650, file: !650, line: 132, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !671, file: !637, line: 87)
!671 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !650, file: !650, line: 138, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !673, file: !637, line: 88)
!673 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !650, file: !650, line: 144, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !675, file: !637, line: 89)
!675 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !650, file: !650, line: 150, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !677, file: !637, line: 90)
!677 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !650, file: !650, line: 102, type: !678, flags: DIFlagPrototyped, spFlags: 0)
!678 = !DISubroutineType(types: !679)
!679 = !{!11, !634, !644}
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !681, file: !637, line: 91)
!681 = !DISubprogram(name: "wctype", scope: !650, file: !650, line: 190, type: !682, flags: DIFlagPrototyped, spFlags: 0)
!682 = !DISubroutineType(types: !683)
!683 = !{!644, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !686, file: !637, line: 92)
!686 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !650, file: !650, line: 156, type: !687, flags: DIFlagPrototyped, spFlags: 0)
!687 = !DISubroutineType(types: !688)
!688 = !{!634, !634}
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !690, file: !637, line: 93)
!690 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !650, file: !650, line: 162, type: !687, flags: DIFlagPrototyped, spFlags: 0)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !692, file: !637, line: 94)
!692 = !DISubprogram(name: "towctrans", scope: !657, file: !657, line: 124, type: !693, flags: DIFlagPrototyped, spFlags: 0)
!693 = !DISubroutineType(types: !694)
!694 = !{!634, !634, !639}
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !696, file: !637, line: 95)
!696 = !DISubprogram(name: "wctrans", scope: !657, file: !657, line: 126, type: !697, flags: DIFlagPrototyped, spFlags: 0)
!697 = !DISubroutineType(types: !698)
!698 = !{!639, !684}
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !700, file: !711, line: 133)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !701, line: 32, baseType: !702)
!701 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8f920c8f4b68eb07504db5a6777c5466")
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !584, line: 72, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !584, line: 70, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !584, line: 67, size: 1024, flags: DIFlagTypePassByValue, elements: !705, identifier: "_ZTS11__mbstate_t")
!705 = !{!706, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !704, file: !584, line: 68, baseType: !707, size: 1024)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 1024, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !704, file: !584, line: 69, baseType: !161, size: 64)
!711 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwchar", directory: "")
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !713, file: !711, line: 134)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !714, line: 78, size: 448, flags: DIFlagTypePassByValue, elements: !715, identifier: "_ZTS2tm")
!714 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_time.h", directory: "", checksumkind: CSK_MD5, checksum: "e65eafd533c28a52a9094e430476b03e")
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !713, file: !714, line: 79, baseType: !11, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !713, file: !714, line: 80, baseType: !11, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !713, file: !714, line: 81, baseType: !11, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !713, file: !714, line: 82, baseType: !11, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !713, file: !714, line: 83, baseType: !11, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !713, file: !714, line: 84, baseType: !11, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !713, file: !714, line: 85, baseType: !11, size: 32, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !713, file: !714, line: 86, baseType: !11, size: 32, offset: 224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !713, file: !714, line: 87, baseType: !11, size: 32, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !713, file: !714, line: 88, baseType: !585, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !713, file: !714, line: 89, baseType: !727, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !634, file: !711, line: 135)
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !730, file: !711, line: 136)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !731, line: 162, baseType: !732)
!731 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "d91ebd7d161d9196cc100822ef0e5cdf")
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !731, line: 131, size: 1216, flags: DIFlagTypePassByValue, elements: !733, identifier: "_ZTS7__sFILE")
!733 = !{!734, !736, !737, !738, !739, !740, !745, !746, !748, !752, !756, !764, !768, !769, !772, !773, !775, !779, !780, !781}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !732, file: !731, line: 132, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !732, file: !731, line: 133, baseType: !11, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !732, file: !731, line: 134, baseType: !11, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !732, file: !731, line: 135, baseType: !18, size: 16, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !732, file: !731, line: 136, baseType: !18, size: 16, offset: 144)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !732, file: !731, line: 137, baseType: !741, size: 128, offset: 192)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !731, line: 97, size: 128, flags: DIFlagTypePassByValue, elements: !742, identifier: "_ZTS6__sbuf")
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !741, file: !731, line: 98, baseType: !735, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !741, file: !731, line: 99, baseType: !11, size: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !732, file: !731, line: 138, baseType: !11, size: 32, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !732, file: !731, line: 141, baseType: !747, size: 64, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !732, file: !731, line: 142, baseType: !749, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!11, !747}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !732, file: !731, line: 143, baseType: !753, size: 64, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!11, !747, !727, !11}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !732, file: !731, line: 144, baseType: !757, size: 64, offset: 576)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!760, !747, !760, !11}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !731, line: 86, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !762, line: 83, baseType: !763)
!762 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !584, line: 37, baseType: !161)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !732, file: !731, line: 145, baseType: !765, size: 64, offset: 640)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!11, !747, !684, !11}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !732, file: !731, line: 148, baseType: !741, size: 128, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !732, file: !731, line: 149, baseType: !770, size: 64, offset: 832)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !731, line: 103, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS8__sFILEX")
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !732, file: !731, line: 150, baseType: !11, size: 32, offset: 896)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !732, file: !731, line: 153, baseType: !774, size: 24, offset: 928)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 24, elements: !196)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !732, file: !731, line: 154, baseType: !776, size: 8, offset: 952)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 1)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !732, file: !731, line: 157, baseType: !741, size: 128, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !732, file: !731, line: 160, baseType: !11, size: 32, offset: 1088)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !732, file: !731, line: 161, baseType: !760, size: 64, offset: 1152)
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !783, file: !711, line: 137)
!783 = !DISubprogram(name: "fwprintf", scope: !784, file: !784, line: 107, type: !785, flags: DIFlagPrototyped, spFlags: 0)
!784 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c0db33314388059ce7a1663adf1bfda0")
!785 = !DISubroutineType(types: !786)
!786 = !{!11, !787, !788, null}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !792, file: !711, line: 138)
!792 = !DISubprogram(name: "fwscanf", scope: !784, file: !784, line: 108, type: !785, flags: DIFlagPrototyped, spFlags: 0)
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !794, file: !711, line: 139)
!794 = !DISubprogram(name: "swprintf", scope: !784, file: !784, line: 120, type: !795, flags: DIFlagPrototyped, spFlags: 0)
!795 = !DISubroutineType(types: !796)
!796 = !{!11, !797, !798, !788, null}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !799, line: 50, baseType: !800)
!799 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !584, line: 87, baseType: !589)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !802, file: !711, line: 140)
!802 = !DISubprogram(name: "vfwprintf", scope: !784, file: !784, line: 124, type: !803, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{!11, !787, !788, !805}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !584, line: 95, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !165, baseType: !727)
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !808, file: !711, line: 141)
!808 = !DISubprogram(name: "vswprintf", scope: !784, file: !784, line: 126, type: !809, flags: DIFlagPrototyped, spFlags: 0)
!809 = !DISubroutineType(types: !810)
!810 = !{!11, !797, !798, !788, !805}
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !812, file: !711, line: 142)
!812 = !DISubprogram(name: "swscanf", scope: !784, file: !784, line: 122, type: !813, flags: DIFlagPrototyped, spFlags: 0)
!813 = !DISubroutineType(types: !814)
!814 = !{!11, !788, !788, null}
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !816, file: !711, line: 143)
!816 = !DISubprogram(name: "vfwscanf", scope: !784, file: !784, line: 195, type: !803, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !818, file: !711, line: 144)
!818 = !DISubprogram(name: "vswscanf", scope: !784, file: !784, line: 197, type: !819, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DISubroutineType(types: !820)
!820 = !{!11, !788, !788, !805}
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !822, file: !711, line: 145)
!822 = !DISubprogram(name: "fgetwc", scope: !784, file: !784, line: 100, type: !823, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{!634, !787}
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !826, file: !711, line: 146)
!826 = !DISubprogram(name: "fgetws", scope: !784, file: !784, line: 102, type: !827, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{!797, !797, !11, !787}
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !830, file: !711, line: 147)
!830 = !DISubprogram(name: "fputwc", scope: !784, file: !784, line: 104, type: !831, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{!634, !790, !787}
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !834, file: !711, line: 148)
!834 = !DISubprogram(name: "fputws", scope: !784, file: !784, line: 105, type: !835, flags: DIFlagPrototyped, spFlags: 0)
!835 = !DISubroutineType(types: !836)
!836 = !{!11, !788, !787}
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !838, file: !711, line: 149)
!838 = !DISubprogram(name: "fwide", scope: !784, file: !784, line: 106, type: !839, flags: DIFlagPrototyped, spFlags: 0)
!839 = !DISubroutineType(types: !840)
!840 = !{!11, !787, !11}
!841 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !842, file: !711, line: 150)
!842 = !DISubprogram(name: "getwc", scope: !784, file: !784, line: 109, type: !823, flags: DIFlagPrototyped, spFlags: 0)
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !844, file: !711, line: 151)
!844 = !DISubprogram(name: "putwc", scope: !784, file: !784, line: 118, type: !831, flags: DIFlagPrototyped, spFlags: 0)
!845 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !846, file: !711, line: 152)
!846 = !DISubprogram(name: "ungetwc", scope: !784, file: !784, line: 123, type: !847, flags: DIFlagPrototyped, spFlags: 0)
!847 = !DISubroutineType(types: !848)
!848 = !{!634, !634, !787}
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !850, file: !711, line: 153)
!850 = !DISubprogram(name: "wcstod", scope: !784, file: !784, line: 160, type: !851, flags: DIFlagPrototyped, spFlags: 0)
!851 = !DISubroutineType(types: !852)
!852 = !{!853, !788, !854}
!853 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !856, file: !711, line: 154)
!856 = !DISubprogram(name: "wcstof", scope: !784, file: !784, line: 200, type: !857, flags: DIFlagPrototyped, spFlags: 0)
!857 = !DISubroutineType(types: !858)
!858 = !{!859, !788, !854}
!859 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !861, file: !711, line: 155)
!861 = !DISubprogram(name: "wcstold", scope: !784, file: !784, line: 202, type: !862, flags: DIFlagPrototyped, spFlags: 0)
!862 = !DISubroutineType(types: !863)
!863 = !{!599, !788, !854}
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !865, file: !711, line: 156)
!865 = !DISubprogram(name: "wcstol", scope: !784, file: !784, line: 164, type: !866, flags: DIFlagPrototyped, spFlags: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{!585, !788, !854, !11}
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !869, file: !711, line: 157)
!869 = !DISubprogram(name: "wcstoll", scope: !784, file: !784, line: 205, type: !870, flags: DIFlagPrototyped, spFlags: 0)
!870 = !DISubroutineType(types: !871)
!871 = !{!161, !788, !854, !11}
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !873, file: !711, line: 158)
!873 = !DISubprogram(name: "wcstoul", scope: !784, file: !784, line: 167, type: !874, flags: DIFlagPrototyped, spFlags: 0)
!874 = !DISubroutineType(types: !875)
!875 = !{!589, !788, !854, !11}
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !877, file: !711, line: 159)
!877 = !DISubprogram(name: "wcstoull", scope: !784, file: !784, line: 207, type: !878, flags: DIFlagPrototyped, spFlags: 0)
!878 = !DISubroutineType(types: !879)
!879 = !{!546, !788, !854, !11}
!880 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !881, file: !711, line: 160)
!881 = !DISubprogram(name: "wcscpy", scope: !784, file: !784, line: 134, type: !882, flags: DIFlagPrototyped, spFlags: 0)
!882 = !DISubroutineType(types: !883)
!883 = !{!797, !797, !788}
!884 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !885, file: !711, line: 161)
!885 = !DISubprogram(name: "wcsncpy", scope: !784, file: !784, line: 148, type: !886, flags: DIFlagPrototyped, spFlags: 0)
!886 = !DISubroutineType(types: !887)
!887 = !{!797, !797, !788, !798}
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !889, file: !711, line: 162)
!889 = !DISubprogram(name: "wcscat", scope: !784, file: !784, line: 130, type: !882, flags: DIFlagPrototyped, spFlags: 0)
!890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !891, file: !711, line: 163)
!891 = !DISubprogram(name: "wcsncat", scope: !784, file: !784, line: 142, type: !886, flags: DIFlagPrototyped, spFlags: 0)
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !893, file: !711, line: 164)
!893 = !DISubprogram(name: "wcscmp", scope: !784, file: !784, line: 132, type: !894, flags: DIFlagPrototyped, spFlags: 0)
!894 = !DISubroutineType(types: !895)
!895 = !{!11, !788, !788}
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !897, file: !711, line: 165)
!897 = !DISubprogram(name: "wcscoll", scope: !784, file: !784, line: 133, type: !894, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !899, file: !711, line: 166)
!899 = !DISubprogram(name: "wcsncmp", scope: !784, file: !784, line: 145, type: !900, flags: DIFlagPrototyped, spFlags: 0)
!900 = !DISubroutineType(types: !901)
!901 = !{!11, !788, !788, !798}
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !903, file: !711, line: 167)
!903 = !DISubprogram(name: "wcsxfrm", scope: !784, file: !784, line: 157, type: !904, flags: DIFlagPrototyped, spFlags: 0)
!904 = !DISubroutineType(types: !905)
!905 = !{!798, !797, !788, !798}
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !907, file: !711, line: 168)
!907 = !DISubprogram(name: "wcschr", linkageName: "_Z6wcschrB8ne200100Ua9enable_ifILb1EEPww", scope: !908, file: !908, line: 147, type: !909, flags: DIFlagPrototyped, spFlags: 0)
!908 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/wchar.h", directory: "")
!909 = !DISubroutineType(types: !910)
!910 = !{!797, !797, !790}
!911 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !912, file: !711, line: 169)
!912 = !DISubprogram(name: "wcspbrk", linkageName: "_Z7wcspbrkB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !908, file: !908, line: 158, type: !882, flags: DIFlagPrototyped, spFlags: 0)
!913 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !914, file: !711, line: 170)
!914 = !DISubprogram(name: "wcsrchr", linkageName: "_Z7wcsrchrB8ne200100Ua9enable_ifILb1EEPww", scope: !908, file: !908, line: 168, type: !909, flags: DIFlagPrototyped, spFlags: 0)
!915 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !916, file: !711, line: 171)
!916 = !DISubprogram(name: "wcsstr", linkageName: "_Z6wcsstrB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !908, file: !908, line: 179, type: !882, flags: DIFlagPrototyped, spFlags: 0)
!917 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !918, file: !711, line: 172)
!918 = !DISubprogram(name: "wmemchr", linkageName: "_Z7wmemchrB8ne200100Ua9enable_ifILb1EEPwwm", scope: !908, file: !908, line: 190, type: !919, flags: DIFlagPrototyped, spFlags: 0)
!919 = !DISubroutineType(types: !920)
!920 = !{!797, !797, !790, !798}
!921 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !922, file: !711, line: 173)
!922 = !DISubprogram(name: "wcscspn", scope: !784, file: !784, line: 136, type: !923, flags: DIFlagPrototyped, spFlags: 0)
!923 = !DISubroutineType(types: !924)
!924 = !{!798, !788, !788}
!925 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !926, file: !711, line: 174)
!926 = !DISubprogram(name: "wcslen", scope: !784, file: !784, line: 140, type: !927, flags: DIFlagPrototyped, spFlags: 0)
!927 = !DISubroutineType(types: !928)
!928 = !{!798, !788}
!929 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !930, file: !711, line: 175)
!930 = !DISubprogram(name: "wcsspn", scope: !784, file: !784, line: 155, type: !923, flags: DIFlagPrototyped, spFlags: 0)
!931 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !932, file: !711, line: 176)
!932 = !DISubprogram(name: "wcstok", scope: !784, file: !784, line: 162, type: !933, flags: DIFlagPrototyped, spFlags: 0)
!933 = !DISubroutineType(types: !934)
!934 = !{!797, !797, !788, !854}
!935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !936, file: !711, line: 177)
!936 = !DISubprogram(name: "wmemcmp", scope: !784, file: !784, line: 170, type: !900, flags: DIFlagPrototyped, spFlags: 0)
!937 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !938, file: !711, line: 178)
!938 = !DISubprogram(name: "wmemcpy", scope: !784, file: !784, line: 173, type: !886, flags: DIFlagPrototyped, spFlags: 0)
!939 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !940, file: !711, line: 179)
!940 = !DISubprogram(name: "wmemmove", scope: !784, file: !784, line: 176, type: !886, flags: DIFlagPrototyped, spFlags: 0)
!941 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !942, file: !711, line: 180)
!942 = !DISubprogram(name: "wmemset", scope: !784, file: !784, line: 179, type: !919, flags: DIFlagPrototyped, spFlags: 0)
!943 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !944, file: !711, line: 181)
!944 = !DISubprogram(name: "wcsftime", linkageName: "\01_wcsftime", scope: !784, file: !784, line: 137, type: !945, flags: DIFlagPrototyped, spFlags: 0)
!945 = !DISubroutineType(types: !946)
!946 = !{!798, !797, !798, !788, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!949 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !950, file: !711, line: 182)
!950 = !DISubprogram(name: "btowc", scope: !784, file: !784, line: 99, type: !951, flags: DIFlagPrototyped, spFlags: 0)
!951 = !DISubroutineType(types: !952)
!952 = !{!634, !11}
!953 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !954, file: !711, line: 183)
!954 = !DISubprogram(name: "wctob", scope: !784, file: !784, line: 159, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!955 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !956, file: !711, line: 184)
!956 = !DISubprogram(name: "mbsinit", scope: !784, file: !784, line: 115, type: !957, flags: DIFlagPrototyped, spFlags: 0)
!957 = !DISubroutineType(types: !958)
!958 = !{!11, !959}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!961 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !962, file: !711, line: 185)
!962 = !DISubprogram(name: "mbrlen", scope: !784, file: !784, line: 111, type: !963, flags: DIFlagPrototyped, spFlags: 0)
!963 = !DISubroutineType(types: !964)
!964 = !{!798, !684, !798, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!966 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !967, file: !711, line: 186)
!967 = !DISubprogram(name: "mbrtowc", scope: !784, file: !784, line: 113, type: !968, flags: DIFlagPrototyped, spFlags: 0)
!968 = !DISubroutineType(types: !969)
!969 = !{!798, !797, !684, !798, !965}
!970 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !971, file: !711, line: 187)
!971 = !DISubprogram(name: "wcrtomb", scope: !784, file: !784, line: 129, type: !972, flags: DIFlagPrototyped, spFlags: 0)
!972 = !DISubroutineType(types: !973)
!973 = !{!798, !727, !790, !965}
!974 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !975, file: !711, line: 188)
!975 = !DISubprogram(name: "mbsrtowcs", scope: !784, file: !784, line: 116, type: !976, flags: DIFlagPrototyped, spFlags: 0)
!976 = !DISubroutineType(types: !977)
!977 = !{!798, !797, !978, !798, !965}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!979 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !980, file: !711, line: 189)
!980 = !DISubprogram(name: "wcsrtombs", scope: !784, file: !784, line: 153, type: !981, flags: DIFlagPrototyped, spFlags: 0)
!981 = !DISubroutineType(types: !982)
!982 = !{!798, !727, !983, !798, !965}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!984 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !985, file: !711, line: 191)
!985 = !DISubprogram(name: "getwchar", scope: !784, file: !784, line: 110, type: !986, flags: DIFlagPrototyped, spFlags: 0)
!986 = !DISubroutineType(types: !987)
!987 = !{!634}
!988 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !989, file: !711, line: 192)
!989 = !DISubprogram(name: "vwscanf", scope: !784, file: !784, line: 199, type: !990, flags: DIFlagPrototyped, spFlags: 0)
!990 = !DISubroutineType(types: !991)
!991 = !{!11, !788, !805}
!992 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !993, file: !711, line: 193)
!993 = !DISubprogram(name: "wscanf", scope: !784, file: !784, line: 181, type: !994, flags: DIFlagPrototyped, spFlags: 0)
!994 = !DISubroutineType(types: !995)
!995 = !{!11, !788, null}
!996 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !997, file: !711, line: 195)
!997 = !DISubprogram(name: "putwchar", scope: !784, file: !784, line: 119, type: !998, flags: DIFlagPrototyped, spFlags: 0)
!998 = !DISubroutineType(types: !999)
!999 = !{!634, !790}
!1000 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !529, entity: !1001, file: !711, line: 196)
