; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/laser.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/laser.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.weapon_info = type { i8, i8, i16, i16, i8, i8, i16, i8, i8, i16, i8, i8, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, %struct.bitmap_index, i32, i32, i32, [5 x i32], [5 x i32], i32, i32, i32, i32, i32, i32, i32, %struct.bitmap_index, %struct.bitmap_index }
%struct.bitmap_index = type { i16 }
%struct.object = type { i32, i8, i8, i16, i16, i8, i8, i8, i8, i16, i16, %struct.vms_vector, %struct.vms_matrix, i32, i32, %struct.vms_vector, i8, i8, i8, i8, i32, %union.anon, %union.anon.0, %union.anon.1 }
%struct.vms_matrix = type { %struct.vms_vector, %struct.vms_vector, %struct.vms_vector }
%struct.vms_vector = type { i32, i32, i32 }
%union.anon = type { %struct.physics_info }
%struct.physics_info = type { %struct.vms_vector, %struct.vms_vector, i32, i32, i32, %struct.vms_vector, %struct.vms_vector, i16, i16 }
%union.anon.0 = type { %struct.ai_static }
%struct.ai_static = type { i8, [11 x i8], i16, i16, i16, i8, i8, i16, i32, i32 }
%union.anon.1 = type { %struct.polyobj_info }
%struct.polyobj_info = type { i32, [10 x %struct.vms_angvec], i32, i32, i32 }
%struct.vms_angvec = type { i16, i16, i16 }
%struct.muzzle_info = type { i32, i16, %struct.vms_vector }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Laser_rapid_fire", scope: !2, file: !31, line: 60, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !28, imports: !372, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "/Users/richard/code/ChocolateDescent/main_d2/laser.cpp", directory: "/Users/richard/code/ChocolateDescent/build-c-ref", checksumkind: CSK_MD5, checksum: "79ca20e1e3201a472f56b0dfcac8aaa8")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LogicVer", file: !6, line: 56, baseType: !7, size: 32, flags: DIFlagEnumClass, elements: !8, identifier: "_ZTS8LogicVer")
!6 = !DIFile(filename: "main_d2/inferno.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "f9bd7760bcc54609c0547a3a7ca7ee90")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "SHAREWARE", value: 0)
!10 = !DIEnumerator(name: "FULL_1_0", value: 1)
!11 = !DIEnumerator(name: "FULL_1_1", value: 2)
!12 = !DIEnumerator(name: "FULL_1_2", value: 3)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DataVer", file: !6, line: 72, baseType: !7, size: 32, flags: DIFlagEnumClass, elements: !14, identifier: "_ZTS7DataVer")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "DEMO", value: 0)
!16 = !DIEnumerator(name: "FULL", value: 1)
!17 = !{!18, !21, !25}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !19, line: 30, baseType: !20)
!19 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!20 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "fix", file: !22, line: 20, baseType: !23)
!22 = !DIFile(filename: "./fix/fix.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c5006a11bf8b4cb7d963898499eda13a")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !24, line: 30, baseType: !7)
!24 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !26, line: 30, baseType: !27)
!26 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!27 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!28 = !{!0, !29, !181, !184, !187, !193, !195, !200, !205, !210, !215, !220, !222, !224, !229, !234, !239, !244, !249, !254, !256, !266, !268, !273, !278, !283, !286, !291, !296, !301, !306, !311, !313, !315, !321, !323, !325, !327, !329, !331, !336, !338, !343, !348, !353, !358, !360, !362, !364, !369}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "Guided_missile", scope: !2, file: !31, line: 62, type: !32, isLocal: false, isDefinition: true)
!31 = !DIFile(filename: "main_d2/laser.cpp", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "79ca20e1e3201a472f56b0dfcac8aaa8")
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !179)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !35, line: 259, baseType: !36)
!35 = !DIFile(filename: "main_d2/object.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "1f2325d356aae4b692933d2aae4f3afd")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !35, line: 210, size: 2144, flags: DIFlagTypePassByValue, elements: !37, identifier: "_ZTS6object")
!37 = !{!38, !39, !43, !44, !46, !47, !48, !49, !50, !51, !52, !53, !61, !68, !69, !70, !71, !72, !73, !74, !75, !76, !97, !151}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !36, file: !35, line: 212, baseType: !7, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !35, line: 213, baseType: !40, size: 8, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !41, line: 31, baseType: !42)
!41 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !36, file: !35, line: 214, baseType: !40, size: 8, offset: 40)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !35, line: 215, baseType: !45, size: 16, offset: 48)
!45 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !36, file: !35, line: 215, baseType: !45, size: 16, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !36, file: !35, line: 216, baseType: !40, size: 8, offset: 80)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "movement_type", scope: !36, file: !35, line: 217, baseType: !40, size: 8, offset: 88)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "render_type", scope: !36, file: !35, line: 218, baseType: !40, size: 8, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !35, line: 219, baseType: !40, size: 8, offset: 104)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !36, file: !35, line: 220, baseType: !45, size: 16, offset: 112)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "attached_obj", scope: !36, file: !35, line: 221, baseType: !45, size: 16, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !36, file: !35, line: 222, baseType: !54, size: 96, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_vector", file: !55, line: 22, baseType: !56)
!55 = !DIFile(filename: "./vecmat/vecmat.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "dfa84e3325c1ea4f5f74699fff5ef2bf")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_vector", file: !55, line: 19, size: 96, flags: DIFlagTypePassByValue, elements: !57, identifier: "_ZTS10vms_vector")
!57 = !{!58, !59, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !56, file: !55, line: 21, baseType: !21, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !56, file: !55, line: 21, baseType: !21, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !56, file: !55, line: 21, baseType: !21, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "orient", scope: !36, file: !35, line: 223, baseType: !62, size: 288, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_matrix", file: !55, line: 47, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_matrix", file: !55, line: 44, size: 288, flags: DIFlagTypePassByValue, elements: !64, identifier: "_ZTS10vms_matrix")
!64 = !{!65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "rvec", scope: !63, file: !55, line: 46, baseType: !54, size: 96)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "uvec", scope: !63, file: !55, line: 46, baseType: !54, size: 96, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "fvec", scope: !63, file: !55, line: 46, baseType: !54, size: 96, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !35, line: 224, baseType: !21, size: 32, offset: 544)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "shields", scope: !36, file: !35, line: 225, baseType: !21, size: 32, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !36, file: !35, line: 226, baseType: !54, size: 96, offset: 608)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "contains_type", scope: !36, file: !35, line: 227, baseType: !18, size: 8, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "contains_id", scope: !36, file: !35, line: 228, baseType: !18, size: 8, offset: 712)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "contains_count", scope: !36, file: !35, line: 229, baseType: !18, size: 8, offset: 720)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "matcen_creator", scope: !36, file: !35, line: 230, baseType: !18, size: 8, offset: 728)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "lifeleft", scope: !36, file: !35, line: 231, baseType: !21, size: 32, offset: 736)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mtype", scope: !36, file: !35, line: 240, baseType: !77, size: 512, offset: 768)
!77 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !36, file: !35, line: 236, size: 512, flags: DIFlagTypePassByValue, elements: !78, identifier: "_ZTSN6objectUt_E")
!78 = !{!79, !96}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "phys_info", scope: !77, file: !35, line: 238, baseType: !80, size: 512)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "physics_info", file: !35, line: 153, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "physics_info", file: !35, line: 142, size: 512, flags: DIFlagTypePassByValue, elements: !82, identifier: "_ZTS12physics_info")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !92}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !81, file: !35, line: 144, baseType: !54, size: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "thrust", scope: !81, file: !35, line: 145, baseType: !54, size: 96, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !81, file: !35, line: 146, baseType: !21, size: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "drag", scope: !81, file: !35, line: 147, baseType: !21, size: 32, offset: 224)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "brakes", scope: !81, file: !35, line: 148, baseType: !21, size: 32, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "rotvel", scope: !81, file: !35, line: 149, baseType: !54, size: 96, offset: 288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rotthrust", scope: !81, file: !35, line: 150, baseType: !54, size: 96, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "turnroll", scope: !81, file: !35, line: 151, baseType: !91, size: 16, offset: 480)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixang", file: !22, line: 21, baseType: !45)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !81, file: !35, line: 152, baseType: !93, size: 16, offset: 496)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !94, line: 31, baseType: !95)
!94 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!95 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "spin_rate", scope: !77, file: !35, line: 239, baseType: !54, size: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !36, file: !35, line: 250, baseType: !98, size: 256, offset: 1280)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !36, file: !35, line: 243, size: 256, flags: DIFlagTypePassByValue, elements: !99, identifier: "_ZTSN6objectUt0_E")
!99 = !{!100, !111, !121, !139, !144}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "laser_info", scope: !98, file: !35, line: 245, baseType: !101, size: 160)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "laser_info_t", file: !35, line: 166, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "laser_info_s", file: !35, line: 157, size: 160, flags: DIFlagTypePassByValue, elements: !103, identifier: "_ZTS12laser_info_s")
!103 = !{!104, !105, !106, !107, !108, !109, !110}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "parent_type", scope: !102, file: !35, line: 159, baseType: !45, size: 16)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "parent_num", scope: !102, file: !35, line: 160, baseType: !45, size: 16, offset: 16)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "parent_signature", scope: !102, file: !35, line: 161, baseType: !7, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !102, file: !35, line: 162, baseType: !21, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "last_hitobj", scope: !102, file: !35, line: 163, baseType: !45, size: 16, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "track_goal", scope: !102, file: !35, line: 164, baseType: !45, size: 16, offset: 112)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !102, file: !35, line: 165, baseType: !21, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "expl_info", scope: !98, file: !35, line: 246, baseType: !112, size: 128)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "explosion_info", file: !35, line: 176, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "explosion_info", file: !35, line: 168, size: 128, flags: DIFlagTypePassByValue, elements: !114, identifier: "_ZTS14explosion_info")
!114 = !{!115, !116, !117, !118, !119, !120}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "spawn_time", scope: !113, file: !35, line: 170, baseType: !21, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "delete_time", scope: !113, file: !35, line: 171, baseType: !21, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "delete_objnum", scope: !113, file: !35, line: 172, baseType: !45, size: 16, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "attach_parent", scope: !113, file: !35, line: 173, baseType: !45, size: 16, offset: 80)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "prev_attach", scope: !113, file: !35, line: 174, baseType: !45, size: 16, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next_attach", scope: !113, file: !35, line: 175, baseType: !45, size: 16, offset: 112)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ai_info", scope: !98, file: !35, line: 247, baseType: !122, size: 256)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ai_static", file: !123, line: 144, baseType: !124)
!123 = !DIFile(filename: "main_d2/aistruct.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d122430e792a0ddc0f9eaa08ad217628")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ai_static", file: !123, line: 127, size: 256, flags: DIFlagTypePassByValue, elements: !125, identifier: "_ZTS9ai_static")
!125 = !{!126, !127, !131, !132, !133, !134, !135, !136, !137, !138}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "behavior", scope: !124, file: !123, line: 128, baseType: !40, size: 8)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !124, file: !123, line: 129, baseType: !128, size: 88, offset: 8)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 88, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 11)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "hide_segment", scope: !124, file: !123, line: 130, baseType: !45, size: 16, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "hide_index", scope: !124, file: !123, line: 131, baseType: !45, size: 16, offset: 112)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !124, file: !123, line: 132, baseType: !45, size: 16, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cur_path_index", scope: !124, file: !123, line: 133, baseType: !18, size: 8, offset: 144)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dying_sound_playing", scope: !124, file: !123, line: 134, baseType: !18, size: 8, offset: 152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_num", scope: !124, file: !123, line: 139, baseType: !45, size: 16, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_signature", scope: !124, file: !123, line: 140, baseType: !7, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dying_start_time", scope: !124, file: !123, line: 141, baseType: !21, size: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "light_info", scope: !98, file: !35, line: 248, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "light_info_t", file: !35, line: 181, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "light_info_s", file: !35, line: 178, size: 32, flags: DIFlagTypePassByValue, elements: !142, identifier: "_ZTS12light_info_s")
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !141, file: !35, line: 180, baseType: !21, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "powerup_info", scope: !98, file: !35, line: 249, baseType: !145, size: 96)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "powerup_info_t", file: !35, line: 190, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "powerup_info_s", file: !35, line: 185, size: 96, flags: DIFlagTypePassByValue, elements: !147, identifier: "_ZTS14powerup_info_s")
!147 = !{!148, !149, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !146, file: !35, line: 187, baseType: !7, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !146, file: !35, line: 188, baseType: !21, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !35, line: 189, baseType: !7, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !36, file: !35, line: 257, baseType: !152, size: 608, offset: 1536)
!152 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !36, file: !35, line: 253, size: 608, flags: DIFlagTypePassByValue, elements: !153, identifier: "_ZTSN6objectUt1_E")
!153 = !{!154, !172}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pobj_info", scope: !152, file: !35, line: 255, baseType: !155, size: 608)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "polyobj_info", file: !35, line: 208, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "polyobj_info", file: !35, line: 201, size: 608, flags: DIFlagTypePassByValue, elements: !157, identifier: "_ZTS12polyobj_info")
!157 = !{!158, !159, !169, !170, !171}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "model_num", scope: !156, file: !35, line: 203, baseType: !7, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "anim_angles", scope: !156, file: !35, line: 204, baseType: !160, size: 480, offset: 32)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 480, elements: !167)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_angvec", file: !55, line: 40, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_angvec", file: !55, line: 37, size: 48, flags: DIFlagTypePassByValue, elements: !163, identifier: "_ZTS10vms_angvec")
!163 = !{!164, !165, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !162, file: !55, line: 39, baseType: !91, size: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !162, file: !55, line: 39, baseType: !91, size: 16, offset: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !162, file: !55, line: 39, baseType: !91, size: 16, offset: 32)
!167 = !{!168}
!168 = !DISubrange(count: 10)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "subobj_flags", scope: !156, file: !35, line: 205, baseType: !7, size: 32, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_override", scope: !156, file: !35, line: 206, baseType: !7, size: 32, offset: 544)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "alt_textures", scope: !156, file: !35, line: 207, baseType: !7, size: 32, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_info", scope: !152, file: !35, line: 256, baseType: !173, size: 96)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "vclip_info_t", file: !35, line: 197, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vclip_info_s", file: !35, line: 192, size: 96, flags: DIFlagTypePassByValue, elements: !175, identifier: "_ZTS12vclip_info_s")
!175 = !{!176, !177, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_num", scope: !174, file: !35, line: 194, baseType: !7, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "frametime", scope: !174, file: !35, line: 195, baseType: !21, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !174, file: !35, line: 196, baseType: !18, size: 8, offset: 64)
!179 = !{!180}
!180 = !DISubrange(count: 8)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "Guided_missile_sig", scope: !2, file: !31, line: 63, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !179)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "Multi_is_guided", scope: !2, file: !31, line: 70, type: !186, isLocal: false, isDefinition: true)
!186 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !31, line: 97, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 352, elements: !191)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!191 = !{!192}
!192 = !DISubrange(count: 44)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "Laser_offset", scope: !2, file: !31, line: 174, type: !7, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !31, line: 260, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 384, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 48)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !31, line: 263, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 152, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 19)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !31, line: 263, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 440, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 55)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !31, line: 264, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 96, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 12)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !31, line: 335, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 288, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 36)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "Omega_charge", scope: !2, file: !31, line: 472, type: !21, isLocal: false, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "Last_omega_fire_frame", scope: !2, file: !31, line: 476, type: !7, isLocal: false, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !31, line: 590, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 528, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 66)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !31, line: 603, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 184, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 23)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !31, line: 624, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 232, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 29)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !31, line: 637, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 304, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 38)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !31, line: 786, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 576, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 72)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !31, line: 862, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 552, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 69)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "Muzzle_queue_index", scope: !2, file: !31, line: 869, type: !7, isLocal: false, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "Muzzle_data", scope: !2, file: !31, line: 871, type: !258, isLocal: false, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 1280, elements: !179)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "muzzle_info", file: !260, line: 131, baseType: !261)
!260 = !DIFile(filename: "main_d2/laser.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "0c055cf033461cb61338b5d113c9306f")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "muzzle_info", file: !260, line: 126, size: 160, flags: DIFlagTypePassByValue, elements: !262, identifier: "_ZTS11muzzle_info")
!262 = !{!263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "create_time", scope: !261, file: !260, line: 128, baseType: !21, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !261, file: !260, line: 129, baseType: !45, size: 16, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !261, file: !260, line: 130, baseType: !54, size: 96, offset: 64)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "Min_trackable_dot", scope: !2, file: !31, line: 903, type: !21, isLocal: false, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !31, line: 987, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 408, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 51)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !31, line: 1127, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 544, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 68)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !31, line: 1164, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 640, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 80)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !31, line: 1551, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 88, elements: !129)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !31, line: 1613, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 336, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 42)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !31, line: 1615, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 272, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 34)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !31, line: 1623, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 280, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 35)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !31, line: 1649, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 240, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 30)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !31, line: 1782, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 248, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 31)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "Last_laser_fired_time", scope: !2, file: !31, line: 1993, type: !21, isLocal: false, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "Zbonkers", scope: !2, file: !31, line: 1997, type: !7, isLocal: false, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "Spreadfire_toggle", scope: !317, file: !31, line: 2011, type: !7, isLocal: true, isDefinition: true)
!317 = distinct !DISubprogram(name: "do_laser_firing_player", linkageName: "_Z22do_laser_firing_playerv", scope: !31, file: !31, line: 2002, type: !318, scopeLine: 2003, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{!7}
!320 = !{}
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "Helix_orientation", scope: !317, file: !31, line: 2012, type: !7, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "Lightning_gun_num", scope: !2, file: !31, line: 2124, type: !7, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "Lightning_start_time", scope: !2, file: !31, line: 2126, type: !21, isLocal: false, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "Lightning_last_time", scope: !2, file: !31, line: 2126, type: !21, isLocal: false, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !31, line: 2171, type: !189, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !31, line: 2205, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 376, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 47)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !31, line: 2389, type: !217, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !31, line: 2551, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 296, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 37)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !31, line: 2611, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 560, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 70)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !31, line: 2626, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 112, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 14)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !31, line: 2630, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 192, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 24)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "Missile_gun", scope: !2, file: !31, line: 2694, type: !7, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "Proximity_dropped", scope: !2, file: !31, line: 2716, type: !7, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "Smartmines_dropped", scope: !2, file: !31, line: 2716, type: !7, isLocal: false, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !31, line: 2726, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 328, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 41)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!370 = distinct !DIGlobalVariable(name: "FRACBITS", scope: !2, file: !22, line: 18, type: !371, isLocal: true, isDefinition: true)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!372 = !{!373, !377, !380, !381, !382, !383, !384, !388, !392, !395, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !423, !425, !431, !435, !438}
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !18, file: !376, line: 158)
!374 = !DINamespace(name: "__1", scope: !375, exportSymbols: true)
!375 = !DINamespace(name: "std", scope: null)
!376 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdint", directory: "")
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !378, file: !376, line: 159)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !379, line: 30, baseType: !45)
!379 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !23, file: !376, line: 160)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !25, file: !376, line: 161)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !40, file: !376, line: 163)
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !93, file: !376, line: 164)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !385, file: !376, line: 165)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !386, line: 31, baseType: !387)
!386 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!387 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !389, file: !376, line: 166)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !390, line: 31, baseType: !391)
!390 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!391 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !393, file: !376, line: 168)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !394, line: 29, baseType: !18)
!394 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !396, file: !376, line: 169)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !394, line: 30, baseType: !378)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !398, file: !376, line: 170)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !394, line: 31, baseType: !23)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !400, file: !376, line: 171)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !394, line: 32, baseType: !25)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !402, file: !376, line: 173)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !394, line: 33, baseType: !40)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !404, file: !376, line: 174)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !394, line: 34, baseType: !93)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !406, file: !376, line: 175)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !394, line: 35, baseType: !385)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !408, file: !376, line: 176)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !394, line: 36, baseType: !389)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !410, file: !376, line: 178)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !394, line: 40, baseType: !18)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !412, file: !376, line: 179)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !394, line: 41, baseType: !378)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !414, file: !376, line: 180)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !394, line: 42, baseType: !23)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !416, file: !376, line: 181)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !394, line: 43, baseType: !25)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !418, file: !376, line: 183)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !394, line: 44, baseType: !40)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !420, file: !376, line: 184)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !394, line: 45, baseType: !93)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !422, file: !376, line: 185)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !394, line: 46, baseType: !385)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !424, file: !376, line: 186)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !394, line: 47, baseType: !389)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !426, file: !376, line: 188)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !427, line: 32, baseType: !428)
!427 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !429, line: 40, baseType: !430)
!429 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!430 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !432, file: !376, line: 189)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !433, line: 34, baseType: !434)
!433 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!434 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !436, file: !376, line: 191)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !437, line: 32, baseType: !430)
!437 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !374, entity: !439, file: !376, line: 192)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !440, line: 32, baseType: !434)
!440 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!441 = !{i32 2, !"SDK Version", [2 x i32] [i32 15, i32 4]}
!442 = !{i32 7, !"Dwarf Version", i32 5}
!443 = !{i32 2, !"Debug Info Version", i32 3}
!444 = !{i32 1, !"wchar_size", i32 4}
!445 = !{i32 8, !"PIC Level", i32 2}
!446 = !{i32 7, !"uwtable", i32 1}
!447 = !{i32 7, !"frame-pointer", i32 1}
!448 = !{!"Homebrew clang version 20.1.8"}
!449 = distinct !DISubprogram(name: "Laser_render", linkageName: "_Z12Laser_renderP6object", scope: !31, file: !31, line: 81, type: !450, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !33}
!452 = !DILocalVariable(name: "obj", arg: 1, scope: !449, file: !31, line: 81, type: !33)
!453 = !DILocation(line: 81, column: 27, scope: !449)
!454 = !DILocation(line: 83, column: 22, scope: !449)
!455 = !DILocation(line: 83, column: 27, scope: !449)
!456 = !DILocation(line: 83, column: 10, scope: !449)
!457 = !DILocation(line: 83, column: 31, scope: !449)
!458 = !DILocation(line: 83, column: 2, scope: !449)
!459 = !DILocation(line: 86, column: 3, scope: !460)
!460 = distinct !DILexicalBlock(scope: !449, file: !31, line: 84, column: 2)
!461 = !DILocation(line: 88, column: 3, scope: !460)
!462 = !DILocation(line: 90, column: 20, scope: !460)
!463 = !DILocation(line: 90, column: 37, scope: !460)
!464 = !DILocation(line: 90, column: 42, scope: !460)
!465 = !DILocation(line: 90, column: 25, scope: !460)
!466 = !DILocation(line: 90, column: 46, scope: !460)
!467 = !DILocation(line: 90, column: 3, scope: !460)
!468 = !DILocation(line: 91, column: 3, scope: !460)
!469 = !DILocation(line: 93, column: 3, scope: !460)
!470 = !DILocation(line: 95, column: 3, scope: !460)
!471 = !DILocation(line: 97, column: 3, scope: !460)
!472 = !DILocation(line: 98, column: 2, scope: !460)
!473 = !DILocation(line: 100, column: 1, scope: !449)
!474 = distinct !DISubprogram(name: "laser_are_related", linkageName: "_Z17laser_are_relatedii", scope: !31, file: !31, line: 106, type: !475, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!475 = !DISubroutineType(types: !476)
!476 = !{!7, !7, !7}
!477 = !DILocalVariable(name: "o1", arg: 1, scope: !474, file: !31, line: 106, type: !7)
!478 = !DILocation(line: 106, column: 28, scope: !474)
!479 = !DILocalVariable(name: "o2", arg: 2, scope: !474, file: !31, line: 106, type: !7)
!480 = !DILocation(line: 106, column: 36, scope: !474)
!481 = !DILocation(line: 124, column: 8, scope: !482)
!482 = distinct !DILexicalBlock(scope: !474, file: !31, line: 124, column: 7)
!483 = !DILocation(line: 124, column: 10, scope: !482)
!484 = !DILocation(line: 124, column: 14, scope: !482)
!485 = !DILocation(line: 124, column: 18, scope: !482)
!486 = !DILocation(line: 124, column: 20, scope: !482)
!487 = !DILocation(line: 125, column: 3, scope: !482)
!488 = !DILocation(line: 128, column: 15, scope: !489)
!489 = distinct !DILexicalBlock(scope: !474, file: !31, line: 128, column: 7)
!490 = !DILocation(line: 128, column: 7, scope: !489)
!491 = !DILocation(line: 128, column: 19, scope: !489)
!492 = !DILocation(line: 128, column: 24, scope: !489)
!493 = !DILocation(line: 129, column: 17, scope: !494)
!494 = distinct !DILexicalBlock(scope: !489, file: !31, line: 129, column: 8)
!495 = !DILocation(line: 129, column: 9, scope: !494)
!496 = !DILocation(line: 129, column: 21, scope: !494)
!497 = !DILocation(line: 129, column: 38, scope: !494)
!498 = !DILocation(line: 129, column: 50, scope: !494)
!499 = !DILocation(line: 129, column: 48, scope: !494)
!500 = !DILocation(line: 129, column: 54, scope: !494)
!501 = !DILocation(line: 129, column: 66, scope: !494)
!502 = !DILocation(line: 129, column: 58, scope: !494)
!503 = !DILocation(line: 129, column: 70, scope: !494)
!504 = !DILocation(line: 129, column: 87, scope: !494)
!505 = !DILocation(line: 129, column: 113, scope: !494)
!506 = !DILocation(line: 129, column: 105, scope: !494)
!507 = !DILocation(line: 129, column: 117, scope: !494)
!508 = !DILocation(line: 129, column: 103, scope: !494)
!509 = !DILocation(line: 130, column: 17, scope: !510)
!510 = distinct !DILexicalBlock(scope: !494, file: !31, line: 130, column: 8)
!511 = !DILocation(line: 130, column: 9, scope: !510)
!512 = !DILocation(line: 130, column: 21, scope: !510)
!513 = !DILocation(line: 130, column: 24, scope: !510)
!514 = !DILocation(line: 130, column: 38, scope: !510)
!515 = !DILocation(line: 130, column: 42, scope: !510)
!516 = !DILocation(line: 130, column: 61, scope: !510)
!517 = !DILocation(line: 130, column: 53, scope: !510)
!518 = !DILocation(line: 130, column: 65, scope: !510)
!519 = !DILocation(line: 130, column: 82, scope: !510)
!520 = !DILocation(line: 130, column: 96, scope: !510)
!521 = !DILocation(line: 130, column: 51, scope: !510)
!522 = !DILocation(line: 130, column: 107, scope: !510)
!523 = !DILocation(line: 131, column: 16, scope: !510)
!524 = !DILocation(line: 131, column: 8, scope: !510)
!525 = !DILocation(line: 131, column: 20, scope: !510)
!526 = !DILocation(line: 131, column: 23, scope: !510)
!527 = !DILocation(line: 131, column: 40, scope: !510)
!528 = !DILocation(line: 131, column: 44, scope: !510)
!529 = !DILocation(line: 131, column: 63, scope: !510)
!530 = !DILocation(line: 131, column: 55, scope: !510)
!531 = !DILocation(line: 131, column: 67, scope: !510)
!532 = !DILocation(line: 131, column: 84, scope: !510)
!533 = !DILocation(line: 131, column: 98, scope: !510)
!534 = !DILocation(line: 131, column: 53, scope: !510)
!535 = !DILocation(line: 131, column: 109, scope: !510)
!536 = !DILocation(line: 132, column: 16, scope: !510)
!537 = !DILocation(line: 132, column: 8, scope: !510)
!538 = !DILocation(line: 132, column: 20, scope: !510)
!539 = !DILocation(line: 132, column: 23, scope: !510)
!540 = !DILocation(line: 132, column: 40, scope: !510)
!541 = !DILocation(line: 132, column: 52, scope: !510)
!542 = !DILocation(line: 132, column: 44, scope: !510)
!543 = !DILocation(line: 132, column: 56, scope: !510)
!544 = !DILocation(line: 132, column: 59, scope: !510)
!545 = !DILocation(line: 132, column: 77, scope: !510)
!546 = !DILocation(line: 132, column: 81, scope: !510)
!547 = !DILocation(line: 132, column: 100, scope: !510)
!548 = !DILocation(line: 132, column: 92, scope: !510)
!549 = !DILocation(line: 132, column: 104, scope: !510)
!550 = !DILocation(line: 132, column: 121, scope: !510)
!551 = !DILocation(line: 132, column: 135, scope: !510)
!552 = !DILocation(line: 132, column: 90, scope: !510)
!553 = !DILocation(line: 134, column: 5, scope: !554)
!554 = distinct !DILexicalBlock(scope: !510, file: !31, line: 133, column: 4)
!555 = !DILocation(line: 136, column: 5, scope: !510)
!556 = !DILocation(line: 129, column: 126, scope: !494)
!557 = !DILocation(line: 139, column: 15, scope: !558)
!558 = distinct !DILexicalBlock(scope: !474, file: !31, line: 139, column: 7)
!559 = !DILocation(line: 139, column: 7, scope: !558)
!560 = !DILocation(line: 139, column: 19, scope: !558)
!561 = !DILocation(line: 139, column: 24, scope: !558)
!562 = !DILocation(line: 140, column: 17, scope: !563)
!563 = distinct !DILexicalBlock(scope: !558, file: !31, line: 140, column: 8)
!564 = !DILocation(line: 140, column: 9, scope: !563)
!565 = !DILocation(line: 140, column: 21, scope: !563)
!566 = !DILocation(line: 140, column: 38, scope: !563)
!567 = !DILocation(line: 140, column: 50, scope: !563)
!568 = !DILocation(line: 140, column: 48, scope: !563)
!569 = !DILocation(line: 140, column: 54, scope: !563)
!570 = !DILocation(line: 140, column: 66, scope: !563)
!571 = !DILocation(line: 140, column: 58, scope: !563)
!572 = !DILocation(line: 140, column: 70, scope: !563)
!573 = !DILocation(line: 140, column: 87, scope: !563)
!574 = !DILocation(line: 140, column: 113, scope: !563)
!575 = !DILocation(line: 140, column: 105, scope: !563)
!576 = !DILocation(line: 140, column: 117, scope: !563)
!577 = !DILocation(line: 140, column: 103, scope: !563)
!578 = !DILocation(line: 141, column: 17, scope: !579)
!579 = distinct !DILexicalBlock(scope: !563, file: !31, line: 141, column: 8)
!580 = !DILocation(line: 141, column: 9, scope: !579)
!581 = !DILocation(line: 141, column: 21, scope: !579)
!582 = !DILocation(line: 141, column: 24, scope: !579)
!583 = !DILocation(line: 141, column: 38, scope: !579)
!584 = !DILocation(line: 141, column: 42, scope: !579)
!585 = !DILocation(line: 141, column: 61, scope: !579)
!586 = !DILocation(line: 141, column: 53, scope: !579)
!587 = !DILocation(line: 141, column: 65, scope: !579)
!588 = !DILocation(line: 141, column: 82, scope: !579)
!589 = !DILocation(line: 141, column: 96, scope: !579)
!590 = !DILocation(line: 141, column: 51, scope: !579)
!591 = !DILocation(line: 141, column: 107, scope: !579)
!592 = !DILocation(line: 142, column: 16, scope: !579)
!593 = !DILocation(line: 142, column: 8, scope: !579)
!594 = !DILocation(line: 142, column: 20, scope: !579)
!595 = !DILocation(line: 142, column: 23, scope: !579)
!596 = !DILocation(line: 142, column: 40, scope: !579)
!597 = !DILocation(line: 142, column: 44, scope: !579)
!598 = !DILocation(line: 142, column: 63, scope: !579)
!599 = !DILocation(line: 142, column: 55, scope: !579)
!600 = !DILocation(line: 142, column: 67, scope: !579)
!601 = !DILocation(line: 142, column: 84, scope: !579)
!602 = !DILocation(line: 142, column: 98, scope: !579)
!603 = !DILocation(line: 142, column: 53, scope: !579)
!604 = !DILocation(line: 142, column: 109, scope: !579)
!605 = !DILocation(line: 143, column: 16, scope: !579)
!606 = !DILocation(line: 143, column: 8, scope: !579)
!607 = !DILocation(line: 143, column: 20, scope: !579)
!608 = !DILocation(line: 143, column: 23, scope: !579)
!609 = !DILocation(line: 143, column: 40, scope: !579)
!610 = !DILocation(line: 143, column: 52, scope: !579)
!611 = !DILocation(line: 143, column: 44, scope: !579)
!612 = !DILocation(line: 143, column: 56, scope: !579)
!613 = !DILocation(line: 143, column: 59, scope: !579)
!614 = !DILocation(line: 143, column: 77, scope: !579)
!615 = !DILocation(line: 143, column: 81, scope: !579)
!616 = !DILocation(line: 143, column: 100, scope: !579)
!617 = !DILocation(line: 143, column: 92, scope: !579)
!618 = !DILocation(line: 143, column: 104, scope: !579)
!619 = !DILocation(line: 143, column: 121, scope: !579)
!620 = !DILocation(line: 143, column: 135, scope: !579)
!621 = !DILocation(line: 143, column: 90, scope: !579)
!622 = !DILocation(line: 145, column: 5, scope: !623)
!623 = distinct !DILexicalBlock(scope: !579, file: !31, line: 144, column: 4)
!624 = !DILocation(line: 147, column: 5, scope: !579)
!625 = !DILocation(line: 140, column: 126, scope: !563)
!626 = !DILocation(line: 150, column: 15, scope: !627)
!627 = distinct !DILexicalBlock(scope: !474, file: !31, line: 150, column: 7)
!628 = !DILocation(line: 150, column: 7, scope: !627)
!629 = !DILocation(line: 150, column: 19, scope: !627)
!630 = !DILocation(line: 150, column: 24, scope: !627)
!631 = !DILocation(line: 150, column: 38, scope: !627)
!632 = !DILocation(line: 150, column: 49, scope: !627)
!633 = !DILocation(line: 150, column: 41, scope: !627)
!634 = !DILocation(line: 150, column: 53, scope: !627)
!635 = !DILocation(line: 150, column: 58, scope: !627)
!636 = !DILocation(line: 151, column: 3, scope: !627)
!637 = !DILocation(line: 153, column: 15, scope: !638)
!638 = distinct !DILexicalBlock(scope: !474, file: !31, line: 153, column: 7)
!639 = !DILocation(line: 153, column: 7, scope: !638)
!640 = !DILocation(line: 153, column: 19, scope: !638)
!641 = !DILocation(line: 153, column: 36, scope: !638)
!642 = !DILocation(line: 153, column: 62, scope: !638)
!643 = !DILocation(line: 153, column: 54, scope: !638)
!644 = !DILocation(line: 153, column: 66, scope: !638)
!645 = !DILocation(line: 153, column: 83, scope: !638)
!646 = !DILocation(line: 153, column: 52, scope: !638)
!647 = !DILocation(line: 154, column: 15, scope: !648)
!648 = distinct !DILexicalBlock(scope: !638, file: !31, line: 154, column: 7)
!649 = !DILocation(line: 154, column: 7, scope: !648)
!650 = !DILocation(line: 154, column: 19, scope: !648)
!651 = !DILocation(line: 154, column: 22, scope: !648)
!652 = !DILocation(line: 154, column: 39, scope: !648)
!653 = !DILocation(line: 154, column: 50, scope: !648)
!654 = !DILocation(line: 154, column: 42, scope: !648)
!655 = !DILocation(line: 154, column: 54, scope: !648)
!656 = !DILocation(line: 154, column: 57, scope: !648)
!657 = !DILocation(line: 154, column: 73, scope: !648)
!658 = !DILocation(line: 154, column: 84, scope: !648)
!659 = !DILocation(line: 154, column: 76, scope: !648)
!660 = !DILocation(line: 154, column: 88, scope: !648)
!661 = !DILocation(line: 154, column: 91, scope: !648)
!662 = !DILocation(line: 154, column: 107, scope: !648)
!663 = !DILocation(line: 154, column: 118, scope: !648)
!664 = !DILocation(line: 154, column: 110, scope: !648)
!665 = !DILocation(line: 154, column: 122, scope: !648)
!666 = !DILocation(line: 154, column: 125, scope: !648)
!667 = !DILocation(line: 156, column: 9, scope: !668)
!668 = distinct !DILexicalBlock(scope: !669, file: !31, line: 156, column: 8)
!669 = distinct !DILexicalBlock(scope: !648, file: !31, line: 155, column: 3)
!670 = !DILocation(line: 156, column: 29, scope: !668)
!671 = !DILocation(line: 156, column: 21, scope: !668)
!672 = !DILocation(line: 156, column: 33, scope: !668)
!673 = !DILocation(line: 156, column: 50, scope: !668)
!674 = !DILocation(line: 156, column: 64, scope: !668)
!675 = !DILocation(line: 156, column: 18, scope: !668)
!676 = !DILocation(line: 156, column: 75, scope: !668)
!677 = !DILocation(line: 156, column: 79, scope: !668)
!678 = !DILocation(line: 156, column: 99, scope: !668)
!679 = !DILocation(line: 156, column: 91, scope: !668)
!680 = !DILocation(line: 156, column: 103, scope: !668)
!681 = !DILocation(line: 156, column: 120, scope: !668)
!682 = !DILocation(line: 156, column: 134, scope: !668)
!683 = !DILocation(line: 156, column: 88, scope: !668)
!684 = !DILocation(line: 157, column: 5, scope: !668)
!685 = !DILocation(line: 159, column: 5, scope: !668)
!686 = !DILocation(line: 161, column: 4, scope: !648)
!687 = !DILocation(line: 163, column: 14, scope: !688)
!688 = distinct !DILexicalBlock(scope: !474, file: !31, line: 163, column: 6)
!689 = !DILocation(line: 163, column: 6, scope: !688)
!690 = !DILocation(line: 163, column: 18, scope: !688)
!691 = !DILocation(line: 163, column: 21, scope: !688)
!692 = !DILocation(line: 163, column: 43, scope: !688)
!693 = !DILocation(line: 163, column: 54, scope: !688)
!694 = !DILocation(line: 163, column: 46, scope: !688)
!695 = !DILocation(line: 163, column: 58, scope: !688)
!696 = !DILocation(line: 163, column: 61, scope: !688)
!697 = !DILocation(line: 163, column: 83, scope: !688)
!698 = !DILocation(line: 164, column: 12, scope: !688)
!699 = !DILocation(line: 164, column: 4, scope: !688)
!700 = !DILocation(line: 164, column: 16, scope: !688)
!701 = !DILocation(line: 164, column: 19, scope: !688)
!702 = !DILocation(line: 164, column: 35, scope: !688)
!703 = !DILocation(line: 164, column: 46, scope: !688)
!704 = !DILocation(line: 164, column: 38, scope: !688)
!705 = !DILocation(line: 164, column: 50, scope: !688)
!706 = !DILocation(line: 164, column: 53, scope: !688)
!707 = !DILocation(line: 164, column: 69, scope: !688)
!708 = !DILocation(line: 165, column: 12, scope: !688)
!709 = !DILocation(line: 165, column: 4, scope: !688)
!710 = !DILocation(line: 165, column: 16, scope: !688)
!711 = !DILocation(line: 165, column: 19, scope: !688)
!712 = !DILocation(line: 165, column: 35, scope: !688)
!713 = !DILocation(line: 165, column: 46, scope: !688)
!714 = !DILocation(line: 165, column: 38, scope: !688)
!715 = !DILocation(line: 165, column: 50, scope: !688)
!716 = !DILocation(line: 165, column: 53, scope: !688)
!717 = !DILocation(line: 165, column: 69, scope: !688)
!718 = !DILocation(line: 166, column: 12, scope: !688)
!719 = !DILocation(line: 166, column: 4, scope: !688)
!720 = !DILocation(line: 166, column: 16, scope: !688)
!721 = !DILocation(line: 166, column: 19, scope: !688)
!722 = !DILocation(line: 166, column: 31, scope: !688)
!723 = !DILocation(line: 166, column: 42, scope: !688)
!724 = !DILocation(line: 166, column: 34, scope: !688)
!725 = !DILocation(line: 166, column: 46, scope: !688)
!726 = !DILocation(line: 166, column: 49, scope: !688)
!727 = !DILocation(line: 167, column: 3, scope: !688)
!728 = !DILocation(line: 169, column: 2, scope: !474)
!729 = !DILocation(line: 171, column: 1, scope: !474)
!730 = distinct !DISubprogram(name: "do_muzzle_stuff", linkageName: "_Z15do_muzzle_stuffiP10vms_vector", scope: !31, file: !31, line: 176, type: !731, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !7, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!734 = !DILocalVariable(name: "segnum", arg: 1, scope: !730, file: !31, line: 176, type: !7)
!735 = !DILocation(line: 176, column: 26, scope: !730)
!736 = !DILocalVariable(name: "pos", arg: 2, scope: !730, file: !31, line: 176, type: !733)
!737 = !DILocation(line: 176, column: 46, scope: !730)
!738 = !DILocation(line: 178, column: 48, scope: !730)
!739 = !DILocation(line: 178, column: 14, scope: !730)
!740 = !DILocation(line: 178, column: 2, scope: !730)
!741 = !DILocation(line: 178, column: 34, scope: !730)
!742 = !DILocation(line: 178, column: 46, scope: !730)
!743 = !DILocation(line: 179, column: 43, scope: !730)
!744 = !DILocation(line: 179, column: 14, scope: !730)
!745 = !DILocation(line: 179, column: 2, scope: !730)
!746 = !DILocation(line: 179, column: 34, scope: !730)
!747 = !DILocation(line: 179, column: 41, scope: !730)
!748 = !DILocation(line: 180, column: 41, scope: !730)
!749 = !DILocation(line: 180, column: 14, scope: !730)
!750 = !DILocation(line: 180, column: 2, scope: !730)
!751 = !DILocation(line: 180, column: 34, scope: !730)
!752 = !DILocation(line: 180, column: 38, scope: !730)
!753 = !DILocation(line: 181, column: 20, scope: !730)
!754 = !DILocation(line: 182, column: 6, scope: !755)
!755 = distinct !DILexicalBlock(scope: !730, file: !31, line: 182, column: 6)
!756 = !DILocation(line: 182, column: 25, scope: !755)
!757 = !DILocation(line: 183, column: 22, scope: !755)
!758 = !DILocation(line: 183, column: 3, scope: !755)
!759 = !DILocation(line: 184, column: 1, scope: !730)
!760 = distinct !DISubprogram(name: "create_weapon_object", linkageName: "_Z20create_weapon_objectiiP10vms_vector", scope: !31, file: !31, line: 187, type: !761, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!761 = !DISubroutineType(types: !762)
!762 = !{!7, !7, !7, !733}
!763 = !DILocalVariable(name: "weapon_type", arg: 1, scope: !760, file: !31, line: 187, type: !7)
!764 = !DILocation(line: 187, column: 30, scope: !760)
!765 = !DILocalVariable(name: "segnum", arg: 2, scope: !760, file: !31, line: 187, type: !7)
!766 = !DILocation(line: 187, column: 46, scope: !760)
!767 = !DILocalVariable(name: "position", arg: 3, scope: !760, file: !31, line: 187, type: !733)
!768 = !DILocation(line: 187, column: 65, scope: !760)
!769 = !DILocalVariable(name: "rtype", scope: !760, file: !31, line: 233, type: !7)
!770 = !DILocation(line: 233, column: 6, scope: !760)
!771 = !DILocalVariable(name: "laser_radius", scope: !760, file: !31, line: 234, type: !21)
!772 = !DILocation(line: 234, column: 6, scope: !760)
!773 = !DILocalVariable(name: "objnum", scope: !760, file: !31, line: 235, type: !7)
!774 = !DILocation(line: 235, column: 6, scope: !760)
!775 = !DILocalVariable(name: "obj", scope: !760, file: !31, line: 236, type: !33)
!776 = !DILocation(line: 236, column: 10, scope: !760)
!777 = !DILocation(line: 238, column: 22, scope: !760)
!778 = !DILocation(line: 238, column: 10, scope: !760)
!779 = !DILocation(line: 238, column: 35, scope: !760)
!780 = !DILocation(line: 238, column: 2, scope: !760)
!781 = !DILocation(line: 241, column: 10, scope: !782)
!782 = distinct !DILexicalBlock(scope: !760, file: !31, line: 239, column: 2)
!783 = !DILocation(line: 242, column: 31, scope: !782)
!784 = !DILocation(line: 242, column: 19, scope: !782)
!785 = !DILocation(line: 242, column: 44, scope: !782)
!786 = !DILocation(line: 242, column: 17, scope: !782)
!787 = !DILocation(line: 243, column: 4, scope: !782)
!788 = !DILocation(line: 245, column: 17, scope: !782)
!789 = !DILocation(line: 246, column: 10, scope: !782)
!790 = !DILocation(line: 247, column: 4, scope: !782)
!791 = !DILocation(line: 249, column: 4, scope: !782)
!792 = !DILocation(line: 250, column: 4, scope: !782)
!793 = !DILocation(line: 252, column: 10, scope: !782)
!794 = !DILocation(line: 253, column: 17, scope: !782)
!795 = !DILocation(line: 254, column: 4, scope: !782)
!796 = !DILocation(line: 256, column: 10, scope: !782)
!797 = !DILocation(line: 257, column: 31, scope: !782)
!798 = !DILocation(line: 257, column: 19, scope: !782)
!799 = !DILocation(line: 257, column: 44, scope: !782)
!800 = !DILocation(line: 257, column: 17, scope: !782)
!801 = !DILocation(line: 258, column: 4, scope: !782)
!802 = !DILocation(line: 260, column: 4, scope: !782)
!803 = !DILocation(line: 261, column: 2, scope: !782)
!804 = !DILocation(line: 263, column: 2, scope: !760)
!805 = !DILocation(line: 264, column: 2, scope: !760)
!806 = !DILocation(line: 266, column: 35, scope: !760)
!807 = !DILocation(line: 266, column: 48, scope: !760)
!808 = !DILocation(line: 266, column: 56, scope: !760)
!809 = !DILocation(line: 266, column: 72, scope: !760)
!810 = !DILocation(line: 266, column: 109, scope: !760)
!811 = !DILocation(line: 266, column: 11, scope: !760)
!812 = !DILocation(line: 266, column: 9, scope: !760)
!813 = !DILocation(line: 268, column: 17, scope: !760)
!814 = !DILocation(line: 268, column: 9, scope: !760)
!815 = !DILocation(line: 268, column: 6, scope: !760)
!816 = !DILocation(line: 270, column: 18, scope: !817)
!817 = distinct !DILexicalBlock(scope: !760, file: !31, line: 270, column: 6)
!818 = !DILocation(line: 270, column: 6, scope: !817)
!819 = !DILocation(line: 270, column: 31, scope: !817)
!820 = !DILocation(line: 270, column: 43, scope: !817)
!821 = !DILocation(line: 272, column: 48, scope: !822)
!822 = distinct !DILexicalBlock(scope: !817, file: !31, line: 271, column: 2)
!823 = !DILocation(line: 272, column: 53, scope: !822)
!824 = !DILocation(line: 272, column: 36, scope: !822)
!825 = !DILocation(line: 272, column: 57, scope: !822)
!826 = !DILocation(line: 272, column: 3, scope: !822)
!827 = !DILocation(line: 272, column: 8, scope: !822)
!828 = !DILocation(line: 272, column: 24, scope: !822)
!829 = !DILocation(line: 272, column: 34, scope: !822)
!830 = !DILocation(line: 273, column: 37, scope: !822)
!831 = !DILocation(line: 273, column: 42, scope: !822)
!832 = !DILocation(line: 273, column: 58, scope: !822)
!833 = !DILocation(line: 273, column: 22, scope: !822)
!834 = !DILocation(line: 273, column: 69, scope: !822)
!835 = !DILocation(line: 273, column: 85, scope: !822)
!836 = !DILocation(line: 273, column: 90, scope: !822)
!837 = !DILocation(line: 273, column: 73, scope: !822)
!838 = !DILocation(line: 273, column: 94, scope: !822)
!839 = !DILocation(line: 273, column: 15, scope: !822)
!840 = !DILocation(line: 273, column: 3, scope: !822)
!841 = !DILocation(line: 273, column: 8, scope: !822)
!842 = !DILocation(line: 273, column: 13, scope: !822)
!843 = !DILocation(line: 274, column: 2, scope: !822)
!844 = !DILocation(line: 276, column: 42, scope: !760)
!845 = !DILocation(line: 276, column: 30, scope: !760)
!846 = !DILocation(line: 276, column: 55, scope: !760)
!847 = !DILocation(line: 276, column: 2, scope: !760)
!848 = !DILocation(line: 276, column: 7, scope: !760)
!849 = !DILocation(line: 276, column: 23, scope: !760)
!850 = !DILocation(line: 276, column: 28, scope: !760)
!851 = !DILocation(line: 277, column: 42, scope: !760)
!852 = !DILocation(line: 277, column: 30, scope: !760)
!853 = !DILocation(line: 277, column: 55, scope: !760)
!854 = !DILocation(line: 277, column: 2, scope: !760)
!855 = !DILocation(line: 277, column: 7, scope: !760)
!856 = !DILocation(line: 277, column: 23, scope: !760)
!857 = !DILocation(line: 277, column: 28, scope: !760)
!858 = !DILocation(line: 278, column: 2, scope: !760)
!859 = !DILocation(line: 280, column: 18, scope: !860)
!860 = distinct !DILexicalBlock(scope: !760, file: !31, line: 280, column: 6)
!861 = !DILocation(line: 280, column: 6, scope: !860)
!862 = !DILocation(line: 280, column: 31, scope: !860)
!863 = !DILocation(line: 280, column: 37, scope: !860)
!864 = !DILocation(line: 281, column: 3, scope: !860)
!865 = !DILocation(line: 281, column: 8, scope: !860)
!866 = !DILocation(line: 281, column: 24, scope: !860)
!867 = !DILocation(line: 281, column: 30, scope: !860)
!868 = !DILocation(line: 283, column: 18, scope: !869)
!869 = distinct !DILexicalBlock(scope: !760, file: !31, line: 283, column: 6)
!870 = !DILocation(line: 283, column: 6, scope: !869)
!871 = !DILocation(line: 283, column: 31, scope: !869)
!872 = !DILocation(line: 283, column: 37, scope: !869)
!873 = !DILocation(line: 283, column: 41, scope: !869)
!874 = !DILocation(line: 283, column: 44, scope: !869)
!875 = !DILocation(line: 284, column: 3, scope: !869)
!876 = !DILocation(line: 284, column: 8, scope: !869)
!877 = !DILocation(line: 284, column: 24, scope: !869)
!878 = !DILocation(line: 284, column: 30, scope: !869)
!879 = !DILocation(line: 286, column: 9, scope: !760)
!880 = !DILocation(line: 286, column: 2, scope: !760)
!881 = distinct !DISubprogram(name: "fixdiv", linkageName: "_Z6fixdivii", scope: !22, file: !22, line: 89, type: !882, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!882 = !DISubroutineType(types: !883)
!883 = !{!21, !21, !21}
!884 = !DILocalVariable(name: "a", arg: 1, scope: !881, file: !22, line: 89, type: !21)
!885 = !DILocation(line: 89, column: 26, scope: !881)
!886 = !DILocalVariable(name: "b", arg: 2, scope: !881, file: !22, line: 89, type: !21)
!887 = !DILocation(line: 89, column: 33, scope: !881)
!888 = !DILocation(line: 92, column: 6, scope: !889)
!889 = distinct !DILexicalBlock(scope: !881, file: !22, line: 92, column: 6)
!890 = !DILocation(line: 92, column: 8, scope: !889)
!891 = !DILocation(line: 92, column: 14, scope: !889)
!892 = !DILocation(line: 94, column: 25, scope: !881)
!893 = !DILocation(line: 94, column: 27, scope: !881)
!894 = !DILocation(line: 94, column: 36, scope: !881)
!895 = !DILocation(line: 94, column: 34, scope: !881)
!896 = !DILocation(line: 94, column: 14, scope: !881)
!897 = !DILocation(line: 94, column: 2, scope: !881)
!898 = !DILocation(line: 95, column: 1, scope: !881)
!899 = distinct !DISubprogram(name: "delete_old_omega_blobs", linkageName: "_Z22delete_old_omega_blobsP6object", scope: !31, file: !31, line: 319, type: !450, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!900 = !DILocalVariable(name: "parent_objp", arg: 1, scope: !899, file: !31, line: 319, type: !33)
!901 = !DILocation(line: 319, column: 37, scope: !899)
!902 = !DILocalVariable(name: "i", scope: !899, file: !31, line: 321, type: !7)
!903 = !DILocation(line: 321, column: 6, scope: !899)
!904 = !DILocalVariable(name: "parent_num", scope: !899, file: !31, line: 322, type: !7)
!905 = !DILocation(line: 322, column: 6, scope: !899)
!906 = !DILocalVariable(name: "count", scope: !899, file: !31, line: 323, type: !7)
!907 = !DILocation(line: 323, column: 6, scope: !899)
!908 = !DILocation(line: 325, column: 15, scope: !899)
!909 = !DILocation(line: 325, column: 28, scope: !899)
!910 = !DILocation(line: 325, column: 45, scope: !899)
!911 = !DILocation(line: 325, column: 13, scope: !899)
!912 = !DILocation(line: 327, column: 8, scope: !913)
!913 = distinct !DILexicalBlock(scope: !899, file: !31, line: 327, column: 2)
!914 = !DILocation(line: 327, column: 7, scope: !913)
!915 = !DILocation(line: 327, column: 12, scope: !916)
!916 = distinct !DILexicalBlock(scope: !913, file: !31, line: 327, column: 2)
!917 = !DILocation(line: 327, column: 15, scope: !916)
!918 = !DILocation(line: 327, column: 13, scope: !916)
!919 = !DILocation(line: 327, column: 2, scope: !913)
!920 = !DILocation(line: 328, column: 15, scope: !921)
!921 = distinct !DILexicalBlock(scope: !916, file: !31, line: 328, column: 7)
!922 = !DILocation(line: 328, column: 7, scope: !921)
!923 = !DILocation(line: 328, column: 18, scope: !921)
!924 = !DILocation(line: 328, column: 23, scope: !921)
!925 = !DILocation(line: 329, column: 16, scope: !926)
!926 = distinct !DILexicalBlock(scope: !921, file: !31, line: 329, column: 8)
!927 = !DILocation(line: 329, column: 8, scope: !926)
!928 = !DILocation(line: 329, column: 19, scope: !926)
!929 = !DILocation(line: 329, column: 22, scope: !926)
!930 = !DILocation(line: 330, column: 17, scope: !931)
!931 = distinct !DILexicalBlock(scope: !926, file: !31, line: 330, column: 9)
!932 = !DILocation(line: 330, column: 9, scope: !931)
!933 = !DILocation(line: 330, column: 20, scope: !931)
!934 = !DILocation(line: 330, column: 37, scope: !931)
!935 = !DILocation(line: 330, column: 51, scope: !931)
!936 = !DILocation(line: 330, column: 48, scope: !931)
!937 = !DILocation(line: 331, column: 17, scope: !938)
!938 = distinct !DILexicalBlock(scope: !931, file: !31, line: 330, column: 63)
!939 = !DILocation(line: 331, column: 6, scope: !938)
!940 = !DILocation(line: 332, column: 11, scope: !938)
!941 = !DILocation(line: 333, column: 5, scope: !938)
!942 = !DILocation(line: 329, column: 25, scope: !926)
!943 = !DILocation(line: 328, column: 26, scope: !921)
!944 = !DILocation(line: 327, column: 38, scope: !916)
!945 = !DILocation(line: 327, column: 2, scope: !916)
!946 = distinct !{!946, !919, !947, !948}
!947 = !DILocation(line: 333, column: 5, scope: !913)
!948 = !{!"llvm.loop.mustprogress"}
!949 = !DILocation(line: 335, column: 2, scope: !899)
!950 = !DILocation(line: 336, column: 1, scope: !899)
!951 = distinct !DISubprogram(name: "create_omega_blobs", linkageName: "_Z18create_omega_blobsiP10vms_vectorS0_P6object", scope: !31, file: !31, line: 339, type: !952, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !7, !733, !733, !33}
!954 = !DILocalVariable(name: "firing_segnum", arg: 1, scope: !951, file: !31, line: 339, type: !7)
!955 = !DILocation(line: 339, column: 29, scope: !951)
!956 = !DILocalVariable(name: "firing_pos", arg: 2, scope: !951, file: !31, line: 339, type: !733)
!957 = !DILocation(line: 339, column: 56, scope: !951)
!958 = !DILocalVariable(name: "goal_pos", arg: 3, scope: !951, file: !31, line: 339, type: !733)
!959 = !DILocation(line: 339, column: 80, scope: !951)
!960 = !DILocalVariable(name: "parent_objp", arg: 4, scope: !951, file: !31, line: 339, type: !33)
!961 = !DILocation(line: 339, column: 98, scope: !951)
!962 = !DILocalVariable(name: "i", scope: !951, file: !31, line: 341, type: !7)
!963 = !DILocation(line: 341, column: 8, scope: !951)
!964 = !DILocalVariable(name: "last_segnum", scope: !951, file: !31, line: 341, type: !7)
!965 = !DILocation(line: 341, column: 11, scope: !951)
!966 = !DILocalVariable(name: "last_created_objnum", scope: !951, file: !31, line: 341, type: !7)
!967 = !DILocation(line: 341, column: 24, scope: !951)
!968 = !DILocalVariable(name: "vec_to_goal", scope: !951, file: !31, line: 342, type: !54)
!969 = !DILocation(line: 342, column: 13, scope: !951)
!970 = !DILocalVariable(name: "dist_to_goal", scope: !951, file: !31, line: 343, type: !21)
!971 = !DILocation(line: 343, column: 8, scope: !951)
!972 = !DILocalVariable(name: "num_omega_blobs", scope: !951, file: !31, line: 344, type: !7)
!973 = !DILocation(line: 344, column: 8, scope: !951)
!974 = !DILocalVariable(name: "omega_blob_dist", scope: !951, file: !31, line: 345, type: !21)
!975 = !DILocation(line: 345, column: 8, scope: !951)
!976 = !DILocalVariable(name: "omega_delta_vector", scope: !951, file: !31, line: 346, type: !54)
!977 = !DILocation(line: 346, column: 13, scope: !951)
!978 = !DILocalVariable(name: "blob_pos", scope: !951, file: !31, line: 347, type: !54)
!979 = !DILocation(line: 347, column: 13, scope: !951)
!980 = !DILocalVariable(name: "perturb_vec", scope: !951, file: !31, line: 347, type: !54)
!981 = !DILocation(line: 347, column: 23, scope: !951)
!982 = !DILocalVariable(name: "perturb_array", scope: !951, file: !31, line: 348, type: !983)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, elements: !984)
!984 = !{!985}
!985 = !DISubrange(count: 16)
!986 = !DILocation(line: 348, column: 8, scope: !951)
!987 = !DILocation(line: 350, column: 6, scope: !988)
!988 = distinct !DILexicalBlock(scope: !951, file: !31, line: 350, column: 6)
!989 = !DILocation(line: 350, column: 16, scope: !988)
!990 = !DILocation(line: 351, column: 26, scope: !988)
!991 = !DILocation(line: 351, column: 3, scope: !988)
!992 = !DILocation(line: 353, column: 27, scope: !951)
!993 = !DILocation(line: 353, column: 37, scope: !951)
!994 = !DILocation(line: 353, column: 2, scope: !951)
!995 = !DILocation(line: 355, column: 17, scope: !951)
!996 = !DILocation(line: 355, column: 15, scope: !951)
!997 = !DILocation(line: 357, column: 6, scope: !998)
!998 = distinct !DILexicalBlock(scope: !951, file: !31, line: 357, column: 6)
!999 = !DILocation(line: 357, column: 19, scope: !998)
!1000 = !DILocation(line: 359, column: 19, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !998, file: !31, line: 358, column: 2)
!1002 = !DILocation(line: 360, column: 21, scope: !1001)
!1003 = !DILocation(line: 360, column: 34, scope: !1001)
!1004 = !DILocation(line: 360, column: 33, scope: !1001)
!1005 = !DILocation(line: 360, column: 19, scope: !1001)
!1006 = !DILocation(line: 361, column: 7, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1001, file: !31, line: 361, column: 7)
!1008 = !DILocation(line: 361, column: 23, scope: !1007)
!1009 = !DILocation(line: 362, column: 20, scope: !1007)
!1010 = !DILocation(line: 362, column: 4, scope: !1007)
!1011 = !DILocation(line: 363, column: 2, scope: !1001)
!1012 = !DILocation(line: 365, column: 19, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !998, file: !31, line: 364, column: 2)
!1014 = !DILocation(line: 366, column: 21, scope: !1013)
!1015 = !DILocation(line: 366, column: 36, scope: !1013)
!1016 = !DILocation(line: 366, column: 34, scope: !1013)
!1017 = !DILocation(line: 366, column: 19, scope: !1013)
!1018 = !DILocation(line: 367, column: 7, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1013, file: !31, line: 367, column: 7)
!1020 = !DILocation(line: 367, column: 23, scope: !1019)
!1021 = !DILocation(line: 369, column: 20, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !31, line: 368, column: 3)
!1023 = !DILocation(line: 370, column: 22, scope: !1022)
!1024 = !DILocation(line: 370, column: 37, scope: !1022)
!1025 = !DILocation(line: 370, column: 35, scope: !1022)
!1026 = !DILocation(line: 370, column: 20, scope: !1022)
!1027 = !DILocation(line: 371, column: 3, scope: !1022)
!1028 = !DILocation(line: 371, column: 14, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1019, file: !31, line: 371, column: 14)
!1030 = !DILocation(line: 371, column: 30, scope: !1029)
!1031 = !DILocation(line: 373, column: 20, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1029, file: !31, line: 372, column: 3)
!1033 = !DILocation(line: 374, column: 22, scope: !1032)
!1034 = !DILocation(line: 374, column: 37, scope: !1032)
!1035 = !DILocation(line: 374, column: 35, scope: !1032)
!1036 = !DILocation(line: 374, column: 20, scope: !1032)
!1037 = !DILocation(line: 375, column: 3, scope: !1032)
!1038 = !DILocation(line: 378, column: 21, scope: !951)
!1039 = !DILocation(line: 379, column: 36, scope: !951)
!1040 = !DILocation(line: 379, column: 2, scope: !951)
!1041 = !DILocation(line: 382, column: 14, scope: !951)
!1042 = !DILocation(line: 382, column: 11, scope: !951)
!1043 = !DILocation(line: 383, column: 16, scope: !951)
!1044 = !DILocation(line: 383, column: 14, scope: !951)
!1045 = !DILocation(line: 386, column: 6, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !951, file: !31, line: 386, column: 6)
!1047 = !DILocation(line: 386, column: 19, scope: !1046)
!1048 = !DILocation(line: 388, column: 9, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !31, line: 388, column: 3)
!1050 = distinct !DILexicalBlock(scope: !1046, file: !31, line: 387, column: 2)
!1051 = !DILocation(line: 388, column: 8, scope: !1049)
!1052 = !DILocation(line: 388, column: 13, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1049, file: !31, line: 388, column: 3)
!1054 = !DILocation(line: 388, column: 15, scope: !1053)
!1055 = !DILocation(line: 388, column: 14, scope: !1053)
!1056 = !DILocation(line: 388, column: 3, scope: !1049)
!1057 = !DILocation(line: 389, column: 18, scope: !1053)
!1058 = !DILocation(line: 389, column: 4, scope: !1053)
!1059 = !DILocation(line: 389, column: 21, scope: !1053)
!1060 = !DILocation(line: 388, column: 33, scope: !1053)
!1061 = !DILocation(line: 388, column: 3, scope: !1053)
!1062 = distinct !{!1062, !1056, !1063, !948}
!1063 = !DILocation(line: 389, column: 23, scope: !1049)
!1064 = !DILocation(line: 390, column: 2, scope: !1050)
!1065 = !DILocation(line: 393, column: 3, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1046, file: !31, line: 392, column: 2)
!1067 = !DILocation(line: 394, column: 9, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1066, file: !31, line: 394, column: 3)
!1069 = !DILocation(line: 394, column: 8, scope: !1068)
!1070 = !DILocation(line: 394, column: 13, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1068, file: !31, line: 394, column: 3)
!1072 = !DILocation(line: 394, column: 15, scope: !1071)
!1073 = !DILocation(line: 394, column: 30, scope: !1071)
!1074 = !DILocation(line: 394, column: 14, scope: !1071)
!1075 = !DILocation(line: 394, column: 3, scope: !1068)
!1076 = !DILocation(line: 396, column: 28, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1071, file: !31, line: 395, column: 3)
!1078 = !DILocation(line: 396, column: 27, scope: !1077)
!1079 = !DILocation(line: 396, column: 30, scope: !1077)
!1080 = !DILocation(line: 396, column: 18, scope: !1077)
!1081 = !DILocation(line: 396, column: 4, scope: !1077)
!1082 = !DILocation(line: 396, column: 21, scope: !1077)
!1083 = !DILocation(line: 397, column: 46, scope: !1077)
!1084 = !DILocation(line: 397, column: 45, scope: !1077)
!1085 = !DILocation(line: 397, column: 18, scope: !1077)
!1086 = !DILocation(line: 397, column: 33, scope: !1077)
!1087 = !DILocation(line: 397, column: 36, scope: !1077)
!1088 = !DILocation(line: 397, column: 35, scope: !1077)
!1089 = !DILocation(line: 397, column: 4, scope: !1077)
!1090 = !DILocation(line: 397, column: 39, scope: !1077)
!1091 = !DILocation(line: 398, column: 3, scope: !1077)
!1092 = !DILocation(line: 394, column: 35, scope: !1071)
!1093 = !DILocation(line: 394, column: 3, scope: !1071)
!1094 = distinct !{!1094, !1075, !1095, !948}
!1095 = !DILocation(line: 398, column: 3, scope: !1068)
!1096 = !DILocation(line: 402, column: 2, scope: !951)
!1097 = !DILocation(line: 403, column: 35, scope: !951)
!1098 = !DILocation(line: 403, column: 48, scope: !951)
!1099 = !DILocation(line: 403, column: 55, scope: !951)
!1100 = !DILocation(line: 403, column: 2, scope: !951)
!1101 = !DILocation(line: 405, column: 27, scope: !951)
!1102 = !DILocation(line: 407, column: 8, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !951, file: !31, line: 407, column: 2)
!1104 = !DILocation(line: 407, column: 7, scope: !1103)
!1105 = !DILocation(line: 407, column: 12, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1103, file: !31, line: 407, column: 2)
!1107 = !DILocation(line: 407, column: 14, scope: !1106)
!1108 = !DILocation(line: 407, column: 13, scope: !1106)
!1109 = !DILocation(line: 407, column: 2, scope: !1103)
!1110 = !DILocalVariable(name: "temp_pos", scope: !1111, file: !31, line: 409, type: !54)
!1111 = distinct !DILexicalBlock(scope: !1106, file: !31, line: 408, column: 2)
!1112 = !DILocation(line: 409, column: 14, scope: !1111)
!1113 = !DILocalVariable(name: "blob_objnum", scope: !1111, file: !31, line: 410, type: !7)
!1114 = !DILocation(line: 410, column: 9, scope: !1111)
!1115 = !DILocalVariable(name: "segnum", scope: !1111, file: !31, line: 410, type: !7)
!1116 = !DILocation(line: 410, column: 22, scope: !1111)
!1117 = !DILocation(line: 413, column: 7, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1111, file: !31, line: 413, column: 7)
!1119 = !DILocation(line: 413, column: 12, scope: !1118)
!1120 = !DILocation(line: 413, column: 27, scope: !1118)
!1121 = !DILocation(line: 413, column: 9, scope: !1118)
!1122 = !DILocation(line: 414, column: 4, scope: !1118)
!1123 = !DILocation(line: 417, column: 8, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1111, file: !31, line: 417, column: 7)
!1125 = !DILocation(line: 417, column: 10, scope: !1124)
!1126 = !DILocation(line: 417, column: 15, scope: !1124)
!1127 = !DILocalVariable(name: "temp_vec", scope: !1128, file: !31, line: 419, type: !54)
!1128 = distinct !DILexicalBlock(scope: !1124, file: !31, line: 418, column: 3)
!1129 = !DILocation(line: 419, column: 15, scope: !1128)
!1130 = !DILocation(line: 421, column: 4, scope: !1128)
!1131 = !DILocation(line: 422, column: 4, scope: !1128)
!1132 = !DILocation(line: 423, column: 3, scope: !1128)
!1133 = !DILocation(line: 425, column: 70, scope: !1111)
!1134 = !DILocation(line: 425, column: 56, scope: !1111)
!1135 = !DILocation(line: 425, column: 3, scope: !1111)
!1136 = !DILocation(line: 427, column: 38, scope: !1111)
!1137 = !DILocation(line: 427, column: 12, scope: !1111)
!1138 = !DILocation(line: 427, column: 10, scope: !1111)
!1139 = !DILocation(line: 428, column: 7, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1111, file: !31, line: 428, column: 7)
!1141 = !DILocation(line: 428, column: 14, scope: !1140)
!1142 = !DILocalVariable(name: "objp", scope: !1143, file: !31, line: 430, type: !33)
!1143 = distinct !DILexicalBlock(scope: !1140, file: !31, line: 429, column: 3)
!1144 = !DILocation(line: 430, column: 13, scope: !1143)
!1145 = !DILocation(line: 432, column: 18, scope: !1143)
!1146 = !DILocation(line: 432, column: 16, scope: !1143)
!1147 = !DILocation(line: 433, column: 51, scope: !1143)
!1148 = !DILocation(line: 433, column: 18, scope: !1143)
!1149 = !DILocation(line: 433, column: 16, scope: !1143)
!1150 = !DILocation(line: 434, column: 8, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1143, file: !31, line: 434, column: 8)
!1152 = !DILocation(line: 434, column: 20, scope: !1151)
!1153 = !DILocation(line: 435, column: 5, scope: !1151)
!1154 = !DILocation(line: 437, column: 26, scope: !1143)
!1155 = !DILocation(line: 437, column: 24, scope: !1143)
!1156 = !DILocation(line: 439, column: 20, scope: !1143)
!1157 = !DILocation(line: 439, column: 12, scope: !1143)
!1158 = !DILocation(line: 439, column: 9, scope: !1143)
!1159 = !DILocation(line: 441, column: 4, scope: !1143)
!1160 = !DILocation(line: 441, column: 10, scope: !1143)
!1161 = !DILocation(line: 441, column: 19, scope: !1143)
!1162 = !DILocation(line: 442, column: 4, scope: !1143)
!1163 = !DILocation(line: 442, column: 10, scope: !1143)
!1164 = !DILocation(line: 442, column: 26, scope: !1143)
!1165 = !DILocation(line: 442, column: 35, scope: !1143)
!1166 = !DILocation(line: 445, column: 18, scope: !1143)
!1167 = !DILocation(line: 445, column: 24, scope: !1143)
!1168 = !DILocation(line: 445, column: 40, scope: !1143)
!1169 = !DILocation(line: 445, column: 4, scope: !1143)
!1170 = !DILocation(line: 447, column: 29, scope: !1143)
!1171 = !DILocation(line: 447, column: 35, scope: !1143)
!1172 = !DILocation(line: 447, column: 17, scope: !1143)
!1173 = !DILocation(line: 447, column: 39, scope: !1143)
!1174 = !DILocation(line: 447, column: 4, scope: !1143)
!1175 = !DILocation(line: 447, column: 10, scope: !1143)
!1176 = !DILocation(line: 447, column: 15, scope: !1143)
!1177 = !DILocation(line: 449, column: 46, scope: !1143)
!1178 = !DILocation(line: 449, column: 45, scope: !1143)
!1179 = !DILocation(line: 449, column: 69, scope: !1143)
!1180 = !DILocation(line: 449, column: 75, scope: !1143)
!1181 = !DILocation(line: 449, column: 57, scope: !1143)
!1182 = !DILocation(line: 449, column: 79, scope: !1143)
!1183 = !DILocation(line: 449, column: 88, scope: !1143)
!1184 = !DILocation(line: 449, column: 20, scope: !1143)
!1185 = !DILocation(line: 449, column: 4, scope: !1143)
!1186 = !DILocation(line: 449, column: 10, scope: !1143)
!1187 = !DILocation(line: 449, column: 18, scope: !1143)
!1188 = !DILocation(line: 451, column: 43, scope: !1143)
!1189 = !DILocation(line: 451, column: 56, scope: !1143)
!1190 = !DILocation(line: 451, column: 4, scope: !1143)
!1191 = !DILocation(line: 451, column: 10, scope: !1143)
!1192 = !DILocation(line: 451, column: 27, scope: !1143)
!1193 = !DILocation(line: 451, column: 41, scope: !1143)
!1194 = !DILocation(line: 452, column: 46, scope: !1143)
!1195 = !DILocation(line: 452, column: 59, scope: !1143)
!1196 = !DILocation(line: 452, column: 4, scope: !1143)
!1197 = !DILocation(line: 452, column: 10, scope: !1143)
!1198 = !DILocation(line: 452, column: 27, scope: !1143)
!1199 = !DILocation(line: 452, column: 44, scope: !1143)
!1200 = !DILocation(line: 453, column: 42, scope: !1143)
!1201 = !DILocation(line: 453, column: 53, scope: !1143)
!1202 = !DILocation(line: 453, column: 4, scope: !1143)
!1203 = !DILocation(line: 453, column: 10, scope: !1143)
!1204 = !DILocation(line: 453, column: 27, scope: !1143)
!1205 = !DILocation(line: 453, column: 40, scope: !1143)
!1206 = !DILocation(line: 454, column: 4, scope: !1143)
!1207 = !DILocation(line: 454, column: 10, scope: !1143)
!1208 = !DILocation(line: 454, column: 24, scope: !1143)
!1209 = !DILocation(line: 456, column: 3, scope: !1143)
!1210 = !DILocation(line: 457, column: 3, scope: !1111)
!1211 = !DILocation(line: 458, column: 2, scope: !1111)
!1212 = !DILocation(line: 407, column: 32, scope: !1106)
!1213 = !DILocation(line: 407, column: 2, scope: !1106)
!1214 = distinct !{!1214, !1109, !1215, !948}
!1215 = !DILocation(line: 458, column: 2, scope: !1103)
!1216 = !DILocation(line: 461, column: 6, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !951, file: !31, line: 461, column: 6)
!1218 = !DILocation(line: 461, column: 26, scope: !1217)
!1219 = !DILocation(line: 463, column: 25, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1217, file: !31, line: 462, column: 2)
!1221 = !DILocation(line: 463, column: 17, scope: !1220)
!1222 = !DILocation(line: 463, column: 46, scope: !1220)
!1223 = !DILocation(line: 463, column: 62, scope: !1220)
!1224 = !DILocation(line: 463, column: 100, scope: !1220)
!1225 = !DILocation(line: 463, column: 72, scope: !1220)
!1226 = !DILocation(line: 463, column: 117, scope: !1220)
!1227 = !DILocation(line: 463, column: 3, scope: !1220)
!1228 = !DILocation(line: 464, column: 11, scope: !1220)
!1229 = !DILocation(line: 464, column: 3, scope: !1220)
!1230 = !DILocation(line: 464, column: 32, scope: !1220)
!1231 = !DILocation(line: 464, column: 46, scope: !1220)
!1232 = !DILocation(line: 465, column: 2, scope: !1220)
!1233 = !DILocation(line: 467, column: 27, scope: !951)
!1234 = !DILocation(line: 468, column: 1, scope: !951)
!1235 = distinct !DISubprogram(name: "fixmul", linkageName: "_Z6fixmulii", scope: !22, file: !22, line: 83, type: !882, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!1236 = !DILocalVariable(name: "a", arg: 1, scope: !1235, file: !22, line: 83, type: !21)
!1237 = !DILocation(line: 83, column: 26, scope: !1235)
!1238 = !DILocalVariable(name: "b", arg: 2, scope: !1235, file: !22, line: 83, type: !21)
!1239 = !DILocation(line: 83, column: 33, scope: !1235)
!1240 = !DILocation(line: 85, column: 19, scope: !1235)
!1241 = !DILocation(line: 85, column: 32, scope: !1235)
!1242 = !DILocation(line: 85, column: 21, scope: !1235)
!1243 = !DILocation(line: 85, column: 35, scope: !1235)
!1244 = !DILocation(line: 85, column: 9, scope: !1235)
!1245 = !DILocation(line: 85, column: 2, scope: !1235)
!1246 = distinct !DISubprogram(name: "omega_charge_frame", linkageName: "_Z18omega_charge_framev", scope: !31, file: !31, line: 480, type: !1247, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{null}
!1249 = !DILocalVariable(name: "delta_charge", scope: !1246, file: !31, line: 482, type: !21)
!1250 = !DILocation(line: 482, column: 6, scope: !1246)
!1251 = !DILocalVariable(name: "old_omega_charge", scope: !1246, file: !31, line: 482, type: !21)
!1252 = !DILocation(line: 482, column: 20, scope: !1246)
!1253 = !DILocation(line: 484, column: 6, scope: !1254)
!1254 = distinct !DILexicalBlock(scope: !1246, file: !31, line: 484, column: 6)
!1255 = !DILocation(line: 484, column: 19, scope: !1254)
!1256 = !DILocation(line: 485, column: 3, scope: !1254)
!1257 = !DILocation(line: 487, column: 8, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1246, file: !31, line: 487, column: 6)
!1259 = !DILocation(line: 487, column: 42, scope: !1258)
!1260 = !DILocation(line: 487, column: 7, scope: !1258)
!1261 = !DILocation(line: 487, column: 6, scope: !1258)
!1262 = !DILocation(line: 488, column: 3, scope: !1258)
!1263 = !DILocation(line: 490, column: 6, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1246, file: !31, line: 490, column: 6)
!1265 = !DILocation(line: 491, column: 3, scope: !1264)
!1266 = !DILocation(line: 493, column: 7, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1246, file: !31, line: 493, column: 6)
!1268 = !DILocation(line: 493, column: 22, scope: !1267)
!1269 = !DILocation(line: 493, column: 38, scope: !1267)
!1270 = !DILocation(line: 493, column: 42, scope: !1267)
!1271 = !DILocation(line: 493, column: 55, scope: !1267)
!1272 = !DILocation(line: 493, column: 61, scope: !1267)
!1273 = !DILocation(line: 493, column: 73, scope: !1267)
!1274 = !DILocation(line: 493, column: 65, scope: !1267)
!1275 = !DILocation(line: 493, column: 85, scope: !1267)
!1276 = !DILocation(line: 493, column: 92, scope: !1267)
!1277 = !DILocation(line: 494, column: 17, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1267, file: !31, line: 493, column: 99)
!1279 = !DILocation(line: 495, column: 3, scope: !1278)
!1280 = !DILocation(line: 496, column: 2, scope: !1278)
!1281 = !DILocation(line: 499, column: 7, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1246, file: !31, line: 499, column: 6)
!1283 = !DILocation(line: 499, column: 32, scope: !1282)
!1284 = !DILocation(line: 499, column: 29, scope: !1282)
!1285 = !DILocation(line: 499, column: 44, scope: !1282)
!1286 = !DILocation(line: 499, column: 48, scope: !1282)
!1287 = !DILocation(line: 499, column: 73, scope: !1282)
!1288 = !DILocation(line: 499, column: 83, scope: !1282)
!1289 = !DILocation(line: 499, column: 70, scope: !1282)
!1290 = !DILocation(line: 500, column: 3, scope: !1282)
!1291 = !DILocation(line: 502, column: 14, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1246, file: !31, line: 502, column: 6)
!1293 = !DILocation(line: 502, column: 6, scope: !1292)
!1294 = !DILocation(line: 502, column: 26, scope: !1292)
!1295 = !DILocalVariable(name: "energy_used", scope: !1296, file: !31, line: 503, type: !21)
!1296 = distinct !DILexicalBlock(scope: !1292, file: !31, line: 502, column: 34)
!1297 = !DILocation(line: 503, column: 7, scope: !1296)
!1298 = !DILocation(line: 505, column: 22, scope: !1296)
!1299 = !DILocation(line: 505, column: 20, scope: !1296)
!1300 = !DILocation(line: 506, column: 19, scope: !1296)
!1301 = !DILocation(line: 506, column: 28, scope: !1296)
!1302 = !DILocation(line: 506, column: 16, scope: !1296)
!1303 = !DILocation(line: 507, column: 7, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1296, file: !31, line: 507, column: 7)
!1305 = !DILocation(line: 507, column: 20, scope: !1304)
!1306 = !DILocation(line: 508, column: 17, scope: !1304)
!1307 = !DILocation(line: 508, column: 4, scope: !1304)
!1308 = !DILocation(line: 510, column: 18, scope: !1296)
!1309 = !DILocation(line: 510, column: 33, scope: !1296)
!1310 = !DILocation(line: 510, column: 31, scope: !1296)
!1311 = !DILocation(line: 510, column: 16, scope: !1296)
!1312 = !DILocation(line: 512, column: 37, scope: !1296)
!1313 = !DILocation(line: 512, column: 17, scope: !1296)
!1314 = !DILocation(line: 512, column: 15, scope: !1296)
!1315 = !DILocation(line: 513, column: 7, scope: !1316)
!1316 = distinct !DILexicalBlock(scope: !1296, file: !31, line: 513, column: 7)
!1317 = !DILocation(line: 513, column: 24, scope: !1316)
!1318 = !DILocation(line: 514, column: 25, scope: !1316)
!1319 = !DILocation(line: 514, column: 42, scope: !1316)
!1320 = !DILocation(line: 514, column: 58, scope: !1316)
!1321 = !DILocation(line: 514, column: 38, scope: !1316)
!1322 = !DILocation(line: 514, column: 61, scope: !1316)
!1323 = !DILocation(line: 514, column: 18, scope: !1316)
!1324 = !DILocation(line: 514, column: 16, scope: !1316)
!1325 = !DILocation(line: 514, column: 4, scope: !1316)
!1326 = !DILocation(line: 516, column: 33, scope: !1296)
!1327 = !DILocation(line: 516, column: 11, scope: !1296)
!1328 = !DILocation(line: 516, column: 3, scope: !1296)
!1329 = !DILocation(line: 516, column: 23, scope: !1296)
!1330 = !DILocation(line: 516, column: 30, scope: !1296)
!1331 = !DILocation(line: 517, column: 15, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1296, file: !31, line: 517, column: 7)
!1333 = !DILocation(line: 517, column: 7, scope: !1332)
!1334 = !DILocation(line: 517, column: 27, scope: !1332)
!1335 = !DILocation(line: 517, column: 34, scope: !1332)
!1336 = !DILocation(line: 518, column: 12, scope: !1332)
!1337 = !DILocation(line: 518, column: 4, scope: !1332)
!1338 = !DILocation(line: 518, column: 24, scope: !1332)
!1339 = !DILocation(line: 518, column: 31, scope: !1332)
!1340 = !DILocation(line: 519, column: 2, scope: !1296)
!1341 = !DILocation(line: 520, column: 1, scope: !1246)
!1342 = distinct !DISubprogram(name: "i2f", linkageName: "_Z3i2fi", scope: !22, file: !22, line: 49, type: !1343, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !320)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!21, !7}
