; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/ai.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/ai.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.ai_local = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [10 x %struct.vms_angvec], [10 x %struct.vms_angvec], [10 x i8], [10 x i8] }
%struct.vms_angvec = type { i16, i16, i16 }
%struct.point_seg = type { i32, %struct.vms_vector }
%struct.vms_vector = type { i32, i32, i32 }
%struct.ai_cloak_info = type { i32, i32, %struct.vms_vector }
%struct.fvi_info = type { i32, %struct.vms_vector, i32, i32, i32, i32, %struct.vms_vector, i32, [100 x i32] }
%struct.awareness_event = type { i16, i16, %struct.vms_vector }
%struct.player = type { [9 x i8], [4 x i8], i16, i8, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i16, i16, i16, [10 x i16], [10 x i16], i16, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i32, i8, i8 }
%struct.control_info = type { i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.segment = type { [6 x %struct.side], [6 x i16], [8 x i16], i32 }
%struct.side = type { i8, i8, i16, i16, i16, [4 x %struct.uvl], [2 x %struct.vms_vector] }
%struct.uvl = type { i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Ai_initialized", scope: !2, file: !20, line: 74, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !17, imports: !434, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "/Users/richard/code/ChocolateDescent/main_d2/ai.cpp", directory: "/Users/richard/code/ChocolateDescent/build-c-ref", checksumkind: CSK_MD5, checksum: "ab686873ed81952092c0ae51181ff912")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LogicVer", file: !6, line: 56, baseType: !7, size: 32, flags: DIFlagEnumClass, elements: !8, identifier: "_ZTS8LogicVer")
!6 = !DIFile(filename: "main_d2/inferno.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "f9bd7760bcc54609c0547a3a7ca7ee90")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "SHAREWARE", value: 0)
!10 = !DIEnumerator(name: "FULL_1_0", value: 1)
!11 = !DIEnumerator(name: "FULL_1_1", value: 2)
!12 = !DIEnumerator(name: "FULL_1_2", value: 3)
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !15, line: 30, baseType: !16)
!15 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!16 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!17 = !{!0, !18, !21, !69, !85, !88, !100, !102, !107, !109, !111, !113, !115, !117, !119, !121, !123, !125, !127, !129, !131, !133, !139, !141, !143, !145, !147, !149, !151, !153, !155, !157, !159, !161, !163, !165, !183, !185, !196, !198, !200, !207, !212, !217, !220, !222, !224, !226, !228, !230, !232, !234, !237, !239, !241, !243, !245, !250, !252, !258, !262, !267, !272, !274, !279, !281, !283, !285, !290, !295, !298, !303, !308, !313, !318, !323, !325, !330, !335, !337, !342, !347, !349, !351, !410, !415, !419, !421, !426, !431}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "Overall_agitation", scope: !2, file: !20, line: 75, type: !7, isLocal: false, isDefinition: true)
!20 = !DIFile(filename: "main_d2/ai.cpp", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "ab686873ed81952092c0ae51181ff912")
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "Ai_local_info", scope: !2, file: !20, line: 76, type: !23, isLocal: false, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 560000, elements: !67)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ai_local", file: !25, line: 173, baseType: !26)
!25 = !DIFile(filename: "main_d2/aistruct.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d122430e792a0ddc0f9eaa08ad217628")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ai_local", file: !25, line: 147, size: 1600, flags: DIFlagTypePassByValue, elements: !27, identifier: "_ZTS8ai_local")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !40, !41, !42, !43, !44, !45, !46, !47, !60, !61, !66}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "player_awareness_type", scope: !26, file: !25, line: 151, baseType: !7, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "retry_count", scope: !26, file: !25, line: 152, baseType: !7, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "consecutive_retries", scope: !26, file: !25, line: 153, baseType: !7, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !26, file: !25, line: 154, baseType: !7, size: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "previous_visibility", scope: !26, file: !25, line: 155, baseType: !7, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "rapidfire_count", scope: !26, file: !25, line: 156, baseType: !7, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "goal_segment", scope: !26, file: !25, line: 157, baseType: !7, size: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next_action_time", scope: !26, file: !25, line: 161, baseType: !36, size: 32, offset: 224)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "fix", file: !37, line: 20, baseType: !38)
!37 = !DIFile(filename: "./fix/fix.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c5006a11bf8b4cb7d963898499eda13a")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !39, line: 30, baseType: !7)
!39 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next_fire", scope: !26, file: !25, line: 162, baseType: !36, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "next_fire2", scope: !26, file: !25, line: 163, baseType: !36, size: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "player_awareness_time", scope: !26, file: !25, line: 164, baseType: !36, size: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "time_player_seen", scope: !26, file: !25, line: 165, baseType: !36, size: 32, offset: 352)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "time_player_sound_attacked", scope: !26, file: !25, line: 166, baseType: !36, size: 32, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next_misc_sound_time", scope: !26, file: !25, line: 167, baseType: !36, size: 32, offset: 416)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "time_since_processed", scope: !26, file: !25, line: 168, baseType: !36, size: 32, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "goal_angles", scope: !26, file: !25, line: 169, baseType: !48, size: 480, offset: 480)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 480, elements: !58)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_angvec", file: !50, line: 40, baseType: !51)
!50 = !DIFile(filename: "./vecmat/vecmat.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "dfa84e3325c1ea4f5f74699fff5ef2bf")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_angvec", file: !50, line: 37, size: 48, flags: DIFlagTypePassByValue, elements: !52, identifier: "_ZTS10vms_angvec")
!52 = !{!53, !56, !57}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !51, file: !50, line: 39, baseType: !54, size: 16)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixang", file: !37, line: 21, baseType: !55)
!55 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !51, file: !50, line: 39, baseType: !54, size: 16, offset: 16)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !51, file: !50, line: 39, baseType: !54, size: 16, offset: 32)
!58 = !{!59}
!59 = !DISubrange(count: 10)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "delta_angles", scope: !26, file: !25, line: 170, baseType: !48, size: 480, offset: 960)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "goal_state", scope: !26, file: !25, line: 171, baseType: !62, size: 80, offset: 1440)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 80, elements: !58)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !64, line: 30, baseType: !65)
!64 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!65 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "achieved_state", scope: !26, file: !25, line: 172, baseType: !62, size: 80, offset: 1520)
!67 = !{!68}
!68 = !DISubrange(count: 350)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "Point_segs", scope: !2, file: !20, line: 77, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 320000, elements: !83)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "point_seg", file: !25, line: 178, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 175, size: 128, flags: DIFlagTypePassByValue, elements: !74, identifier: "_ZTS9point_seg")
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !73, file: !25, line: 176, baseType: !7, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "point", scope: !73, file: !25, line: 177, baseType: !77, size: 96, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_vector", file: !50, line: 22, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_vector", file: !50, line: 19, size: 96, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTS10vms_vector")
!79 = !{!80, !81, !82}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !78, file: !50, line: 21, baseType: !36, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !78, file: !50, line: 21, baseType: !36, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !78, file: !50, line: 21, baseType: !36, size: 32, offset: 64)
!83 = !{!84}
!84 = !DISubrange(count: 2500)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "Point_segs_free_ptr", scope: !2, file: !20, line: 78, type: !87, isLocal: false, isDefinition: true)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "Ai_cloak_info", scope: !2, file: !20, line: 79, type: !90, isLocal: false, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 1280, elements: !98)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "ai_cloak_info", file: !92, line: 137, baseType: !93)
!92 = !DIFile(filename: "main_d2/ai.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c3b19557982e3be343af585a29fb965b")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 132, size: 160, flags: DIFlagTypePassByValue, elements: !94, identifier: "_ZTS13ai_cloak_info")
!94 = !{!95, !96, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !93, file: !92, line: 134, baseType: !36, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "last_segment", scope: !93, file: !92, line: 135, baseType: !7, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "last_position", scope: !93, file: !92, line: 136, baseType: !77, size: 96, offset: 64)
!98 = !{!99}
!99 = !DISubrange(count: 8)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "Boss_cloak_start_time", scope: !2, file: !20, line: 80, type: !36, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "New_awareness", scope: !2, file: !20, line: 81, type: !104, isLocal: false, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 7200, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 900)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "Boss_cloak_end_time", scope: !2, file: !20, line: 82, type: !36, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "Last_teleport_time", scope: !2, file: !20, line: 83, type: !36, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "Boss_teleport_interval", scope: !2, file: !20, line: 84, type: !36, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "Boss_cloak_interval", scope: !2, file: !20, line: 85, type: !36, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "Boss_cloak_duration", scope: !2, file: !20, line: 86, type: !36, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "Last_gate_time", scope: !2, file: !20, line: 87, type: !36, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "Gate_interval", scope: !2, file: !20, line: 88, type: !36, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "Boss_dying_start_time", scope: !2, file: !20, line: 89, type: !36, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "Boss_hit_time", scope: !2, file: !20, line: 90, type: !36, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "Boss_dying", scope: !2, file: !20, line: 91, type: !63, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "Boss_dying_sound_playing", scope: !2, file: !20, line: 91, type: !63, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "unused123", scope: !2, file: !20, line: 91, type: !63, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "unused234", scope: !2, file: !20, line: 91, type: !63, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "Boss_teleports", scope: !2, file: !20, line: 101, type: !135, isLocal: false, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 64, elements: !98)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !137, line: 31, baseType: !138)
!137 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!138 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "Boss_spew_more", scope: !2, file: !20, line: 102, type: !135, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "Boss_spews_bots_energy", scope: !2, file: !20, line: 103, type: !135, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "Boss_spews_bots_matter", scope: !2, file: !20, line: 104, type: !135, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "Boss_invulnerable_energy", scope: !2, file: !20, line: 105, type: !135, isLocal: false, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "Boss_invulnerable_matter", scope: !2, file: !20, line: 106, type: !135, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "Boss_invulnerable_spot", scope: !2, file: !20, line: 107, type: !135, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "ai_evaded", scope: !2, file: !20, line: 109, type: !7, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "Robot_firing_enabled", scope: !2, file: !20, line: 113, type: !7, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "Animation_enabled", scope: !2, file: !20, line: 114, type: !7, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "Ai_info_enabled", scope: !2, file: !20, line: 117, type: !7, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "Hit_pos", scope: !2, file: !20, line: 123, type: !77, isLocal: false, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "Hit_type", scope: !2, file: !20, line: 124, type: !7, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "Hit_seg", scope: !2, file: !20, line: 124, type: !7, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "Hit_data", scope: !2, file: !20, line: 125, type: !167, isLocal: false, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "fvi_info", file: !168, line: 40, baseType: !169)
!168 = !DIFile(filename: "main_d2/fvi.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d2a92d1b0ff4ebfc1a57eff3c7d6fa46")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fvi_info", file: !168, line: 29, size: 3584, flags: DIFlagTypePassByValue, elements: !170, identifier: "_ZTS8fvi_info")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "hit_type", scope: !169, file: !168, line: 31, baseType: !7, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "hit_pnt", scope: !169, file: !168, line: 32, baseType: !77, size: 96, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "hit_seg", scope: !169, file: !168, line: 33, baseType: !7, size: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "hit_side", scope: !169, file: !168, line: 34, baseType: !7, size: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "hit_side_seg", scope: !169, file: !168, line: 35, baseType: !7, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "hit_object", scope: !169, file: !168, line: 36, baseType: !7, size: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "hit_wallnorm", scope: !169, file: !168, line: 37, baseType: !77, size: 96, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "n_segs", scope: !169, file: !168, line: 38, baseType: !7, size: 32, offset: 352)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "seglist", scope: !169, file: !168, line: 39, baseType: !180, size: 3200, offset: 384)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3200, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 100)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "Num_awareness_events", scope: !2, file: !20, line: 127, type: !7, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "Awareness_events", scope: !2, file: !20, line: 128, type: !187, isLocal: false, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 8192, elements: !194)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "awareness_event", file: !92, line: 154, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "awareness_event", file: !92, line: 150, size: 128, flags: DIFlagTypePassByValue, elements: !190, identifier: "_ZTS15awareness_event")
!190 = !{!191, !192, !193}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !189, file: !92, line: 151, baseType: !55, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !92, line: 152, baseType: !55, size: 16, offset: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !189, file: !92, line: 153, baseType: !77, size: 96, offset: 32)
!194 = !{!195}
!195 = !DISubrange(count: 64)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "Believed_player_pos", scope: !2, file: !20, line: 130, type: !77, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "Believed_player_seg", scope: !2, file: !20, line: 131, type: !7, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !20, line: 136, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 48, elements: !205)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!205 = !{!206}
!206 = !DISubrange(count: 6)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !20, line: 137, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 56, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 7)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !20, line: 138, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 72, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 9)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !20, line: 139, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 80, elements: !58)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !20, line: 140, type: !214, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !20, line: 141, type: !209, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !20, line: 142, type: !219, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !20, line: 143, type: !219, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !20, line: 144, type: !214, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !20, line: 145, type: !214, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !20, line: 146, type: !209, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !20, line: 147, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 64, elements: !98)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !20, line: 148, type: !236, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !20, line: 149, type: !236, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !20, line: 150, type: !236, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !20, line: 151, type: !219, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !20, line: 152, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 88, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 11)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !20, line: 153, type: !236, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "mode_text", scope: !2, file: !20, line: 135, type: !254, isLocal: false, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 1152, elements: !256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!256 = !{!257}
!257 = !DISubrange(count: 18)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "behavior_text", scope: !2, file: !20, line: 158, type: !260, isLocal: false, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 432, elements: !261)
!261 = !{!206, !216}
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "state_text", scope: !2, file: !20, line: 168, type: !264, isLocal: false, isDefinition: true)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 320, elements: !265)
!265 = !{!99, !266}
!266 = !DISubrange(count: 5)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "Ai_transition_table", scope: !2, file: !20, line: 189, type: !269, isLocal: false, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 1568, elements: !270)
!270 = !{!271, !211, !211}
!271 = !DISubrange(count: 4)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "Dist_to_last_fired_upon_player_pos", scope: !2, file: !20, line: 239, type: !36, isLocal: false, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !20, line: 319, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 304, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 38)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !20, line: 327, type: !276, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "Ai_last_missile_camera", scope: !2, file: !20, line: 331, type: !7, isLocal: false, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "Robots_kill_robots_cheat", scope: !2, file: !20, line: 333, type: !7, isLocal: false, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !20, line: 916, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 256, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 32)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !20, line: 916, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 416, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 52)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !20, line: 951, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 144, elements: !256)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !20, line: 952, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 192, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 24)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1114, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 272, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 34)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1247, type: !310, isLocal: true, isDefinition: true)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 352, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 44)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1287, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 16, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 2)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1377, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 312, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 39)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1381, type: !276, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1778, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 184, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 23)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1817, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 368, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 46)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1840, type: !320, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1841, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 232, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 29)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1842, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 208, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 26)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !20, line: 1953, type: !287, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "Ai_dump_enable", scope: !2, file: !20, line: 2125, type: !7, isLocal: false, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "Ai_dump_file", scope: !2, file: !20, line: 2127, type: !353, isLocal: false, isDefinition: true)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !355, line: 162, baseType: !356)
!355 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "d91ebd7d161d9196cc100822ef0e5cdf")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !355, line: 131, size: 1216, flags: DIFlagTypePassByValue, elements: !357, identifier: "_ZTS7__sFILE")
!357 = !{!358, !360, !361, !362, !363, !364, !369, !370, !372, !376, !381, !390, !394, !395, !398, !399, !403, !407, !408, !409}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !356, file: !355, line: 132, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !356, file: !355, line: 133, baseType: !7, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !356, file: !355, line: 134, baseType: !7, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !356, file: !355, line: 135, baseType: !55, size: 16, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !356, file: !355, line: 136, baseType: !55, size: 16, offset: 144)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !356, file: !355, line: 137, baseType: !365, size: 128, offset: 192)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !355, line: 97, size: 128, flags: DIFlagTypePassByValue, elements: !366, identifier: "_ZTS6__sbuf")
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !365, file: !355, line: 98, baseType: !359, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !365, file: !355, line: 99, baseType: !7, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !356, file: !355, line: 138, baseType: !7, size: 32, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !356, file: !355, line: 141, baseType: !371, size: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !356, file: !355, line: 142, baseType: !373, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!7, !371}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !356, file: !355, line: 143, baseType: !377, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!7, !371, !380, !7}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !356, file: !355, line: 144, baseType: !382, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!385, !371, !385, !7}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !355, line: 86, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !387, line: 83, baseType: !388)
!387 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "af82ff6119a9fa80fad635d276556d46")
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !389, line: 37, baseType: !16)
!389 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !356, file: !355, line: 145, baseType: !391, size: 64, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!7, !371, !255, !7}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !356, file: !355, line: 148, baseType: !365, size: 128, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !356, file: !355, line: 149, baseType: !396, size: 64, offset: 832)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !355, line: 103, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS8__sFILEX")
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !356, file: !355, line: 150, baseType: !7, size: 32, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !356, file: !355, line: 153, baseType: !400, size: 24, offset: 928)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 24, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 3)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !356, file: !355, line: 154, baseType: !404, size: 8, offset: 952)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 8, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 1)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !356, file: !355, line: 157, baseType: !365, size: 128, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !356, file: !355, line: 160, baseType: !7, size: 32, offset: 1088)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !356, file: !355, line: 161, baseType: !385, size: 64, offset: 1152)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "Ai_error_message", scope: !2, file: !20, line: 2129, type: !412, isLocal: false, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 1024, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 128)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !20, line: 2140, type: !417, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 32, elements: !418)
!418 = !{!271}
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !20, line: 2394, type: !292, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !20, line: 2396, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 392, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 49)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !20, line: 2415, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 528, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 66)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!432 = distinct !DIGlobalVariable(name: "FRACBITS", scope: !2, file: !37, line: 18, type: !433, isLocal: true, isDefinition: true)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!434 = !{!435, !439, !442, !443, !444, !445, !449, !453, !457, !460, !462, !464, !466, !468, !470, !472, !474, !476, !478, !480, !482, !484, !486, !488, !490, !495, !499, !502, !505, !510, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !547, !552, !557, !562, !564, !567, !569, !571, !573, !575, !577, !579, !581, !583, !585, !589, !593, !597, !599, !603, !607, !617, !632, !633, !634, !642, !644, !652, !658, !662, !666, !668, !672, !676, !680, !684, !688, !692, !694, !696, !700, !706, !711, !715, !719, !723, !727, !731, !735, !739, !741, !743, !747, !749, !753, !757, !762, !764, !766, !768, !772, !776, !780, !782, !786, !788, !790, !792, !794, !800, !804, !806, !812, !817, !821, !825, !830, !835, !839, !843, !847, !851, !853, !855, !863, !869, !875, !879, !883, !887, !891, !896, !900, !904, !908, !912, !916, !920, !924, !928, !933, !937, !941, !945, !950, !955, !959, !961, !965, !967, !976, !980, !985, !989, !993, !997, !1001, !1003, !1007, !1011, !1015, !1019, !1023, !1025, !1027, !1029, !1037, !1039, !1041, !1043, !1049, !1051, !1052, !1053, !1054, !1057, !1059, !1060, !1064, !1066, !1068, !1072, !1074, !1076, !1078, !1080, !1082, !1084, !1086, !1091, !1095, !1097, !1099, !1100, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1141, !1143, !1145, !1147, !1151, !1153, !1157, !1159, !1161, !1163, !1165, !1169, !1171, !1173, !1177, !1179, !1181, !1185, !1187, !1191, !1193, !1195, !1199, !1201, !1203, !1205, !1207, !1209, !1211, !1215, !1217, !1219, !1221, !1223, !1225, !1227, !1229, !1233, !1237, !1239, !1241, !1243, !1245, !1247, !1249, !1251, !1253, !1255, !1257, !1259, !1261, !1263, !1265, !1267, !1269, !1271, !1273, !1275, !1279, !1281, !1283, !1285, !1289, !1291, !1295, !1297, !1299, !1301, !1303, !1307, !1309, !1313, !1315, !1317, !1319, !1321, !1325, !1327, !1329, !1333, !1335, !1337, !1339, !1345, !1347, !1351, !1355, !1357, !1359, !1363, !1367, !1371, !1373, !1377, !1382, !1386, !1390, !1392, !1394, !1396, !1398, !1400, !1402, !1406, !1410, !1415, !1420, !1424, !1425, !1429, !1433, !1438, !1443, !1447, !1453, !1457, !1459, !1463, !1465, !1466, !1470, !1472, !1476, !1480, !1484, !1486, !1490, !1494, !1498, !1504, !1506, !1510, !1514, !1518, !1520, !1524, !1528, !1532, !1534, !1536, !1538, !1542, !1546, !1551, !1555, !1561, !1565, !1569, !1571, !1573, !1575, !1579, !1583, !1587, !1589, !1591, !1595, !1599, !1601, !1605, !1609, !1612, !1614, !1616, !1618, !1647, !1652, !1657}
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !63, file: !438, line: 158)
!436 = !DINamespace(name: "__1", scope: !437, exportSymbols: true)
!437 = !DINamespace(name: "std", scope: null)
!438 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdint", directory: "")
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !440, file: !438, line: 159)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !441, line: 30, baseType: !55)
!441 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !38, file: !438, line: 160)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !14, file: !438, line: 161)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !136, file: !438, line: 163)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !446, file: !438, line: 164)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !447, line: 31, baseType: !448)
!447 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!448 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !450, file: !438, line: 165)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !451, line: 31, baseType: !452)
!451 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!452 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !454, file: !438, line: 166)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !455, line: 31, baseType: !456)
!455 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!456 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !458, file: !438, line: 168)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !459, line: 29, baseType: !63)
!459 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !461, file: !438, line: 169)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !459, line: 30, baseType: !440)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !463, file: !438, line: 170)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !459, line: 31, baseType: !38)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !465, file: !438, line: 171)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !459, line: 32, baseType: !14)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !467, file: !438, line: 173)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !459, line: 33, baseType: !136)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !469, file: !438, line: 174)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !459, line: 34, baseType: !446)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !471, file: !438, line: 175)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !459, line: 35, baseType: !450)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !473, file: !438, line: 176)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !459, line: 36, baseType: !454)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !475, file: !438, line: 178)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !459, line: 40, baseType: !63)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !477, file: !438, line: 179)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !459, line: 41, baseType: !440)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !479, file: !438, line: 180)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !459, line: 42, baseType: !38)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !481, file: !438, line: 181)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !459, line: 43, baseType: !14)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !483, file: !438, line: 183)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !459, line: 44, baseType: !136)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !485, file: !438, line: 184)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !459, line: 45, baseType: !446)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !487, file: !438, line: 185)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !459, line: 46, baseType: !450)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !489, file: !438, line: 186)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !459, line: 47, baseType: !454)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !491, file: !438, line: 188)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !492, line: 32, baseType: !493)
!492 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !389, line: 40, baseType: !494)
!494 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !496, file: !438, line: 189)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !497, line: 34, baseType: !498)
!497 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!498 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !500, file: !438, line: 191)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !501, line: 32, baseType: !494)
!501 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !503, file: !438, line: 192)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !504, line: 32, baseType: !498)
!504 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !506, file: !509, line: 22)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !507, line: 16, baseType: !508)
!507 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/lib/clang/20/include/__stddef_max_align_t.h", directory: "", checksumkind: CSK_MD5, checksum: "3c0a2f19d136d39aa835c737c7105def")
!508 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!509 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/__cstddef/max_align_t.h", directory: "")
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !511, file: !515, line: 113)
!511 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !512, file: !512, line: 217, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!512 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "b10215117a277691ffc4168ac4505796")
!513 = !DISubroutineType(types: !514)
!514 = !{!7, !7}
!515 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cctype", directory: "")
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !517, file: !515, line: 114)
!517 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !512, file: !512, line: 223, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !519, file: !515, line: 115)
!519 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !512, file: !512, line: 229, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !521, file: !515, line: 116)
!521 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !512, file: !512, line: 235, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !523, file: !515, line: 117)
!523 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !512, file: !512, line: 242, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !525, file: !515, line: 118)
!525 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !512, file: !512, line: 248, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !527, file: !515, line: 119)
!527 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !512, file: !512, line: 254, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !529, file: !515, line: 120)
!529 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !512, file: !512, line: 260, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !531, file: !515, line: 121)
!531 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !512, file: !512, line: 266, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !533, file: !515, line: 122)
!533 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !512, file: !512, line: 272, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !535, file: !515, line: 123)
!535 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !512, file: !512, line: 278, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !537, file: !515, line: 124)
!537 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !512, file: !512, line: 285, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !539, file: !515, line: 125)
!539 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !512, file: !512, line: 297, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !541, file: !515, line: 126)
!541 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !512, file: !512, line: 303, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !543, file: !546, line: 75)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !544, line: 32, baseType: !545)
!544 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "6dfd3a3d5009054224653c03b2c2b6ac")
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !389, line: 111, baseType: !7)
!546 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwctype", directory: "")
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !548, file: !546, line: 76)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !549, line: 32, baseType: !550)
!549 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctrans_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70040c8494301cc74e19df26f4c1d76")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !551, line: 44, baseType: !7)
!551 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "c789da493a5b476a3618b20a8fcff3c3")
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !553, file: !546, line: 77)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !554, line: 32, baseType: !555)
!554 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_wctype_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8d1720b82a490c742e6a297f971be2a2")
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !551, line: 46, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !389, line: 36, baseType: !452)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !558, file: !546, line: 78)
!558 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !559, file: !559, line: 84, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/___wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "d5a8bf0b4062c20bda4d49376e5b44d9")
!560 = !DISubroutineType(types: !561)
!561 = !{!7, !543}
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !563, file: !546, line: 79)
!563 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !559, file: !559, line: 90, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !565, file: !546, line: 80)
!565 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !566, file: !566, line: 53, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wctype.h", directory: "", checksumkind: CSK_MD5, checksum: "6bc93063cb32b00d3df790305c546a93")
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !568, file: !546, line: 81)
!568 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !559, file: !559, line: 96, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !570, file: !546, line: 82)
!570 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !559, file: !559, line: 108, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !572, file: !546, line: 83)
!572 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !559, file: !559, line: 114, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !574, file: !546, line: 84)
!574 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !559, file: !559, line: 120, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !576, file: !546, line: 85)
!576 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !559, file: !559, line: 126, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !578, file: !546, line: 86)
!578 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !559, file: !559, line: 132, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !580, file: !546, line: 87)
!580 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !559, file: !559, line: 138, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !582, file: !546, line: 88)
!582 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !559, file: !559, line: 144, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !584, file: !546, line: 89)
!584 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !559, file: !559, line: 150, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !586, file: !546, line: 90)
!586 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !559, file: !559, line: 102, type: !587, flags: DIFlagPrototyped, spFlags: 0)
!587 = !DISubroutineType(types: !588)
!588 = !{!7, !543, !553}
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !590, file: !546, line: 91)
!590 = !DISubprogram(name: "wctype", scope: !559, file: !559, line: 190, type: !591, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DISubroutineType(types: !592)
!592 = !{!553, !255}
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !594, file: !546, line: 92)
!594 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !559, file: !559, line: 156, type: !595, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DISubroutineType(types: !596)
!596 = !{!543, !543}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !598, file: !546, line: 93)
!598 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !559, file: !559, line: 162, type: !595, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !600, file: !546, line: 94)
!600 = !DISubprogram(name: "towctrans", scope: !566, file: !566, line: 124, type: !601, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DISubroutineType(types: !602)
!602 = !{!543, !543, !548}
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !604, file: !546, line: 95)
!604 = !DISubprogram(name: "wctrans", scope: !566, file: !566, line: 126, type: !605, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DISubroutineType(types: !606)
!606 = !{!548, !255}
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !608, file: !616, line: 133)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !609, line: 32, baseType: !610)
!609 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8f920c8f4b68eb07504db5a6777c5466")
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !389, line: 72, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !389, line: 70, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !389, line: 67, size: 1024, flags: DIFlagTypePassByValue, elements: !613, identifier: "_ZTS11__mbstate_t")
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !612, file: !389, line: 68, baseType: !412, size: 1024)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !612, file: !389, line: 69, baseType: !16, size: 64)
!616 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cwchar", directory: "")
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !618, file: !616, line: 134)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !619, line: 78, size: 448, flags: DIFlagTypePassByValue, elements: !620, identifier: "_ZTS2tm")
!619 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_time.h", directory: "", checksumkind: CSK_MD5, checksum: "e65eafd533c28a52a9094e430476b03e")
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !618, file: !619, line: 79, baseType: !7, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !618, file: !619, line: 80, baseType: !7, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !618, file: !619, line: 81, baseType: !7, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !618, file: !619, line: 82, baseType: !7, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !618, file: !619, line: 83, baseType: !7, size: 32, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !618, file: !619, line: 84, baseType: !7, size: 32, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !618, file: !619, line: 85, baseType: !7, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !618, file: !619, line: 86, baseType: !7, size: 32, offset: 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !618, file: !619, line: 87, baseType: !7, size: 32, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !618, file: !619, line: 88, baseType: !494, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !618, file: !619, line: 89, baseType: !380, size: 64, offset: 384)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !543, file: !616, line: 135)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !354, file: !616, line: 136)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !635, file: !616, line: 137)
!635 = !DISubprogram(name: "fwprintf", scope: !636, file: !636, line: 107, type: !637, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c0db33314388059ce7a1663adf1bfda0")
!637 = !DISubroutineType(types: !638)
!638 = !{!7, !353, !639, null}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !641)
!641 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !643, file: !616, line: 138)
!643 = !DISubprogram(name: "fwscanf", scope: !636, file: !636, line: 108, type: !637, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !645, file: !616, line: 139)
!645 = !DISubprogram(name: "swprintf", scope: !636, file: !636, line: 120, type: !646, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DISubroutineType(types: !647)
!647 = !{!7, !648, !649, !639, null}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !650, line: 50, baseType: !651)
!650 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f7981334d28e0c246f35cd24042aa2a4")
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_size_t", file: !389, line: 87, baseType: !498)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !653, file: !616, line: 140)
!653 = !DISubprogram(name: "vfwprintf", scope: !636, file: !636, line: 124, type: !654, flags: DIFlagPrototyped, spFlags: 0)
!654 = !DISubroutineType(types: !655)
!655 = !{!7, !353, !639, !656}
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_va_list", file: !389, line: 95, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !20, baseType: !380)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !659, file: !616, line: 141)
!659 = !DISubprogram(name: "vswprintf", scope: !636, file: !636, line: 126, type: !660, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DISubroutineType(types: !661)
!661 = !{!7, !648, !649, !639, !656}
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !663, file: !616, line: 142)
!663 = !DISubprogram(name: "swscanf", scope: !636, file: !636, line: 122, type: !664, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DISubroutineType(types: !665)
!665 = !{!7, !639, !639, null}
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !667, file: !616, line: 143)
!667 = !DISubprogram(name: "vfwscanf", scope: !636, file: !636, line: 195, type: !654, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !669, file: !616, line: 144)
!669 = !DISubprogram(name: "vswscanf", scope: !636, file: !636, line: 197, type: !670, flags: DIFlagPrototyped, spFlags: 0)
!670 = !DISubroutineType(types: !671)
!671 = !{!7, !639, !639, !656}
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !673, file: !616, line: 145)
!673 = !DISubprogram(name: "fgetwc", scope: !636, file: !636, line: 100, type: !674, flags: DIFlagPrototyped, spFlags: 0)
!674 = !DISubroutineType(types: !675)
!675 = !{!543, !353}
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !677, file: !616, line: 146)
!677 = !DISubprogram(name: "fgetws", scope: !636, file: !636, line: 102, type: !678, flags: DIFlagPrototyped, spFlags: 0)
!678 = !DISubroutineType(types: !679)
!679 = !{!648, !648, !7, !353}
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !681, file: !616, line: 147)
!681 = !DISubprogram(name: "fputwc", scope: !636, file: !636, line: 104, type: !682, flags: DIFlagPrototyped, spFlags: 0)
!682 = !DISubroutineType(types: !683)
!683 = !{!543, !641, !353}
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !685, file: !616, line: 148)
!685 = !DISubprogram(name: "fputws", scope: !636, file: !636, line: 105, type: !686, flags: DIFlagPrototyped, spFlags: 0)
!686 = !DISubroutineType(types: !687)
!687 = !{!7, !639, !353}
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !689, file: !616, line: 149)
!689 = !DISubprogram(name: "fwide", scope: !636, file: !636, line: 106, type: !690, flags: DIFlagPrototyped, spFlags: 0)
!690 = !DISubroutineType(types: !691)
!691 = !{!7, !353, !7}
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !693, file: !616, line: 150)
!693 = !DISubprogram(name: "getwc", scope: !636, file: !636, line: 109, type: !674, flags: DIFlagPrototyped, spFlags: 0)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !695, file: !616, line: 151)
!695 = !DISubprogram(name: "putwc", scope: !636, file: !636, line: 118, type: !682, flags: DIFlagPrototyped, spFlags: 0)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !697, file: !616, line: 152)
!697 = !DISubprogram(name: "ungetwc", scope: !636, file: !636, line: 123, type: !698, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DISubroutineType(types: !699)
!699 = !{!543, !543, !353}
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !701, file: !616, line: 153)
!701 = !DISubprogram(name: "wcstod", scope: !636, file: !636, line: 160, type: !702, flags: DIFlagPrototyped, spFlags: 0)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !639, !705}
!704 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !707, file: !616, line: 154)
!707 = !DISubprogram(name: "wcstof", scope: !636, file: !636, line: 200, type: !708, flags: DIFlagPrototyped, spFlags: 0)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !639, !705}
!710 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !712, file: !616, line: 155)
!712 = !DISubprogram(name: "wcstold", scope: !636, file: !636, line: 202, type: !713, flags: DIFlagPrototyped, spFlags: 0)
!713 = !DISubroutineType(types: !714)
!714 = !{!508, !639, !705}
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !716, file: !616, line: 156)
!716 = !DISubprogram(name: "wcstol", scope: !636, file: !636, line: 164, type: !717, flags: DIFlagPrototyped, spFlags: 0)
!717 = !DISubroutineType(types: !718)
!718 = !{!494, !639, !705, !7}
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !720, file: !616, line: 157)
!720 = !DISubprogram(name: "wcstoll", scope: !636, file: !636, line: 205, type: !721, flags: DIFlagPrototyped, spFlags: 0)
!721 = !DISubroutineType(types: !722)
!722 = !{!16, !639, !705, !7}
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !724, file: !616, line: 158)
!724 = !DISubprogram(name: "wcstoul", scope: !636, file: !636, line: 167, type: !725, flags: DIFlagPrototyped, spFlags: 0)
!725 = !DISubroutineType(types: !726)
!726 = !{!498, !639, !705, !7}
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !728, file: !616, line: 159)
!728 = !DISubprogram(name: "wcstoull", scope: !636, file: !636, line: 207, type: !729, flags: DIFlagPrototyped, spFlags: 0)
!729 = !DISubroutineType(types: !730)
!730 = !{!456, !639, !705, !7}
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !732, file: !616, line: 160)
!732 = !DISubprogram(name: "wcscpy", scope: !636, file: !636, line: 134, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DISubroutineType(types: !734)
!734 = !{!648, !648, !639}
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !736, file: !616, line: 161)
!736 = !DISubprogram(name: "wcsncpy", scope: !636, file: !636, line: 148, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!648, !648, !639, !649}
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !740, file: !616, line: 162)
!740 = !DISubprogram(name: "wcscat", scope: !636, file: !636, line: 130, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !742, file: !616, line: 163)
!742 = !DISubprogram(name: "wcsncat", scope: !636, file: !636, line: 142, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !744, file: !616, line: 164)
!744 = !DISubprogram(name: "wcscmp", scope: !636, file: !636, line: 132, type: !745, flags: DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{!7, !639, !639}
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !748, file: !616, line: 165)
!748 = !DISubprogram(name: "wcscoll", scope: !636, file: !636, line: 133, type: !745, flags: DIFlagPrototyped, spFlags: 0)
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !750, file: !616, line: 166)
!750 = !DISubprogram(name: "wcsncmp", scope: !636, file: !636, line: 145, type: !751, flags: DIFlagPrototyped, spFlags: 0)
!751 = !DISubroutineType(types: !752)
!752 = !{!7, !639, !639, !649}
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !754, file: !616, line: 167)
!754 = !DISubprogram(name: "wcsxfrm", scope: !636, file: !636, line: 157, type: !755, flags: DIFlagPrototyped, spFlags: 0)
!755 = !DISubroutineType(types: !756)
!756 = !{!649, !648, !639, !649}
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !758, file: !616, line: 168)
!758 = !DISubprogram(name: "wcschr", linkageName: "_Z6wcschrB8ne200100Ua9enable_ifILb1EEPww", scope: !759, file: !759, line: 147, type: !760, flags: DIFlagPrototyped, spFlags: 0)
!759 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/wchar.h", directory: "")
!760 = !DISubroutineType(types: !761)
!761 = !{!648, !648, !641}
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !763, file: !616, line: 169)
!763 = !DISubprogram(name: "wcspbrk", linkageName: "_Z7wcspbrkB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !759, file: !759, line: 158, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !765, file: !616, line: 170)
!765 = !DISubprogram(name: "wcsrchr", linkageName: "_Z7wcsrchrB8ne200100Ua9enable_ifILb1EEPww", scope: !759, file: !759, line: 168, type: !760, flags: DIFlagPrototyped, spFlags: 0)
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !767, file: !616, line: 171)
!767 = !DISubprogram(name: "wcsstr", linkageName: "_Z6wcsstrB8ne200100Ua9enable_ifILb1EEPwPKw", scope: !759, file: !759, line: 179, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !769, file: !616, line: 172)
!769 = !DISubprogram(name: "wmemchr", linkageName: "_Z7wmemchrB8ne200100Ua9enable_ifILb1EEPwwm", scope: !759, file: !759, line: 190, type: !770, flags: DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{!648, !648, !641, !649}
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !773, file: !616, line: 173)
!773 = !DISubprogram(name: "wcscspn", scope: !636, file: !636, line: 136, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!774 = !DISubroutineType(types: !775)
!775 = !{!649, !639, !639}
!776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !777, file: !616, line: 174)
!777 = !DISubprogram(name: "wcslen", scope: !636, file: !636, line: 140, type: !778, flags: DIFlagPrototyped, spFlags: 0)
!778 = !DISubroutineType(types: !779)
!779 = !{!649, !639}
!780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !781, file: !616, line: 175)
!781 = !DISubprogram(name: "wcsspn", scope: !636, file: !636, line: 155, type: !774, flags: DIFlagPrototyped, spFlags: 0)
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !783, file: !616, line: 176)
!783 = !DISubprogram(name: "wcstok", scope: !636, file: !636, line: 162, type: !784, flags: DIFlagPrototyped, spFlags: 0)
!784 = !DISubroutineType(types: !785)
!785 = !{!648, !648, !639, !705}
!786 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !787, file: !616, line: 177)
!787 = !DISubprogram(name: "wmemcmp", scope: !636, file: !636, line: 170, type: !751, flags: DIFlagPrototyped, spFlags: 0)
!788 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !789, file: !616, line: 178)
!789 = !DISubprogram(name: "wmemcpy", scope: !636, file: !636, line: 173, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!790 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !791, file: !616, line: 179)
!791 = !DISubprogram(name: "wmemmove", scope: !636, file: !636, line: 176, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !793, file: !616, line: 180)
!793 = !DISubprogram(name: "wmemset", scope: !636, file: !636, line: 179, type: !770, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !795, file: !616, line: 181)
!795 = !DISubprogram(name: "wcsftime", linkageName: "\01_wcsftime", scope: !636, file: !636, line: 137, type: !796, flags: DIFlagPrototyped, spFlags: 0)
!796 = !DISubroutineType(types: !797)
!797 = !{!649, !648, !649, !639, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !801, file: !616, line: 182)
!801 = !DISubprogram(name: "btowc", scope: !636, file: !636, line: 99, type: !802, flags: DIFlagPrototyped, spFlags: 0)
!802 = !DISubroutineType(types: !803)
!803 = !{!543, !7}
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !805, file: !616, line: 183)
!805 = !DISubprogram(name: "wctob", scope: !636, file: !636, line: 159, type: !560, flags: DIFlagPrototyped, spFlags: 0)
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !807, file: !616, line: 184)
!807 = !DISubprogram(name: "mbsinit", scope: !636, file: !636, line: 115, type: !808, flags: DIFlagPrototyped, spFlags: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{!7, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !813, file: !616, line: 185)
!813 = !DISubprogram(name: "mbrlen", scope: !636, file: !636, line: 111, type: !814, flags: DIFlagPrototyped, spFlags: 0)
!814 = !DISubroutineType(types: !815)
!815 = !{!649, !255, !649, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !818, file: !616, line: 186)
!818 = !DISubprogram(name: "mbrtowc", scope: !636, file: !636, line: 113, type: !819, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DISubroutineType(types: !820)
!820 = !{!649, !648, !255, !649, !816}
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !822, file: !616, line: 187)
!822 = !DISubprogram(name: "wcrtomb", scope: !636, file: !636, line: 129, type: !823, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{!649, !380, !641, !816}
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !826, file: !616, line: 188)
!826 = !DISubprogram(name: "mbsrtowcs", scope: !636, file: !636, line: 116, type: !827, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{!649, !648, !829, !649, !816}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !831, file: !616, line: 189)
!831 = !DISubprogram(name: "wcsrtombs", scope: !636, file: !636, line: 153, type: !832, flags: DIFlagPrototyped, spFlags: 0)
!832 = !DISubroutineType(types: !833)
!833 = !{!649, !380, !834, !649, !816}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !836, file: !616, line: 191)
!836 = !DISubprogram(name: "getwchar", scope: !636, file: !636, line: 110, type: !837, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!543}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !840, file: !616, line: 192)
!840 = !DISubprogram(name: "vwscanf", scope: !636, file: !636, line: 199, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!7, !639, !656}
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !844, file: !616, line: 193)
!844 = !DISubprogram(name: "wscanf", scope: !636, file: !636, line: 181, type: !845, flags: DIFlagPrototyped, spFlags: 0)
!845 = !DISubroutineType(types: !846)
!846 = !{!7, !639, null}
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !848, file: !616, line: 195)
!848 = !DISubprogram(name: "putwchar", scope: !636, file: !636, line: 119, type: !849, flags: DIFlagPrototyped, spFlags: 0)
!849 = !DISubroutineType(types: !850)
!850 = !{!543, !641}
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !852, file: !616, line: 196)
!852 = !DISubprogram(name: "vwprintf", scope: !636, file: !636, line: 128, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !854, file: !616, line: 197)
!854 = !DISubprogram(name: "wprintf", scope: !636, file: !636, line: 180, type: !845, flags: DIFlagPrototyped, spFlags: 0)
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !856, file: !862, line: 106)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !857, line: 105, baseType: !858)
!857 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "17a3e5580239ce2f2af260c9c943ad9b")
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !857, line: 102, size: 64, flags: DIFlagTypePassByValue, elements: !859, identifier: "_ZTS5div_t")
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !858, file: !857, line: 103, baseType: !7, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !858, file: !857, line: 104, baseType: !7, size: 32, offset: 32)
!862 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdlib", directory: "")
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !864, file: !862, line: 107)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !857, line: 110, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !857, line: 107, size: 128, flags: DIFlagTypePassByValue, elements: !866, identifier: "_ZTS6ldiv_t")
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !865, file: !857, line: 108, baseType: !494, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !865, file: !857, line: 109, baseType: !494, size: 64, offset: 64)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !870, file: !862, line: 108)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !857, line: 116, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !857, line: 113, size: 128, flags: DIFlagTypePassByValue, elements: !872, identifier: "_ZTS7lldiv_t")
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !871, file: !857, line: 114, baseType: !16, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !871, file: !857, line: 115, baseType: !16, size: 64, offset: 64)
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !876, file: !862, line: 109)
!876 = !DISubprogram(name: "atof", scope: !857, file: !857, line: 149, type: !877, flags: DIFlagPrototyped, spFlags: 0)
!877 = !DISubroutineType(types: !878)
!878 = !{!704, !255}
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !880, file: !862, line: 110)
!880 = !DISubprogram(name: "atoi", scope: !857, file: !857, line: 150, type: !881, flags: DIFlagPrototyped, spFlags: 0)
!881 = !DISubroutineType(types: !882)
!882 = !{!7, !255}
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !884, file: !862, line: 111)
!884 = !DISubprogram(name: "atol", scope: !857, file: !857, line: 151, type: !885, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DISubroutineType(types: !886)
!886 = !{!494, !255}
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !888, file: !862, line: 112)
!888 = !DISubprogram(name: "atoll", scope: !857, file: !857, line: 154, type: !889, flags: DIFlagPrototyped, spFlags: 0)
!889 = !DISubroutineType(types: !890)
!890 = !{!16, !255}
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !892, file: !862, line: 113)
!892 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !857, file: !857, line: 184, type: !893, flags: DIFlagPrototyped, spFlags: 0)
!893 = !DISubroutineType(types: !894)
!894 = !{!704, !255, !895}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !897, file: !862, line: 114)
!897 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !857, file: !857, line: 185, type: !898, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DISubroutineType(types: !899)
!899 = !{!710, !255, !895}
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !901, file: !862, line: 115)
!901 = !DISubprogram(name: "strtold", scope: !857, file: !857, line: 188, type: !902, flags: DIFlagPrototyped, spFlags: 0)
!902 = !DISubroutineType(types: !903)
!903 = !{!508, !255, !895}
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !905, file: !862, line: 116)
!905 = !DISubprogram(name: "strtol", scope: !857, file: !857, line: 186, type: !906, flags: DIFlagPrototyped, spFlags: 0)
!906 = !DISubroutineType(types: !907)
!907 = !{!494, !255, !895, !7}
!908 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !909, file: !862, line: 117)
!909 = !DISubprogram(name: "strtoll", scope: !857, file: !857, line: 191, type: !910, flags: DIFlagPrototyped, spFlags: 0)
!910 = !DISubroutineType(types: !911)
!911 = !{!16, !255, !895, !7}
!912 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !913, file: !862, line: 118)
!913 = !DISubprogram(name: "strtoul", scope: !857, file: !857, line: 194, type: !914, flags: DIFlagPrototyped, spFlags: 0)
!914 = !DISubroutineType(types: !915)
!915 = !{!498, !255, !895, !7}
!916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !917, file: !862, line: 119)
!917 = !DISubprogram(name: "strtoull", scope: !857, file: !857, line: 197, type: !918, flags: DIFlagPrototyped, spFlags: 0)
!918 = !DISubroutineType(types: !919)
!919 = !{!456, !255, !895, !7}
!920 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !921, file: !862, line: 120)
!921 = !DISubprogram(name: "rand", scope: !857, file: !857, line: 181, type: !922, flags: DIFlagPrototyped, spFlags: 0)
!922 = !DISubroutineType(types: !923)
!923 = !{!7}
!924 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !925, file: !862, line: 121)
!925 = !DISubprogram(name: "srand", scope: !857, file: !857, line: 183, type: !926, flags: DIFlagPrototyped, spFlags: 0)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !452}
!928 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !929, file: !862, line: 122)
!929 = !DISubprogram(name: "calloc", scope: !930, file: !930, line: 55, type: !931, flags: DIFlagPrototyped, spFlags: 0)
!930 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/malloc/_malloc.h", directory: "", checksumkind: CSK_MD5, checksum: "169c9ed8662627a4a4d92e321cfa866c")
!931 = !DISubroutineType(types: !932)
!932 = !{!371, !649, !649}
!933 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !934, file: !862, line: 123)
!934 = !DISubprogram(name: "free", scope: !930, file: !930, line: 56, type: !935, flags: DIFlagPrototyped, spFlags: 0)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !371}
!937 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !938, file: !862, line: 124)
!938 = !DISubprogram(name: "malloc", scope: !930, file: !930, line: 54, type: !939, flags: DIFlagPrototyped, spFlags: 0)
!939 = !DISubroutineType(types: !940)
!940 = !{!371, !649}
!941 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !942, file: !862, line: 125)
!942 = !DISubprogram(name: "realloc", scope: !930, file: !930, line: 57, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!943 = !DISubroutineType(types: !944)
!944 = !{!371, !371, !649}
!945 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !946, file: !862, line: 126)
!946 = !DISubprogram(name: "abort", scope: !947, file: !947, line: 33, type: !948, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!947 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_abort.h", directory: "", checksumkind: CSK_MD5, checksum: "b8994a53d49770cf67adab87821b3fcb")
!948 = !DISubroutineType(types: !949)
!949 = !{null}
!950 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !951, file: !862, line: 127)
!951 = !DISubprogram(name: "atexit", scope: !857, file: !857, line: 144, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!952 = !DISubroutineType(types: !953)
!953 = !{!7, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!955 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !956, file: !862, line: 128)
!956 = !DISubprogram(name: "exit", scope: !857, file: !857, line: 160, type: !957, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !7}
!959 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !960, file: !862, line: 129)
!960 = !DISubprogram(name: "_Exit", scope: !857, file: !857, line: 210, type: !957, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!961 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !962, file: !862, line: 130)
!962 = !DISubprogram(name: "getenv", scope: !857, file: !857, line: 162, type: !963, flags: DIFlagPrototyped, spFlags: 0)
!963 = !DISubroutineType(types: !964)
!964 = !{!380, !255}
!965 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !966, file: !862, line: 131)
!966 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !857, file: !857, line: 203, type: !881, flags: DIFlagPrototyped, spFlags: 0)
!967 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !968, file: !862, line: 132)
!968 = !DISubprogram(name: "bsearch", scope: !857, file: !857, line: 156, type: !969, flags: DIFlagPrototyped, spFlags: 0)
!969 = !DISubroutineType(types: !970)
!970 = !{!371, !971, !971, !649, !649, !973}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!7, !971, !971}
!976 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !977, file: !862, line: 133)
!977 = !DISubprogram(name: "qsort", scope: !857, file: !857, line: 175, type: !978, flags: DIFlagPrototyped, spFlags: 0)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !371, !649, !649, !973}
!980 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !981, file: !862, line: 134)
!981 = !DISubprogram(name: "abs", linkageName: "_Z3absB8ne200100e", scope: !982, file: !982, line: 123, type: !983, flags: DIFlagPrototyped, spFlags: 0)
!982 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/stdlib.h", directory: "")
!983 = !DISubroutineType(types: !984)
!984 = !{!508, !508}
!985 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !986, file: !862, line: 135)
!986 = !DISubprogram(name: "labs", scope: !857, file: !857, line: 163, type: !987, flags: DIFlagPrototyped, spFlags: 0)
!987 = !DISubroutineType(types: !988)
!988 = !{!494, !494}
!989 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !990, file: !862, line: 136)
!990 = !DISubprogram(name: "llabs", scope: !857, file: !857, line: 167, type: !991, flags: DIFlagPrototyped, spFlags: 0)
!991 = !DISubroutineType(types: !992)
!992 = !{!16, !16}
!993 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !994, file: !862, line: 137)
!994 = !DISubprogram(name: "div", linkageName: "_Z3divB8ne200100xx", scope: !982, file: !982, line: 143, type: !995, flags: DIFlagPrototyped, spFlags: 0)
!995 = !DISubroutineType(types: !996)
!996 = !{!870, !16, !16}
!997 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !998, file: !862, line: 138)
!998 = !DISubprogram(name: "ldiv", scope: !857, file: !857, line: 164, type: !999, flags: DIFlagPrototyped, spFlags: 0)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!864, !494, !494}
!1001 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !1002, file: !862, line: 139)
!1002 = !DISubprogram(name: "lldiv", scope: !857, file: !857, line: 168, type: !995, flags: DIFlagPrototyped, spFlags: 0)
!1003 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !1004, file: !862, line: 140)
!1004 = !DISubprogram(name: "mblen", scope: !857, file: !857, line: 171, type: !1005, flags: DIFlagPrototyped, spFlags: 0)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!7, !255, !649}
!1007 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !1008, file: !862, line: 142)
!1008 = !DISubprogram(name: "mbtowc", scope: !857, file: !857, line: 173, type: !1009, flags: DIFlagPrototyped, spFlags: 0)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!7, !648, !255, !649}
!1011 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !1012, file: !862, line: 143)
!1012 = !DISubprogram(name: "wctomb", scope: !857, file: !857, line: 207, type: !1013, flags: DIFlagPrototyped, spFlags: 0)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!7, !380, !641}
!1015 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !436, entity: !1016, file: !862, line: 144)
!1016 = !DISubprogram(name: "mbstowcs", scope: !857, file: !857, line: 172, type: !1017, flags: DIFlagPrototyped, spFlags: 0)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!649, !648, !255, !649}
