; ModuleID = '/Users/richard/code/ChocolateDescent/main_d2/physics.cpp'
source_filename = "/Users/richard/code/ChocolateDescent/main_d2/physics.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "arm64-apple-macosx15.0.0"

%struct.segment = type { [6 x %struct.side], [6 x i16], [8 x i16], i32 }
%struct.side = type { i8, i8, i16, i16, i16, [4 x %struct.uvl], [2 x %struct.vms_vector] }
%struct.uvl = type { i32, i32, i32 }
%struct.vms_vector = type { i32, i32, i32 }
%struct.object = type { i32, i8, i8, i16, i16, i8, i8, i8, i8, i16, i16, %struct.vms_vector, %struct.vms_matrix, i32, i32, %struct.vms_vector, i8, i8, i8, i8, i32, %union.anon, %union.anon.0, %union.anon.1 }
%struct.vms_matrix = type { %struct.vms_vector, %struct.vms_vector, %struct.vms_vector }
%union.anon = type { %struct.physics_info }
%struct.physics_info = type { %struct.vms_vector, %struct.vms_vector, i32, i32, i32, %struct.vms_vector, %struct.vms_vector, i16, i16 }
%union.anon.0 = type { %struct.ai_static }
%struct.ai_static = type { i8, [11 x i8], i16, i16, i16, i8, i8, i16, i32, i32 }
%union.anon.1 = type { %struct.polyobj_info }
%struct.polyobj_info = type { i32, [10 x %struct.vms_angvec], i32, i32, i32 }
%struct.vms_angvec = type { i16, i16, i16 }
%struct.tmap_info = type { i8, [3 x i8], i32, i32, i16, i16, i16, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Physics_cheat_flag", scope: !2, file: !16, line: 77, type: !12, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "Homebrew clang version 20.1.8", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !13, imports: !345, splitDebugInlining: false, nameTableKind: Apple, sysroot: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk", sdk: "MacOSX15.sdk")
!3 = !DIFile(filename: "/Users/richard/code/ChocolateDescent/main_d2/physics.cpp", directory: "/Users/richard/code/ChocolateDescent/build-c-ref", checksumkind: CSK_MD5, checksum: "e2f2157ae24d6c408eb131ba388d172a")
!4 = !{!5, !8}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !6, line: 30, baseType: !7)
!6 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e6d85c1a9e23dbf7518ce3b162aac800")
!7 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "fix", file: !9, line: 20, baseType: !10)
!9 = !DIFile(filename: "./fix/fix.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c5006a11bf8b4cb7d963898499eda13a")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !11, line: 30, baseType: !12)
!11 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d23e8406e80ee79983f28509c741fa17")
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !{!0, !14, !17, !22, !24, !175, !177, !179, !181, !188, !193, !198, !203, !208, !213, !218, !223, !228, !233, !238, !243, !245, !250, !255, !260, !266, !271, !276, !278, !283, !288, !290, !295, !297, !302, !304, !309, !311, !316, !321, !323, !328, !333, !335, !337, !342}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "floor_levelling", scope: !2, file: !16, line: 92, type: !12, isLocal: false, isDefinition: true)
!16 = !DIFile(filename: "main_d2/physics.cpp", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "e2f2157ae24d6c408eb131ba388d172a")
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "phys_seglist", scope: !2, file: !16, line: 285, type: !19, isLocal: false, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 3200, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 100)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "n_phys_segs", scope: !2, file: !16, line: 285, type: !12, isLocal: false, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "debug_obj", scope: !2, file: !16, line: 295, type: !26, isLocal: false, isDefinition: true)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !28, line: 259, baseType: !29)
!28 = !DIFile(filename: "main_d2/object.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "1f2325d356aae4b692933d2aae4f3afd")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !28, line: 210, size: 2144, flags: DIFlagTypePassByValue, elements: !30, identifier: "_ZTS6object")
!30 = !{!31, !32, !36, !37, !39, !40, !41, !42, !43, !44, !45, !46, !54, !61, !62, !63, !64, !68, !69, !70, !71, !72, !93, !147}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !29, file: !28, line: 212, baseType: !12, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !29, file: !28, line: 213, baseType: !33, size: 8, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !34, line: 31, baseType: !35)
!34 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8b64ccf8c67b8c006b07b8daf1b49be5")
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !29, file: !28, line: 214, baseType: !33, size: 8, offset: 40)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !29, file: !28, line: 215, baseType: !38, size: 16, offset: 48)
!38 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !29, file: !28, line: 215, baseType: !38, size: 16, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !29, file: !28, line: 216, baseType: !33, size: 8, offset: 80)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "movement_type", scope: !29, file: !28, line: 217, baseType: !33, size: 8, offset: 88)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "render_type", scope: !29, file: !28, line: 218, baseType: !33, size: 8, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !28, line: 219, baseType: !33, size: 8, offset: 104)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "segnum", scope: !29, file: !28, line: 220, baseType: !38, size: 16, offset: 112)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "attached_obj", scope: !29, file: !28, line: 221, baseType: !38, size: 16, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !29, file: !28, line: 222, baseType: !47, size: 96, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_vector", file: !48, line: 22, baseType: !49)
!48 = !DIFile(filename: "./vecmat/vecmat.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "dfa84e3325c1ea4f5f74699fff5ef2bf")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_vector", file: !48, line: 19, size: 96, flags: DIFlagTypePassByValue, elements: !50, identifier: "_ZTS10vms_vector")
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !48, line: 21, baseType: !8, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !48, line: 21, baseType: !8, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !49, file: !48, line: 21, baseType: !8, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "orient", scope: !29, file: !28, line: 223, baseType: !55, size: 288, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_matrix", file: !48, line: 47, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_matrix", file: !48, line: 44, size: 288, flags: DIFlagTypePassByValue, elements: !57, identifier: "_ZTS10vms_matrix")
!57 = !{!58, !59, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "rvec", scope: !56, file: !48, line: 46, baseType: !47, size: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "uvec", scope: !56, file: !48, line: 46, baseType: !47, size: 96, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "fvec", scope: !56, file: !48, line: 46, baseType: !47, size: 96, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !29, file: !28, line: 224, baseType: !8, size: 32, offset: 544)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "shields", scope: !29, file: !28, line: 225, baseType: !8, size: 32, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !29, file: !28, line: 226, baseType: !47, size: 96, offset: 608)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "contains_type", scope: !29, file: !28, line: 227, baseType: !65, size: 8, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !66, line: 30, baseType: !67)
!66 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int8_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5052dfe782b50fed2355b8f61a9e4fa9")
!67 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "contains_id", scope: !29, file: !28, line: 228, baseType: !65, size: 8, offset: 712)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "contains_count", scope: !29, file: !28, line: 229, baseType: !65, size: 8, offset: 720)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "matcen_creator", scope: !29, file: !28, line: 230, baseType: !65, size: 8, offset: 728)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "lifeleft", scope: !29, file: !28, line: 231, baseType: !8, size: 32, offset: 736)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mtype", scope: !29, file: !28, line: 240, baseType: !73, size: 512, offset: 768)
!73 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !29, file: !28, line: 236, size: 512, flags: DIFlagTypePassByValue, elements: !74, identifier: "_ZTSN6objectUt_E")
!74 = !{!75, !92}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "phys_info", scope: !73, file: !28, line: 238, baseType: !76, size: 512)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "physics_info", file: !28, line: 153, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "physics_info", file: !28, line: 142, size: 512, flags: DIFlagTypePassByValue, elements: !78, identifier: "_ZTS12physics_info")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !88}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !77, file: !28, line: 144, baseType: !47, size: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "thrust", scope: !77, file: !28, line: 145, baseType: !47, size: 96, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !77, file: !28, line: 146, baseType: !8, size: 32, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "drag", scope: !77, file: !28, line: 147, baseType: !8, size: 32, offset: 224)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "brakes", scope: !77, file: !28, line: 148, baseType: !8, size: 32, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rotvel", scope: !77, file: !28, line: 149, baseType: !47, size: 96, offset: 288)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "rotthrust", scope: !77, file: !28, line: 150, baseType: !47, size: 96, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "turnroll", scope: !77, file: !28, line: 151, baseType: !87, size: 16, offset: 480)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixang", file: !9, line: 21, baseType: !38)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !77, file: !28, line: 152, baseType: !89, size: 16, offset: 496)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !90, line: 31, baseType: !91)
!90 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "f0aa926da906b10566dd3171bf347ab7")
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "spin_rate", scope: !73, file: !28, line: 239, baseType: !47, size: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ctype", scope: !29, file: !28, line: 250, baseType: !94, size: 256, offset: 1280)
!94 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !29, file: !28, line: 243, size: 256, flags: DIFlagTypePassByValue, elements: !95, identifier: "_ZTSN6objectUt0_E")
!95 = !{!96, !107, !117, !135, !140}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "laser_info", scope: !94, file: !28, line: 245, baseType: !97, size: 160)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "laser_info_t", file: !28, line: 166, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "laser_info_s", file: !28, line: 157, size: 160, flags: DIFlagTypePassByValue, elements: !99, identifier: "_ZTS12laser_info_s")
!99 = !{!100, !101, !102, !103, !104, !105, !106}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "parent_type", scope: !98, file: !28, line: 159, baseType: !38, size: 16)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "parent_num", scope: !98, file: !28, line: 160, baseType: !38, size: 16, offset: 16)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "parent_signature", scope: !98, file: !28, line: 161, baseType: !12, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !98, file: !28, line: 162, baseType: !8, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "last_hitobj", scope: !98, file: !28, line: 163, baseType: !38, size: 16, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "track_goal", scope: !98, file: !28, line: 164, baseType: !38, size: 16, offset: 112)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "multiplier", scope: !98, file: !28, line: 165, baseType: !8, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "expl_info", scope: !94, file: !28, line: 246, baseType: !108, size: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "explosion_info", file: !28, line: 176, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "explosion_info", file: !28, line: 168, size: 128, flags: DIFlagTypePassByValue, elements: !110, identifier: "_ZTS14explosion_info")
!110 = !{!111, !112, !113, !114, !115, !116}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "spawn_time", scope: !109, file: !28, line: 170, baseType: !8, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "delete_time", scope: !109, file: !28, line: 171, baseType: !8, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "delete_objnum", scope: !109, file: !28, line: 172, baseType: !38, size: 16, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "attach_parent", scope: !109, file: !28, line: 173, baseType: !38, size: 16, offset: 80)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev_attach", scope: !109, file: !28, line: 174, baseType: !38, size: 16, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next_attach", scope: !109, file: !28, line: 175, baseType: !38, size: 16, offset: 112)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ai_info", scope: !94, file: !28, line: 247, baseType: !118, size: 256)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ai_static", file: !119, line: 144, baseType: !120)
!119 = !DIFile(filename: "main_d2/aistruct.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d122430e792a0ddc0f9eaa08ad217628")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ai_static", file: !119, line: 127, size: 256, flags: DIFlagTypePassByValue, elements: !121, identifier: "_ZTS9ai_static")
!121 = !{!122, !123, !127, !128, !129, !130, !131, !132, !133, !134}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "behavior", scope: !120, file: !119, line: 128, baseType: !33, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !119, line: 129, baseType: !124, size: 88, offset: 8)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 88, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 11)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "hide_segment", scope: !120, file: !119, line: 130, baseType: !38, size: 16, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hide_index", scope: !120, file: !119, line: 131, baseType: !38, size: 16, offset: 112)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !120, file: !119, line: 132, baseType: !38, size: 16, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cur_path_index", scope: !120, file: !119, line: 133, baseType: !65, size: 8, offset: 144)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "dying_sound_playing", scope: !120, file: !119, line: 134, baseType: !65, size: 8, offset: 152)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_num", scope: !120, file: !119, line: 139, baseType: !38, size: 16, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "danger_laser_signature", scope: !120, file: !119, line: 140, baseType: !12, size: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dying_start_time", scope: !120, file: !119, line: 141, baseType: !8, size: 32, offset: 224)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "light_info", scope: !94, file: !28, line: 248, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "light_info_t", file: !28, line: 181, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "light_info_s", file: !28, line: 178, size: 32, flags: DIFlagTypePassByValue, elements: !138, identifier: "_ZTS12light_info_s")
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !137, file: !28, line: 180, baseType: !8, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "powerup_info", scope: !94, file: !28, line: 249, baseType: !141, size: 96)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "powerup_info_t", file: !28, line: 190, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "powerup_info_s", file: !28, line: 185, size: 96, flags: DIFlagTypePassByValue, elements: !143, identifier: "_ZTS14powerup_info_s")
!143 = !{!144, !145, !146}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !142, file: !28, line: 187, baseType: !12, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "creation_time", scope: !142, file: !28, line: 188, baseType: !8, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !142, file: !28, line: 189, baseType: !12, size: 32, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !29, file: !28, line: 257, baseType: !148, size: 608, offset: 1536)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !29, file: !28, line: 253, size: 608, flags: DIFlagTypePassByValue, elements: !149, identifier: "_ZTSN6objectUt1_E")
!149 = !{!150, !168}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pobj_info", scope: !148, file: !28, line: 255, baseType: !151, size: 608)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "polyobj_info", file: !28, line: 208, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "polyobj_info", file: !28, line: 201, size: 608, flags: DIFlagTypePassByValue, elements: !153, identifier: "_ZTS12polyobj_info")
!153 = !{!154, !155, !165, !166, !167}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "model_num", scope: !152, file: !28, line: 203, baseType: !12, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "anim_angles", scope: !152, file: !28, line: 204, baseType: !156, size: 480, offset: 32)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 480, elements: !163)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "vms_angvec", file: !48, line: 40, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vms_angvec", file: !48, line: 37, size: 48, flags: DIFlagTypePassByValue, elements: !159, identifier: "_ZTS10vms_angvec")
!159 = !{!160, !161, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !158, file: !48, line: 39, baseType: !87, size: 16)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !158, file: !48, line: 39, baseType: !87, size: 16, offset: 16)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !158, file: !48, line: 39, baseType: !87, size: 16, offset: 32)
!163 = !{!164}
!164 = !DISubrange(count: 10)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "subobj_flags", scope: !152, file: !28, line: 205, baseType: !12, size: 32, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_override", scope: !152, file: !28, line: 206, baseType: !12, size: 32, offset: 544)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "alt_textures", scope: !152, file: !28, line: 207, baseType: !12, size: 32, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_info", scope: !148, file: !28, line: 256, baseType: !169, size: 96)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "vclip_info_t", file: !28, line: 197, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vclip_info_s", file: !28, line: 192, size: 96, flags: DIFlagTypePassByValue, elements: !171, identifier: "_ZTS12vclip_info_s")
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "vclip_num", scope: !170, file: !28, line: 194, baseType: !12, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "frametime", scope: !170, file: !28, line: 195, baseType: !8, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !170, file: !28, line: 196, baseType: !65, size: 8, offset: 64)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "Total_retries", scope: !2, file: !16, line: 302, type: !12, isLocal: false, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "Total_sims", scope: !2, file: !16, line: 302, type: !12, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "Dont_move_ai_objects", scope: !2, file: !16, line: 303, type: !12, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !16, line: 318, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 112, elements: !186)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!186 = !{!187}
!187 = !DISubrange(count: 14)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !16, line: 318, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 456, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 57)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !16, line: 972, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 176, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 22)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !16, line: 973, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 264, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 33)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1000, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 280, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 35)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1001, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 168, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 21)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1002, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 136, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 17)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1008, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 304, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 38)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1013, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 384, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 48)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1027, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 248, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 31)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1030, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 616, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 77)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1078, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 184, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 23)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1089, type: !200, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1110, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 224, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 28)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1117, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 416, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 52)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1118, type: !257, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 256, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 32)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "cfvi50_count", scope: !262, file: !16, line: 1145, type: !12, isLocal: true, isDefinition: true)
!262 = distinct !DISubprogram(name: "do_physics_sim", linkageName: "_Z14do_physics_simP6object", scope: !16, file: !16, line: 443, type: !263, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !26}
!265 = !{}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1147, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 824, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 103)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1164, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 464, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 58)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1181, type: !220, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1191, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 408, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 51)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1203, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 672, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 84)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1216, type: !240, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1260, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 240, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 30)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1284, type: !230, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1286, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 584, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 73)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1298, type: !195, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1322, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 128, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 16)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1323, type: !215, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1328, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 784, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 98)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1361, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 312, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 39)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1390, type: !292, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1391, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 336, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 42)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1407, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 208, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 26)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1416, type: !215, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1451, type: !230, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !16, line: 1530, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 232, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 29)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression(DW_OP_constu, 16, DW_OP_stack_value))
!343 = distinct !DIGlobalVariable(name: "FRACBITS", scope: !2, file: !9, line: 18, type: !344, isLocal: true, isDefinition: true)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!345 = !{!346, !350, !353, !354, !355, !356, !357, !361, !365, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !404, !408, !411}
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !65, file: !349, line: 158)
!347 = !DINamespace(name: "__1", scope: !348, exportSymbols: true)
!348 = !DINamespace(name: "std", scope: null)
!349 = !DIFile(filename: "/opt/homebrew/Cellar/llvm@20/20.1.8/bin/../include/c++/v1/cstdint", directory: "")
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !351, file: !349, line: 159)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !352, line: 30, baseType: !38)
!352 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_int16_t.h", directory: "", checksumkind: CSK_MD5, checksum: "47ed3c3ac6f65bfec021ca2b7be18e7e")
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !10, file: !349, line: 160)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !5, file: !349, line: 161)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !33, file: !349, line: 163)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !89, file: !349, line: 164)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !358, file: !349, line: 165)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !359, line: 31, baseType: !360)
!359 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint32_t.h", directory: "", checksumkind: CSK_MD5, checksum: "0254eb80c6b9719ac45c3c1cf872109b")
!360 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !362, file: !349, line: 166)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !363, line: 31, baseType: !364)
!363 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uint64_t.h", directory: "", checksumkind: CSK_MD5, checksum: "77fc5e91653260959605f129691cf9b1")
!364 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !366, file: !349, line: 168)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !367, line: 29, baseType: !65)
!367 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "042ceedaf4137a8aaa272d0b27434016")
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !369, file: !349, line: 169)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !367, line: 30, baseType: !351)
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !371, file: !349, line: 170)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !367, line: 31, baseType: !10)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !373, file: !349, line: 171)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !367, line: 32, baseType: !5)
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !375, file: !349, line: 173)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !367, line: 33, baseType: !33)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !377, file: !349, line: 174)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !367, line: 34, baseType: !89)
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !379, file: !349, line: 175)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !367, line: 35, baseType: !358)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !381, file: !349, line: 176)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !367, line: 36, baseType: !362)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !383, file: !349, line: 178)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !367, line: 40, baseType: !65)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !385, file: !349, line: 179)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !367, line: 41, baseType: !351)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !387, file: !349, line: 180)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !367, line: 42, baseType: !10)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !389, file: !349, line: 181)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !367, line: 43, baseType: !5)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !391, file: !349, line: 183)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !367, line: 44, baseType: !33)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !393, file: !349, line: 184)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !367, line: 45, baseType: !89)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !395, file: !349, line: 185)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !367, line: 46, baseType: !358)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !397, file: !349, line: 186)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !367, line: 47, baseType: !362)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !399, file: !349, line: 188)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !400, line: 32, baseType: !401)
!400 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_intptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e478ba47270923b1cca6659f19f02db1")
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !402, line: 40, baseType: !403)
!402 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/arm/_types.h", directory: "", checksumkind: CSK_MD5, checksum: "b270144f57ae258d0ce80b8f87be068c")
!403 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !405, file: !349, line: 189)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !406, line: 34, baseType: !407)
!406 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e70ae655dd1b9d4ae0b1dcc073f5b7e4")
!407 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !409, file: !349, line: 191)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !410, line: 32, baseType: !403)
!410 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_intmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "e37b9240f30f486478152ef3989b1545")
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !347, entity: !412, file: !349, line: 192)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !413, line: 32, baseType: !407)
!413 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX15.sdk/usr/include/_types/_uintmax_t.h", directory: "", checksumkind: CSK_MD5, checksum: "8217a3fbb207d8e87ca5318c313e81c2")
!414 = !{i32 2, !"SDK Version", [2 x i32] [i32 15, i32 4]}
!415 = !{i32 7, !"Dwarf Version", i32 5}
!416 = !{i32 2, !"Debug Info Version", i32 3}
!417 = !{i32 1, !"wchar_size", i32 4}
!418 = !{i32 8, !"PIC Level", i32 2}
!419 = !{i32 7, !"uwtable", i32 1}
!420 = !{i32 7, !"frame-pointer", i32 1}
!421 = !{!"Homebrew clang version 20.1.8"}
!422 = distinct !DISubprogram(name: "check_and_fix_matrix", linkageName: "_Z20check_and_fix_matrixP10vms_matrix", scope: !16, file: !16, line: 100, type: !423, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!426 = !DILocalVariable(name: "m", arg: 1, scope: !422, file: !16, line: 100, type: !425)
!427 = !DILocation(line: 100, column: 39, scope: !422)
!428 = !DILocalVariable(name: "tempm", scope: !422, file: !16, line: 102, type: !55)
!429 = !DILocation(line: 102, column: 13, scope: !422)
!430 = !DILocation(line: 104, column: 29, scope: !422)
!431 = !DILocation(line: 104, column: 32, scope: !422)
!432 = !DILocation(line: 104, column: 38, scope: !422)
!433 = !DILocation(line: 104, column: 41, scope: !422)
!434 = !DILocation(line: 104, column: 2, scope: !422)
!435 = !DILocation(line: 105, column: 3, scope: !422)
!436 = !DILocation(line: 105, column: 6, scope: !422)
!437 = !DILocation(line: 106, column: 1, scope: !422)
!438 = distinct !DISubprogram(name: "do_physics_align_object", linkageName: "_Z23do_physics_align_objectP6object", scope: !16, file: !16, line: 109, type: !263, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!439 = !DILocalVariable(name: "obj", arg: 1, scope: !438, file: !16, line: 109, type: !26)
!440 = !DILocation(line: 109, column: 40, scope: !438)
!441 = !DILocalVariable(name: "desired_upvec", scope: !438, file: !16, line: 163, type: !47)
!442 = !DILocation(line: 163, column: 13, scope: !438)
!443 = !DILocalVariable(name: "delta_ang", scope: !438, file: !16, line: 164, type: !87)
!444 = !DILocation(line: 164, column: 9, scope: !438)
!445 = !DILocalVariable(name: "roll_ang", scope: !438, file: !16, line: 164, type: !87)
!446 = !DILocation(line: 164, column: 19, scope: !438)
!447 = !DILocalVariable(name: "temp_matrix", scope: !438, file: !16, line: 166, type: !55)
!448 = !DILocation(line: 166, column: 13, scope: !438)
!449 = !DILocalVariable(name: "d", scope: !438, file: !16, line: 167, type: !8)
!450 = !DILocation(line: 167, column: 6, scope: !438)
!451 = !DILocalVariable(name: "largest_d", scope: !438, file: !16, line: 167, type: !8)
!452 = !DILocation(line: 167, column: 8, scope: !438)
!453 = !DILocalVariable(name: "i", scope: !438, file: !16, line: 168, type: !12)
!454 = !DILocation(line: 168, column: 6, scope: !438)
!455 = !DILocalVariable(name: "best_side", scope: !438, file: !16, line: 168, type: !12)
!456 = !DILocation(line: 168, column: 8, scope: !438)
!457 = !DILocation(line: 175, column: 8, scope: !458)
!458 = distinct !DILexicalBlock(scope: !438, file: !16, line: 175, column: 2)
!459 = !DILocation(line: 175, column: 7, scope: !458)
!460 = !DILocation(line: 175, column: 11, scope: !461)
!461 = distinct !DILexicalBlock(scope: !458, file: !16, line: 175, column: 2)
!462 = !DILocation(line: 175, column: 12, scope: !461)
!463 = !DILocation(line: 175, column: 2, scope: !458)
!464 = !DILocation(line: 181, column: 8, scope: !465)
!465 = distinct !DILexicalBlock(scope: !461, file: !16, line: 175, column: 20)
!466 = !DILocation(line: 181, column: 6, scope: !465)
!467 = !DILocation(line: 184, column: 7, scope: !468)
!468 = distinct !DILexicalBlock(scope: !465, file: !16, line: 184, column: 7)
!469 = !DILocation(line: 184, column: 11, scope: !468)
!470 = !DILocation(line: 184, column: 9, scope: !468)
!471 = !DILocation(line: 184, column: 35, scope: !472)
!472 = distinct !DILexicalBlock(scope: !468, file: !16, line: 184, column: 22)
!473 = !DILocation(line: 184, column: 33, scope: !472)
!474 = !DILocation(line: 184, column: 48, scope: !472)
!475 = !DILocation(line: 184, column: 47, scope: !472)
!476 = !DILocation(line: 184, column: 50, scope: !472)
!477 = !DILocation(line: 185, column: 2, scope: !465)
!478 = !DILocation(line: 175, column: 16, scope: !461)
!479 = !DILocation(line: 175, column: 2, scope: !461)
!480 = distinct !{!480, !463, !481, !482}
!481 = !DILocation(line: 185, column: 2, scope: !458)
!482 = !{!"llvm.loop.mustprogress"}
!483 = !DILocation(line: 187, column: 6, scope: !484)
!484 = distinct !DILexicalBlock(scope: !438, file: !16, line: 187, column: 6)
!485 = !DILocation(line: 193, column: 29, scope: !486)
!486 = distinct !DILexicalBlock(scope: !484, file: !16, line: 187, column: 23)
!487 = !DILocation(line: 193, column: 34, scope: !486)
!488 = !DILocation(line: 193, column: 20, scope: !486)
!489 = !DILocation(line: 193, column: 42, scope: !486)
!490 = !DILocation(line: 193, column: 51, scope: !486)
!491 = !DILocation(line: 193, column: 18, scope: !486)
!492 = !DILocation(line: 196, column: 2, scope: !486)
!493 = !DILocation(line: 198, column: 31, scope: !494)
!494 = distinct !DILexicalBlock(scope: !484, file: !16, line: 198, column: 7)
!495 = !DILocation(line: 198, column: 36, scope: !494)
!496 = !DILocation(line: 198, column: 22, scope: !494)
!497 = !DILocation(line: 198, column: 44, scope: !494)
!498 = !DILocation(line: 198, column: 50, scope: !494)
!499 = !DILocation(line: 198, column: 7, scope: !494)
!500 = !DILocation(line: 198, column: 61, scope: !494)
!501 = !DILocalVariable(name: "s", scope: !502, file: !16, line: 209, type: !503)
!502 = distinct !DILexicalBlock(scope: !494, file: !16, line: 198, column: 66)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "side", file: !505, line: 91, baseType: !506)
!505 = !DIFile(filename: "main_d2/segment.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "c950815a9b07e6bab2fa2587b90affec")
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "side", file: !505, line: 82, size: 640, flags: DIFlagTypePassByValue, elements: !507, identifier: "_ZTS4side")
!507 = !{!508, !509, !510, !511, !512, !513, !523}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !505, line: 84, baseType: !65, size: 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !506, file: !505, line: 85, baseType: !33, size: 8, offset: 8)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "wall_num", scope: !506, file: !505, line: 86, baseType: !38, size: 16, offset: 16)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_num", scope: !506, file: !505, line: 87, baseType: !38, size: 16, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tmap_num2", scope: !506, file: !505, line: 88, baseType: !38, size: 16, offset: 48)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "uvls", scope: !506, file: !505, line: 89, baseType: !514, size: 384, offset: 64)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 384, elements: !521)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "uvl", file: !505, line: 67, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uvl", file: !505, line: 64, size: 96, flags: DIFlagTypePassByValue, elements: !517, identifier: "_ZTS3uvl")
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !516, file: !505, line: 66, baseType: !8, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !516, file: !505, line: 66, baseType: !8, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !516, file: !505, line: 66, baseType: !8, size: 32, offset: 64)
!521 = !{!522}
!522 = !DISubrange(count: 4)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "normals", scope: !506, file: !505, line: 90, baseType: !524, size: 192, offset: 448)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 192, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 2)
!527 = !DILocation(line: 209, column: 11, scope: !502)
!528 = !DILocation(line: 209, column: 25, scope: !502)
!529 = !DILocation(line: 209, column: 30, scope: !502)
!530 = !DILocation(line: 209, column: 16, scope: !502)
!531 = !DILocation(line: 209, column: 38, scope: !502)
!532 = !DILocation(line: 209, column: 44, scope: !502)
!533 = !DILocation(line: 210, column: 24, scope: !502)
!534 = !DILocation(line: 210, column: 27, scope: !502)
!535 = !DILocation(line: 210, column: 38, scope: !502)
!536 = !DILocation(line: 210, column: 42, scope: !502)
!537 = !DILocation(line: 210, column: 45, scope: !502)
!538 = !DILocation(line: 210, column: 56, scope: !502)
!539 = !DILocation(line: 210, column: 40, scope: !502)
!540 = !DILocation(line: 210, column: 59, scope: !502)
!541 = !DILocation(line: 210, column: 19, scope: !502)
!542 = !DILocation(line: 210, column: 21, scope: !502)
!543 = !DILocation(line: 211, column: 24, scope: !502)
!544 = !DILocation(line: 211, column: 27, scope: !502)
!545 = !DILocation(line: 211, column: 38, scope: !502)
!546 = !DILocation(line: 211, column: 42, scope: !502)
!547 = !DILocation(line: 211, column: 45, scope: !502)
!548 = !DILocation(line: 211, column: 56, scope: !502)
!549 = !DILocation(line: 211, column: 40, scope: !502)
!550 = !DILocation(line: 211, column: 59, scope: !502)
!551 = !DILocation(line: 211, column: 19, scope: !502)
!552 = !DILocation(line: 211, column: 21, scope: !502)
!553 = !DILocation(line: 212, column: 24, scope: !502)
!554 = !DILocation(line: 212, column: 27, scope: !502)
!555 = !DILocation(line: 212, column: 38, scope: !502)
!556 = !DILocation(line: 212, column: 42, scope: !502)
!557 = !DILocation(line: 212, column: 45, scope: !502)
!558 = !DILocation(line: 212, column: 56, scope: !502)
!559 = !DILocation(line: 212, column: 40, scope: !502)
!560 = !DILocation(line: 212, column: 59, scope: !502)
!561 = !DILocation(line: 212, column: 19, scope: !502)
!562 = !DILocation(line: 212, column: 21, scope: !502)
!563 = !DILocation(line: 214, column: 5, scope: !502)
!564 = !DILocation(line: 216, column: 3, scope: !502)
!565 = !DILocation(line: 221, column: 30, scope: !494)
!566 = !DILocation(line: 221, column: 35, scope: !494)
!567 = !DILocation(line: 221, column: 21, scope: !494)
!568 = !DILocation(line: 221, column: 43, scope: !494)
!569 = !DILocation(line: 221, column: 49, scope: !494)
!570 = !DILocation(line: 221, column: 60, scope: !494)
!571 = !DILocation(line: 221, column: 19, scope: !494)
!572 = !DILocation(line: 224, column: 11, scope: !573)
!573 = distinct !DILexicalBlock(scope: !438, file: !16, line: 224, column: 6)
!574 = !DILocation(line: 224, column: 6, scope: !573)
!575 = !DILocation(line: 224, column: 57, scope: !573)
!576 = !DILocalVariable(name: "save_delta_ang", scope: !577, file: !16, line: 225, type: !87)
!577 = distinct !DILexicalBlock(scope: !573, file: !16, line: 224, column: 67)
!578 = !DILocation(line: 225, column: 10, scope: !577)
!579 = !DILocalVariable(name: "tangles", scope: !577, file: !16, line: 226, type: !157)
!580 = !DILocation(line: 226, column: 14, scope: !577)
!581 = !DILocation(line: 228, column: 36, scope: !577)
!582 = !DILocation(line: 228, column: 41, scope: !577)
!583 = !DILocation(line: 228, column: 48, scope: !577)
!584 = !DILocation(line: 228, column: 3, scope: !577)
!585 = !DILocation(line: 230, column: 50, scope: !577)
!586 = !DILocation(line: 230, column: 55, scope: !577)
!587 = !DILocation(line: 230, column: 62, scope: !577)
!588 = !DILocation(line: 230, column: 80, scope: !577)
!589 = !DILocation(line: 230, column: 86, scope: !577)
!590 = !DILocation(line: 230, column: 91, scope: !577)
!591 = !DILocation(line: 230, column: 98, scope: !577)
!592 = !DILocation(line: 230, column: 32, scope: !577)
!593 = !DILocation(line: 230, column: 30, scope: !577)
!594 = !DILocation(line: 230, column: 18, scope: !577)
!595 = !DILocation(line: 232, column: 16, scope: !577)
!596 = !DILocation(line: 232, column: 21, scope: !577)
!597 = !DILocation(line: 232, column: 37, scope: !577)
!598 = !DILocation(line: 232, column: 13, scope: !577)
!599 = !DILocation(line: 234, column: 11, scope: !600)
!600 = distinct !DILexicalBlock(scope: !577, file: !16, line: 234, column: 7)
!601 = !DILocation(line: 234, column: 7, scope: !600)
!602 = !DILocation(line: 234, column: 22, scope: !600)
!603 = !DILocalVariable(name: "rotmat", scope: !604, file: !16, line: 235, type: !55)
!604 = distinct !DILexicalBlock(scope: !600, file: !16, line: 234, column: 34)
!605 = !DILocation(line: 235, column: 15, scope: !604)
!606 = !DILocalVariable(name: "new_pm", scope: !604, file: !16, line: 235, type: !55)
!607 = !DILocation(line: 235, column: 23, scope: !604)
!608 = !DILocation(line: 237, column: 22, scope: !604)
!609 = !DILocation(line: 237, column: 15, scope: !604)
!610 = !DILocation(line: 237, column: 13, scope: !604)
!611 = !DILocation(line: 239, column: 12, scope: !612)
!612 = distinct !DILexicalBlock(scope: !604, file: !16, line: 239, column: 8)
!613 = !DILocation(line: 239, column: 8, scope: !612)
!614 = !DILocation(line: 239, column: 25, scope: !612)
!615 = !DILocation(line: 239, column: 23, scope: !612)
!616 = !DILocation(line: 239, column: 46, scope: !612)
!617 = !DILocation(line: 239, column: 44, scope: !612)
!618 = !DILocation(line: 239, column: 35, scope: !612)
!619 = !DILocation(line: 240, column: 13, scope: !620)
!620 = distinct !DILexicalBlock(scope: !612, file: !16, line: 240, column: 13)
!621 = !DILocation(line: 240, column: 22, scope: !620)
!622 = !DILocation(line: 240, column: 38, scope: !620)
!623 = !DILocation(line: 240, column: 37, scope: !620)
!624 = !DILocation(line: 240, column: 35, scope: !620)
!625 = !DILocation(line: 240, column: 26, scope: !620)
!626 = !DILocation(line: 242, column: 24, scope: !604)
!627 = !DILocation(line: 242, column: 26, scope: !604)
!628 = !DILocation(line: 242, column: 12, scope: !604)
!629 = !DILocation(line: 242, column: 14, scope: !604)
!630 = !DILocation(line: 242, column: 44, scope: !604)
!631 = !DILocation(line: 242, column: 40, scope: !604)
!632 = !DILocation(line: 242, column: 42, scope: !604)
!633 = !DILocation(line: 243, column: 4, scope: !604)
!634 = !DILocation(line: 245, column: 32, scope: !604)
!635 = !DILocation(line: 245, column: 37, scope: !604)
!636 = !DILocation(line: 245, column: 4, scope: !604)
!637 = !DILocation(line: 246, column: 4, scope: !604)
!638 = !DILocation(line: 246, column: 9, scope: !604)
!639 = !DILocation(line: 246, column: 16, scope: !604)
!640 = !DILocation(line: 247, column: 3, scope: !604)
!641 = !DILocation(line: 248, column: 23, scope: !600)
!642 = !DILocation(line: 249, column: 2, scope: !577)
!643 = !DILocation(line: 252, column: 1, scope: !438)
!644 = distinct !DISubprogram(name: "fixmul", linkageName: "_Z6fixmulii", scope: !9, file: !9, line: 83, type: !645, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!645 = !DISubroutineType(types: !646)
!646 = !{!8, !8, !8}
!647 = !DILocalVariable(name: "a", arg: 1, scope: !644, file: !9, line: 83, type: !8)
!648 = !DILocation(line: 83, column: 26, scope: !644)
!649 = !DILocalVariable(name: "b", arg: 2, scope: !644, file: !9, line: 83, type: !8)
!650 = !DILocation(line: 83, column: 33, scope: !644)
!651 = !DILocation(line: 85, column: 19, scope: !644)
!652 = !DILocation(line: 85, column: 32, scope: !644)
!653 = !DILocation(line: 85, column: 21, scope: !644)
!654 = !DILocation(line: 85, column: 35, scope: !644)
!655 = !DILocation(line: 85, column: 9, scope: !644)
!656 = !DILocation(line: 85, column: 2, scope: !644)
!657 = distinct !DISubprogram(name: "set_object_turnroll", linkageName: "_Z19set_object_turnrollP6object", scope: !16, file: !16, line: 254, type: !263, scopeLine: 255, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!658 = !DILocalVariable(name: "obj", arg: 1, scope: !657, file: !16, line: 254, type: !26)
!659 = !DILocation(line: 254, column: 34, scope: !657)
!660 = !DILocalVariable(name: "desired_bank", scope: !657, file: !16, line: 262, type: !87)
!661 = !DILocation(line: 262, column: 9, scope: !657)
!662 = !DILocation(line: 264, column: 25, scope: !657)
!663 = !DILocation(line: 264, column: 30, scope: !657)
!664 = !DILocation(line: 264, column: 46, scope: !657)
!665 = !DILocation(line: 264, column: 53, scope: !657)
!666 = !DILocation(line: 264, column: 18, scope: !657)
!667 = !DILocation(line: 264, column: 17, scope: !657)
!668 = !DILocation(line: 264, column: 15, scope: !657)
!669 = !DILocation(line: 266, column: 6, scope: !670)
!670 = distinct !DILexicalBlock(scope: !657, file: !16, line: 266, column: 6)
!671 = !DILocation(line: 266, column: 11, scope: !670)
!672 = !DILocation(line: 266, column: 27, scope: !670)
!673 = !DILocation(line: 266, column: 39, scope: !670)
!674 = !DILocation(line: 266, column: 36, scope: !670)
!675 = !DILocalVariable(name: "delta_ang", scope: !676, file: !16, line: 267, type: !87)
!676 = distinct !DILexicalBlock(scope: !670, file: !16, line: 266, column: 53)
!677 = !DILocation(line: 267, column: 10, scope: !676)
!678 = !DILocalVariable(name: "max_roll", scope: !676, file: !16, line: 267, type: !87)
!679 = !DILocation(line: 267, column: 20, scope: !676)
!680 = !DILocation(line: 269, column: 31, scope: !676)
!681 = !DILocation(line: 269, column: 14, scope: !676)
!682 = !DILocation(line: 269, column: 12, scope: !676)
!683 = !DILocation(line: 271, column: 15, scope: !676)
!684 = !DILocation(line: 271, column: 30, scope: !676)
!685 = !DILocation(line: 271, column: 35, scope: !676)
!686 = !DILocation(line: 271, column: 51, scope: !676)
!687 = !DILocation(line: 271, column: 28, scope: !676)
!688 = !DILocation(line: 271, column: 13, scope: !676)
!689 = !DILocation(line: 273, column: 12, scope: !690)
!690 = distinct !DILexicalBlock(scope: !676, file: !16, line: 273, column: 7)
!691 = !DILocation(line: 273, column: 7, scope: !690)
!692 = !DILocation(line: 273, column: 25, scope: !690)
!693 = !DILocation(line: 273, column: 23, scope: !690)
!694 = !DILocation(line: 274, column: 15, scope: !690)
!695 = !DILocation(line: 274, column: 13, scope: !690)
!696 = !DILocation(line: 274, column: 4, scope: !690)
!697 = !DILocation(line: 276, column: 8, scope: !698)
!698 = distinct !DILexicalBlock(scope: !690, file: !16, line: 276, column: 8)
!699 = !DILocation(line: 276, column: 18, scope: !698)
!700 = !DILocation(line: 277, column: 17, scope: !698)
!701 = !DILocation(line: 277, column: 16, scope: !698)
!702 = !DILocation(line: 277, column: 14, scope: !698)
!703 = !DILocation(line: 277, column: 5, scope: !698)
!704 = !DILocation(line: 279, column: 36, scope: !676)
!705 = !DILocation(line: 279, column: 3, scope: !676)
!706 = !DILocation(line: 279, column: 8, scope: !676)
!707 = !DILocation(line: 279, column: 24, scope: !676)
!708 = !DILocation(line: 279, column: 33, scope: !676)
!709 = !DILocation(line: 280, column: 2, scope: !676)
!710 = !DILocation(line: 282, column: 1, scope: !657)
!711 = distinct !DISubprogram(name: "do_physics_sim_rot", linkageName: "_Z18do_physics_sim_rotP6object", scope: !16, file: !16, line: 311, type: !263, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!712 = !DILocalVariable(name: "obj", arg: 1, scope: !711, file: !16, line: 311, type: !26)
!713 = !DILocation(line: 311, column: 33, scope: !711)
!714 = !DILocalVariable(name: "tangles", scope: !711, file: !16, line: 313, type: !157)
!715 = !DILocation(line: 313, column: 13, scope: !711)
!716 = !DILocalVariable(name: "rotmat", scope: !711, file: !16, line: 314, type: !55)
!717 = !DILocation(line: 314, column: 13, scope: !711)
!718 = !DILocalVariable(name: "new_orient", scope: !711, file: !16, line: 314, type: !55)
!719 = !DILocation(line: 314, column: 20, scope: !711)
!720 = !DILocalVariable(name: "pi", scope: !711, file: !16, line: 316, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!722 = !DILocation(line: 316, column: 16, scope: !711)
!723 = !DILocation(line: 318, column: 2, scope: !711)
!724 = !DILocation(line: 320, column: 8, scope: !711)
!725 = !DILocation(line: 320, column: 13, scope: !711)
!726 = !DILocation(line: 320, column: 5, scope: !711)
!727 = !DILocation(line: 356, column: 8, scope: !728)
!728 = distinct !DILexicalBlock(scope: !711, file: !16, line: 356, column: 6)
!729 = !DILocation(line: 356, column: 12, scope: !728)
!730 = !DILocation(line: 356, column: 19, scope: !728)
!731 = !DILocation(line: 356, column: 21, scope: !728)
!732 = !DILocation(line: 356, column: 24, scope: !728)
!733 = !DILocation(line: 356, column: 28, scope: !728)
!734 = !DILocation(line: 356, column: 35, scope: !728)
!735 = !DILocation(line: 356, column: 37, scope: !728)
!736 = !DILocation(line: 356, column: 40, scope: !728)
!737 = !DILocation(line: 356, column: 44, scope: !728)
!738 = !DILocation(line: 356, column: 51, scope: !728)
!739 = !DILocation(line: 356, column: 53, scope: !728)
!740 = !DILocation(line: 356, column: 56, scope: !728)
!741 = !DILocation(line: 356, column: 60, scope: !728)
!742 = !DILocation(line: 356, column: 70, scope: !728)
!743 = !DILocation(line: 356, column: 72, scope: !728)
!744 = !DILocation(line: 356, column: 75, scope: !728)
!745 = !DILocation(line: 356, column: 79, scope: !728)
!746 = !DILocation(line: 356, column: 89, scope: !728)
!747 = !DILocation(line: 356, column: 91, scope: !728)
!748 = !DILocation(line: 356, column: 94, scope: !728)
!749 = !DILocation(line: 356, column: 98, scope: !728)
!750 = !DILocation(line: 356, column: 108, scope: !728)
!751 = !DILocation(line: 356, column: 6, scope: !728)
!752 = !DILocation(line: 357, column: 3, scope: !728)
!753 = !DILocation(line: 359, column: 6, scope: !754)
!754 = distinct !DILexicalBlock(scope: !711, file: !16, line: 359, column: 6)
!755 = !DILocation(line: 359, column: 11, scope: !754)
!756 = !DILocation(line: 359, column: 27, scope: !754)
!757 = !DILocalVariable(name: "count", scope: !758, file: !16, line: 360, type: !12)
!758 = distinct !DILexicalBlock(scope: !754, file: !16, line: 359, column: 33)
!759 = !DILocation(line: 360, column: 7, scope: !758)
!760 = !DILocalVariable(name: "accel", scope: !758, file: !16, line: 361, type: !47)
!761 = !DILocation(line: 361, column: 14, scope: !758)
!762 = !DILocalVariable(name: "drag", scope: !758, file: !16, line: 362, type: !8)
!763 = !DILocation(line: 362, column: 7, scope: !758)
!764 = !DILocalVariable(name: "r", scope: !758, file: !16, line: 362, type: !8)
!765 = !DILocation(line: 362, column: 12, scope: !758)
!766 = !DILocalVariable(name: "k", scope: !758, file: !16, line: 362, type: !8)
!767 = !DILocation(line: 362, column: 14, scope: !758)
!768 = !DILocation(line: 364, column: 11, scope: !758)
!769 = !DILocation(line: 364, column: 21, scope: !758)
!770 = !DILocation(line: 364, column: 9, scope: !758)
!771 = !DILocation(line: 365, column: 7, scope: !758)
!772 = !DILocation(line: 365, column: 17, scope: !758)
!773 = !DILocation(line: 365, column: 5, scope: !758)
!774 = !DILocation(line: 366, column: 14, scope: !758)
!775 = !DILocation(line: 366, column: 7, scope: !758)
!776 = !DILocation(line: 366, column: 5, scope: !758)
!777 = !DILocation(line: 368, column: 11, scope: !758)
!778 = !DILocation(line: 368, column: 16, scope: !758)
!779 = !DILocation(line: 368, column: 32, scope: !758)
!780 = !DILocation(line: 368, column: 36, scope: !758)
!781 = !DILocation(line: 368, column: 39, scope: !758)
!782 = !DILocation(line: 368, column: 8, scope: !758)
!783 = !DILocation(line: 370, column: 7, scope: !784)
!784 = distinct !DILexicalBlock(scope: !758, file: !16, line: 370, column: 7)
!785 = !DILocation(line: 370, column: 12, scope: !784)
!786 = !DILocation(line: 370, column: 28, scope: !784)
!787 = !DILocation(line: 370, column: 34, scope: !784)
!788 = !DILocation(line: 372, column: 30, scope: !789)
!789 = distinct !DILexicalBlock(scope: !784, file: !16, line: 370, column: 52)
!790 = !DILocation(line: 372, column: 35, scope: !789)
!791 = !DILocation(line: 372, column: 51, scope: !789)
!792 = !DILocation(line: 372, column: 73, scope: !789)
!793 = !DILocation(line: 372, column: 78, scope: !789)
!794 = !DILocation(line: 372, column: 94, scope: !789)
!795 = !DILocation(line: 372, column: 61, scope: !789)
!796 = !DILocation(line: 372, column: 4, scope: !789)
!797 = !DILocation(line: 374, column: 4, scope: !789)
!798 = !DILocation(line: 374, column: 16, scope: !789)
!799 = !DILocation(line: 374, column: 11, scope: !789)
!800 = !DILocation(line: 376, column: 18, scope: !801)
!801 = distinct !DILexicalBlock(scope: !789, file: !16, line: 374, column: 20)
!802 = !DILocation(line: 376, column: 23, scope: !801)
!803 = !DILocation(line: 376, column: 39, scope: !801)
!804 = !DILocation(line: 376, column: 5, scope: !801)
!805 = !DILocation(line: 378, column: 19, scope: !801)
!806 = !DILocation(line: 378, column: 24, scope: !801)
!807 = !DILocation(line: 378, column: 40, scope: !801)
!808 = !DILocation(line: 378, column: 52, scope: !801)
!809 = !DILocation(line: 378, column: 51, scope: !801)
!810 = !DILocation(line: 378, column: 5, scope: !801)
!811 = distinct !{!811, !797, !812, !482}
!812 = !DILocation(line: 379, column: 4, scope: !789)
!813 = !DILocation(line: 383, column: 23, scope: !789)
!814 = !DILocation(line: 383, column: 28, scope: !789)
!815 = !DILocation(line: 383, column: 44, scope: !789)
!816 = !DILocation(line: 383, column: 58, scope: !789)
!817 = !DILocation(line: 383, column: 4, scope: !789)
!818 = !DILocation(line: 384, column: 18, scope: !789)
!819 = !DILocation(line: 384, column: 23, scope: !789)
!820 = !DILocation(line: 384, column: 39, scope: !789)
!821 = !DILocation(line: 384, column: 58, scope: !789)
!822 = !DILocation(line: 384, column: 60, scope: !789)
!823 = !DILocation(line: 384, column: 51, scope: !789)
!824 = !DILocation(line: 384, column: 50, scope: !789)
!825 = !DILocation(line: 384, column: 4, scope: !789)
!826 = !DILocation(line: 385, column: 3, scope: !789)
!827 = !DILocation(line: 386, column: 15, scope: !828)
!828 = distinct !DILexicalBlock(scope: !784, file: !16, line: 386, column: 12)
!829 = !DILocation(line: 386, column: 20, scope: !828)
!830 = !DILocation(line: 386, column: 36, scope: !828)
!831 = !DILocation(line: 386, column: 42, scope: !828)
!832 = !DILocation(line: 386, column: 14, scope: !828)
!833 = !DILocation(line: 386, column: 12, scope: !828)
!834 = !DILocalVariable(name: "total_drag", scope: !835, file: !16, line: 387, type: !8)
!835 = distinct !DILexicalBlock(scope: !828, file: !16, line: 386, column: 63)
!836 = !DILocation(line: 387, column: 8, scope: !835)
!837 = !DILocation(line: 389, column: 4, scope: !835)
!838 = !DILocation(line: 389, column: 16, scope: !835)
!839 = !DILocation(line: 389, column: 11, scope: !835)
!840 = !DILocation(line: 390, column: 25, scope: !835)
!841 = !DILocation(line: 390, column: 41, scope: !835)
!842 = !DILocation(line: 390, column: 40, scope: !835)
!843 = !DILocation(line: 390, column: 18, scope: !835)
!844 = !DILocation(line: 390, column: 16, scope: !835)
!845 = distinct !{!845, !837, !846, !482}
!846 = !DILocation(line: 390, column: 45, scope: !835)
!847 = !DILocation(line: 394, column: 24, scope: !835)
!848 = !DILocation(line: 394, column: 47, scope: !835)
!849 = !DILocation(line: 394, column: 49, scope: !835)
!850 = !DILocation(line: 394, column: 40, scope: !835)
!851 = !DILocation(line: 394, column: 39, scope: !835)
!852 = !DILocation(line: 394, column: 17, scope: !835)
!853 = !DILocation(line: 394, column: 15, scope: !835)
!854 = !DILocation(line: 396, column: 18, scope: !835)
!855 = !DILocation(line: 396, column: 23, scope: !835)
!856 = !DILocation(line: 396, column: 39, scope: !835)
!857 = !DILocation(line: 396, column: 46, scope: !835)
!858 = !DILocation(line: 396, column: 4, scope: !835)
!859 = !DILocation(line: 397, column: 3, scope: !835)
!860 = !DILocation(line: 399, column: 2, scope: !758)
!861 = !DILocation(line: 406, column: 6, scope: !862)
!862 = distinct !DILexicalBlock(scope: !711, file: !16, line: 406, column: 6)
!863 = !DILocation(line: 406, column: 11, scope: !862)
!864 = !DILocation(line: 406, column: 27, scope: !862)
!865 = !DILocalVariable(name: "new_pm", scope: !866, file: !16, line: 407, type: !55)
!866 = distinct !DILexicalBlock(scope: !862, file: !16, line: 406, column: 37)
!867 = !DILocation(line: 407, column: 14, scope: !866)
!868 = !DILocation(line: 409, column: 23, scope: !866)
!869 = !DILocation(line: 409, column: 25, scope: !866)
!870 = !DILocation(line: 409, column: 11, scope: !866)
!871 = !DILocation(line: 409, column: 13, scope: !866)
!872 = !DILocation(line: 410, column: 16, scope: !866)
!873 = !DILocation(line: 410, column: 21, scope: !866)
!874 = !DILocation(line: 410, column: 37, scope: !866)
!875 = !DILocation(line: 410, column: 15, scope: !866)
!876 = !DILocation(line: 410, column: 11, scope: !866)
!877 = !DILocation(line: 410, column: 13, scope: !866)
!878 = !DILocation(line: 411, column: 3, scope: !866)
!879 = !DILocation(line: 412, column: 31, scope: !866)
!880 = !DILocation(line: 412, column: 36, scope: !866)
!881 = !DILocation(line: 412, column: 3, scope: !866)
!882 = !DILocation(line: 413, column: 3, scope: !866)
!883 = !DILocation(line: 413, column: 8, scope: !866)
!884 = !DILocation(line: 413, column: 15, scope: !866)
!885 = !DILocation(line: 414, column: 2, scope: !866)
!886 = !DILocation(line: 416, column: 21, scope: !711)
!887 = !DILocation(line: 416, column: 26, scope: !711)
!888 = !DILocation(line: 416, column: 42, scope: !711)
!889 = !DILocation(line: 416, column: 49, scope: !711)
!890 = !DILocation(line: 416, column: 51, scope: !711)
!891 = !DILocation(line: 416, column: 14, scope: !711)
!892 = !DILocation(line: 416, column: 10, scope: !711)
!893 = !DILocation(line: 416, column: 12, scope: !711)
!894 = !DILocation(line: 417, column: 21, scope: !711)
!895 = !DILocation(line: 417, column: 26, scope: !711)
!896 = !DILocation(line: 417, column: 42, scope: !711)
!897 = !DILocation(line: 417, column: 49, scope: !711)
!898 = !DILocation(line: 417, column: 51, scope: !711)
!899 = !DILocation(line: 417, column: 14, scope: !711)
!900 = !DILocation(line: 417, column: 10, scope: !711)
!901 = !DILocation(line: 417, column: 12, scope: !711)
!902 = !DILocation(line: 418, column: 22, scope: !711)
!903 = !DILocation(line: 418, column: 27, scope: !711)
!904 = !DILocation(line: 418, column: 43, scope: !711)
!905 = !DILocation(line: 418, column: 50, scope: !711)
!906 = !DILocation(line: 418, column: 52, scope: !711)
!907 = !DILocation(line: 418, column: 15, scope: !711)
!908 = !DILocation(line: 418, column: 10, scope: !711)
!909 = !DILocation(line: 418, column: 13, scope: !711)
!910 = !DILocation(line: 420, column: 2, scope: !711)
!911 = !DILocation(line: 421, column: 34, scope: !711)
!912 = !DILocation(line: 421, column: 39, scope: !711)
!913 = !DILocation(line: 421, column: 2, scope: !711)
!914 = !DILocation(line: 422, column: 2, scope: !711)
!915 = !DILocation(line: 422, column: 7, scope: !711)
!916 = !DILocation(line: 422, column: 14, scope: !711)
!917 = !DILocation(line: 424, column: 6, scope: !918)
!918 = distinct !DILexicalBlock(scope: !711, file: !16, line: 424, column: 6)
!919 = !DILocation(line: 424, column: 11, scope: !918)
!920 = !DILocation(line: 424, column: 27, scope: !918)
!921 = !DILocation(line: 424, column: 33, scope: !918)
!922 = !DILocation(line: 425, column: 23, scope: !918)
!923 = !DILocation(line: 425, column: 3, scope: !918)
!924 = !DILocation(line: 428, column: 6, scope: !925)
!925 = distinct !DILexicalBlock(scope: !711, file: !16, line: 428, column: 6)
!926 = !DILocation(line: 428, column: 11, scope: !925)
!927 = !DILocation(line: 428, column: 27, scope: !925)
!928 = !DILocalVariable(name: "new_pm", scope: !929, file: !16, line: 429, type: !55)
!929 = distinct !DILexicalBlock(scope: !925, file: !16, line: 428, column: 37)
!930 = !DILocation(line: 429, column: 14, scope: !929)
!931 = !DILocation(line: 431, column: 23, scope: !929)
!932 = !DILocation(line: 431, column: 25, scope: !929)
!933 = !DILocation(line: 431, column: 11, scope: !929)
!934 = !DILocation(line: 431, column: 13, scope: !929)
!935 = !DILocation(line: 432, column: 15, scope: !929)
!936 = !DILocation(line: 432, column: 20, scope: !929)
!937 = !DILocation(line: 432, column: 36, scope: !929)
!938 = !DILocation(line: 432, column: 11, scope: !929)
!939 = !DILocation(line: 432, column: 13, scope: !929)
!940 = !DILocation(line: 433, column: 3, scope: !929)
!941 = !DILocation(line: 434, column: 31, scope: !929)
!942 = !DILocation(line: 434, column: 36, scope: !929)
!943 = !DILocation(line: 434, column: 3, scope: !929)
!944 = !DILocation(line: 435, column: 3, scope: !929)
!945 = !DILocation(line: 435, column: 8, scope: !929)
!946 = !DILocation(line: 435, column: 15, scope: !929)
!947 = !DILocation(line: 436, column: 2, scope: !929)
!948 = !DILocation(line: 438, column: 24, scope: !711)
!949 = !DILocation(line: 438, column: 29, scope: !711)
!950 = !DILocation(line: 438, column: 2, scope: !711)
!951 = !DILocation(line: 439, column: 1, scope: !711)
!952 = distinct !DISubprogram(name: "fixdiv", linkageName: "_Z6fixdivii", scope: !9, file: !9, line: 89, type: !645, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !265)
!953 = !DILocalVariable(name: "a", arg: 1, scope: !952, file: !9, line: 89, type: !8)
!954 = !DILocation(line: 89, column: 26, scope: !952)
!955 = !DILocalVariable(name: "b", arg: 2, scope: !952, file: !9, line: 89, type: !8)
!956 = !DILocation(line: 89, column: 33, scope: !952)
!957 = !DILocation(line: 92, column: 6, scope: !958)
!958 = distinct !DILexicalBlock(scope: !952, file: !9, line: 92, column: 6)
!959 = !DILocation(line: 92, column: 8, scope: !958)
!960 = !DILocation(line: 92, column: 14, scope: !958)
!961 = !DILocation(line: 94, column: 25, scope: !952)
!962 = !DILocation(line: 94, column: 27, scope: !952)
!963 = !DILocation(line: 94, column: 36, scope: !952)
!964 = !DILocation(line: 94, column: 34, scope: !952)
!965 = !DILocation(line: 94, column: 14, scope: !952)
!966 = !DILocation(line: 94, column: 2, scope: !952)
!967 = !DILocation(line: 95, column: 1, scope: !952)
!968 = !DILocalVariable(name: "obj", arg: 1, scope: !262, file: !16, line: 443, type: !26)
!969 = !DILocation(line: 443, column: 29, scope: !262)
!970 = !DILocalVariable(name: "ignore_obj_list", scope: !971, file: !16, line: 949, type: !19)
!971 = distinct !DILexicalBlock(scope: !262, file: !16, line: 948, column: 2)
!972 = !DILocation(line: 949, column: 6, scope: !971)
!973 = !DILocalVariable(name: "n_ignore_objs", scope: !971, file: !16, line: 949, type: !12)
!974 = !DILocation(line: 949, column: 39, scope: !971)
!975 = !DILocalVariable(name: "iseg", scope: !971, file: !16, line: 950, type: !12)
!976 = !DILocation(line: 950, column: 6, scope: !971)
!977 = !DILocalVariable(name: "try_again", scope: !971, file: !16, line: 951, type: !12)
!978 = !DILocation(line: 951, column: 6, scope: !971)
!979 = !DILocalVariable(name: "fate", scope: !971, file: !16, line: 952, type: !12)
!980 = !DILocation(line: 952, column: 6, scope: !971)
!981 = !DILocalVariable(name: "frame_vec", scope: !971, file: !16, line: 953, type: !47)
!982 = !DILocation(line: 953, column: 13, scope: !971)
!983 = !DILocalVariable(name: "new_pos", scope: !971, file: !16, line: 954, type: !47)
!984 = !DILocation(line: 954, column: 13, scope: !971)
!985 = !DILocalVariable(name: "ipos", scope: !971, file: !16, line: 954, type: !47)
!986 = !DILocation(line: 954, column: 21, scope: !971)
!987 = !DILocalVariable(name: "count", scope: !971, file: !16, line: 955, type: !12)
!988 = !DILocation(line: 955, column: 6, scope: !971)
!989 = !DILocalVariable(name: "objnum", scope: !971, file: !16, line: 956, type: !12)
!990 = !DILocation(line: 956, column: 6, scope: !971)
!991 = !DILocalVariable(name: "WallHitSeg", scope: !971, file: !16, line: 957, type: !12)
!992 = !DILocation(line: 957, column: 6, scope: !971)
!993 = !DILocalVariable(name: "WallHitSide", scope: !971, file: !16, line: 957, type: !12)
!994 = !DILocation(line: 957, column: 18, scope: !971)
!995 = !DILocalVariable(name: "hit_info", scope: !971, file: !16, line: 958, type: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "fvi_info", file: !997, line: 40, baseType: !998)
!997 = !DIFile(filename: "main_d2/fvi.h", directory: "/Users/richard/code/ChocolateDescent", checksumkind: CSK_MD5, checksum: "d2a92d1b0ff4ebfc1a57eff3c7d6fa46")
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fvi_info", file: !997, line: 29, size: 3584, flags: DIFlagTypePassByValue, elements: !999, identifier: "_ZTS8fvi_info")
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "hit_type", scope: !998, file: !997, line: 31, baseType: !12, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "hit_pnt", scope: !998, file: !997, line: 32, baseType: !47, size: 96, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "hit_seg", scope: !998, file: !997, line: 33, baseType: !12, size: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "hit_side", scope: !998, file: !997, line: 34, baseType: !12, size: 32, offset: 160)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "hit_side_seg", scope: !998, file: !997, line: 35, baseType: !12, size: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "hit_object", scope: !998, file: !997, line: 36, baseType: !12, size: 32, offset: 224)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "hit_wallnorm", scope: !998, file: !997, line: 37, baseType: !47, size: 96, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "n_segs", scope: !998, file: !997, line: 38, baseType: !12, size: 32, offset: 352)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "seglist", scope: !998, file: !997, line: 39, baseType: !19, size: 3200, offset: 384)
!1009 = !DILocation(line: 958, column: 11, scope: !971)
!1010 = !DILocalVariable(name: "fq", scope: !971, file: !16, line: 959, type: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "fvi_query", file: !997, line: 58, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fvi_query", file: !997, line: 50, size: 384, flags: DIFlagTypePassByValue, elements: !1013, identifier: "_ZTS9fvi_query")
!1013 = !{!1014, !1016, !1017, !1018, !1019, !1020, !1022}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "p0", scope: !1012, file: !997, line: 52, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "p1", scope: !1012, file: !997, line: 52, baseType: !1015, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "startseg", scope: !1012, file: !997, line: 53, baseType: !12, size: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !1012, file: !997, line: 54, baseType: !8, size: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "thisobjnum", scope: !1012, file: !997, line: 55, baseType: !38, size: 16, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_obj_list", scope: !1012, file: !997, line: 56, baseType: !1021, size: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1012, file: !997, line: 57, baseType: !12, size: 32, offset: 320)
!1023 = !DILocation(line: 959, column: 12, scope: !971)
!1024 = !DILocalVariable(name: "save_pos", scope: !971, file: !16, line: 960, type: !47)
!1025 = !DILocation(line: 960, column: 13, scope: !971)
!1026 = !DILocalVariable(name: "save_seg", scope: !971, file: !16, line: 961, type: !12)
!1027 = !DILocation(line: 961, column: 6, scope: !971)
!1028 = !DILocalVariable(name: "drag", scope: !971, file: !16, line: 962, type: !8)
!1029 = !DILocation(line: 962, column: 6, scope: !971)
!1030 = !DILocalVariable(name: "sim_time", scope: !971, file: !16, line: 963, type: !8)
!1031 = !DILocation(line: 963, column: 6, scope: !971)
!1032 = !DILocalVariable(name: "old_sim_time", scope: !971, file: !16, line: 963, type: !8)
!1033 = !DILocation(line: 963, column: 15, scope: !971)
!1034 = !DILocalVariable(name: "start_pos", scope: !971, file: !16, line: 964, type: !47)
!1035 = !DILocation(line: 964, column: 13, scope: !971)
!1036 = !DILocalVariable(name: "obj_stopped", scope: !971, file: !16, line: 965, type: !12)
!1037 = !DILocation(line: 965, column: 6, scope: !971)
!1038 = !DILocalVariable(name: "moved_time", scope: !971, file: !16, line: 966, type: !8)
!1039 = !DILocation(line: 966, column: 6, scope: !971)
!1040 = !DILocalVariable(name: "save_p0", scope: !971, file: !16, line: 967, type: !47)
!1041 = !DILocation(line: 967, column: 13, scope: !971)
!1042 = !DILocalVariable(name: "save_p1", scope: !971, file: !16, line: 967, type: !47)
!1043 = !DILocation(line: 967, column: 21, scope: !971)
!1044 = !DILocalVariable(name: "pi", scope: !971, file: !16, line: 968, type: !721)
!1045 = !DILocation(line: 968, column: 16, scope: !971)
!1046 = !DILocalVariable(name: "orig_segnum", scope: !971, file: !16, line: 969, type: !12)
!1047 = !DILocation(line: 969, column: 6, scope: !971)
!1048 = !DILocation(line: 969, column: 20, scope: !971)
!1049 = !DILocation(line: 969, column: 25, scope: !971)
!1050 = !DILocalVariable(name: "bounced", scope: !971, file: !16, line: 970, type: !12)
!1051 = !DILocation(line: 970, column: 6, scope: !971)
!1052 = !DILocation(line: 972, column: 2, scope: !971)
!1053 = !DILocation(line: 973, column: 2, scope: !971)
!1054 = !DILocation(line: 976, column: 5, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !971, file: !16, line: 976, column: 5)
!1056 = !DILocation(line: 977, column: 6, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1055, file: !16, line: 977, column: 6)
!1058 = !DILocation(line: 977, column: 11, scope: !1057)
!1059 = !DILocation(line: 977, column: 24, scope: !1057)
!1060 = !DILocation(line: 978, column: 3, scope: !1057)
!1061 = !DILocation(line: 977, column: 27, scope: !1057)
!1062 = !DILocation(line: 981, column: 8, scope: !971)
!1063 = !DILocation(line: 981, column: 13, scope: !971)
!1064 = !DILocation(line: 981, column: 5, scope: !971)
!1065 = !DILocation(line: 983, column: 21, scope: !971)
!1066 = !DILocation(line: 983, column: 2, scope: !971)
!1067 = !DILocation(line: 985, column: 8, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !971, file: !16, line: 985, column: 6)
!1069 = !DILocation(line: 985, column: 12, scope: !1068)
!1070 = !DILocation(line: 985, column: 21, scope: !1068)
!1071 = !DILocation(line: 985, column: 23, scope: !1068)
!1072 = !DILocation(line: 985, column: 26, scope: !1068)
!1073 = !DILocation(line: 985, column: 30, scope: !1068)
!1074 = !DILocation(line: 985, column: 39, scope: !1068)
!1075 = !DILocation(line: 985, column: 41, scope: !1068)
!1076 = !DILocation(line: 985, column: 44, scope: !1068)
!1077 = !DILocation(line: 985, column: 48, scope: !1068)
!1078 = !DILocation(line: 985, column: 57, scope: !1068)
!1079 = !DILocation(line: 985, column: 59, scope: !1068)
!1080 = !DILocation(line: 985, column: 62, scope: !1068)
!1081 = !DILocation(line: 985, column: 66, scope: !1068)
!1082 = !DILocation(line: 985, column: 73, scope: !1068)
